<?php

// This file is part of Moodle - http://moodle.org/
//
// Moodle is free software: you can redistribute it and/or modify
// it under the terms of the GNU General Public License as published by
// the Free Software Foundation, either version 3 of the License, or
// (at your option) any later version.
//
// Moodle is distributed in the hope that it will be useful,
// but WITHOUT ANY WARRANTY; without even the implied warranty of
// MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
// GNU General Public License for more details.
//
// You should have received a copy of the GNU General Public License
// along with Moodle.  If not, see <http://www.gnu.org/licenses/>.

/**
 * Strings for component 'badges', language 'el', branch 'MOODLE_32_STABLE'
 *
 * @package   badges
 * @copyright 1999 onwards Martin Dougiamas  {@link http://moodle.com}
 * @license   http://www.gnu.org/copyleft/gpl.html GNU GPL v3 or later
 */

defined('MOODLE_INTERNAL') || die();

$string['actions'] = 'Ενέργειες';
$string['activate'] = 'Ενεργοποίηση πρόσβασης';
$string['activatesuccess'] = 'Ενεργοποιηθήκε επιτυχώς η πρόσβαση στις κονκάρδες';
$string['addbadgecriteria'] = 'Προσθήκη κριτηρίων βραβείου';
$string['addcourse'] = 'Προσθήκη μαθημάτων';
$string['addcourse_help'] = 'Επιλέξτε όλα τα μαθήματα που πρέπει να προστεθούν σε αυτή την απαίτηση βραβείου. Κρατήστε πατημένο το πλήκτρο CTRL για να επιλέξετε πολλά στοιχεία.';
$string['addcriteria'] = 'Προσθήκη κριτηρίων';
$string['addcriteriatext'] = 'Για να  ξεκινήσετε να προσθέτετε κριτήρια, επιλέξτε μια από τις επιλογές του drop-down μενού';
$string['addtobackpack'] = 'Προσθήκη στο backpack';
$string['adminonly'] = 'Σε αυτή τη σελίδα έχουν πρόσβαση μόνο οι διαχειριστές.';
$string['after'] = 'μετά την ημερομηνία έκδοσης.';
$string['aggregationmethod'] = 'Μέθοδος συνάθροισης';
$string['all'] = 'Όλα';
$string['allmethod'] = 'Ικανοποιηθούν όλα τα επιλεγμένα κριτήρια';
$string['allmethodactivity'] = 'Ολοκληρωθούν όλες οι επιλεγμένες δραστηριότητες';
$string['allmethodcourseset'] = 'Ολοκληρωθούν όλα τα επιλεγμένα μαθήματα';
$string['allmethodmanual'] = 'Όλοι οι επιλεγμένοι ρόλοι απονείμουν το βραβείο';
$string['allmethodprofile'] = 'Όλα τα επιλεγμένα πεδία προφίλ έχουν ολοκληρωθεί';
$string['allowcoursebadges'] = 'Ενεργοποίηση βραβείων μαθήματος';
$string['allowcoursebadges_desc'] = 'Να επιτρέπεται η δημιουργία και απονομή βραβείων στο πλαίσιο μαθήματος.';
$string['allowexternalbackpack'] = 'Ενεργοποίηση σύνδεσης σε εξωτερικά backpacks';
$string['allowexternalbackpack_desc'] = 'Να επιτρέπεται στους χρήστες να ρυθμίζουν συνδέσεις και να εμφανίζουν βραβεία από εξωτερικούς παρόχους backpack.

Σημείωση: Σας συστήνουμε να αφήσετε αυτή την επιλογή ανενεργή αν δεν υπάρχει άμεση πρόσβαση στην ιστοσελίδα μέσω διαδικτύου (π.χ, μεσολάβηση firewall)';
$string['anymethod'] = 'Ικανοποιηθεί οποιαδήποτε από τις επιλεγμένες συνθήκες';
$string['anymethodactivity'] = 'Ολοκληρωθεί οποιαδήποτε από τις επιλεγμένες δραστηριότητες';
$string['anymethodcourseset'] = 'Ολοκληρωθεί οποιοδήποτε από τα επιλεγμένα μαθήματα';
$string['anymethodmanual'] = 'Οποιοσδήποτε από τους επιλεγμένους ρόλους μπορεί να απονείμει το βραβείο';
$string['anymethodprofile'] = 'Έχει ολοκληρωθεί οποιοδήποτε από τα επιλεγμένα πεδία προφίλ';
$string['archivebadge'] = 'Θέλετε να διαγράψετε το βραβείο \'{$a}\', αλλά να διατηρηθούν τα βραβεία που έχουν εκδοθεί;';
$string['archiveconfirm'] = 'Διαγραφή και διατήρηση εκδοθέντων βραβείων';
$string['archivehelp'] = '<p> Αυτή η επιλογή σημαίνει ότι το βραβείο θα επισημανθεί ως "σε απόσυρση" και δεν θα εμφανίζεται πλέον στη λίστα των βραβείων. Οι χρήστες δεν θα έχουν πλέον τη δυνατότητα να κερδίσουν αυτό το βραβείο, ωστόσο οι υπάρχοντες παραλήπτες του βραβείου θα εξακολουθήσουν να εμφανίζουν αυτό το σήμα στη σελίδα του προφίλ τους και να το προωθούν στα εξωτερικά backpack τους. </p>
<p> Αν θέλετε οι χρήστες σας να διατηρήσουν την πρόσβαση στα κερδισμένα βραβεία τους, είναι σημαντικό να επιλέξετε αυτήν την επιλογή αντί να διαγράψετε πλήρως τα βραβεία. </ p>';
$string['attachment'] = 'Προσθήκη βραβείου στο μήνυμα';
$string['attachment_help'] = 'Αν είναι ενεργοποιημένη, θα επισυναφθεί ένα αρχείο βραβείου που έχει εκδοθεί στο μήνυμα ηλεκτρονικού ταχυδρομείου του παραλήπτη για λήψη. (Για να χρησιμοποιήσετε αυτήν την επιλογή θα πρέπει να ενεργοποιηθούν τα συνημμένα στη Διαχείριση ιστοχώρου > Πρόσθετα > Εκροές μηνυμάτων > Ηλεκτρονικό ταχυδρομείο.)';
$string['award'] = 'Απονομή βραβείου';
$string['awardedtoyou'] = 'Εκδόθηκαν σε μένα';
$string['awards'] = 'Παραλήπτες';
$string['backpackavailability'] = 'Εξωτερική επικύρωση βραβείου';
$string['backpackavailability_help'] = 'Για να μπορούν οι παραλήπτες του βραβείου να αποδείξουν ότι κέρδισαν τα βραβεία τους από εσάς, μια εξωτερική υπηρεσία backpack πρέπει να έχει πρόσβαση στον ιστότοπό σας και να επαληθεύει τα βραβεία που εκδίδονται από αυτήν. Προς το παρόν, ο ιστότοπός σας δεν φαίνεται να είναι προσβάσιμος, πράγμα που σημαίνει ότι τα βραβεία που έχετε ήδη εκδώσει ή πρόκειται να εκδώσετε στο μέλλον δεν μπορούν να εξακριβωθούν.

** Γιατί βλέπω αυτό το μήνυμα; **

Ίσως το firewall σας να εμποδίζει την πρόσβαση από χρήστες εκτός του δικτύου σας, ο ιστότοπός σας να προστατεύεται με κωδικό πρόσβασης ή  να εκτελείτε τον ιστότοπο σε υπολογιστή που δεν είναι διαθέσιμος από το Internet (όπως μηχανή τοπικής ανάπτυξης).

** Πρόκειται για πρόβλημα; **

Θα πρέπει να διορθώσετε αυτό το ζήτημα σε οποιαδήποτε τοποθεσία παραγωγής όπου σχεδιάζετε να εκδίδετε βραβεία, διαφορετικά οι παραλήπτες δεν θα μπορούν να αποδείξουν ότι κέρδισαν τα βραβεία τους από εσάς. Αν ο ιστότοπός σας δεν είναι ακόμα σε λειτουργία, μπορείτε να δημιουργήσετε και να εκδώσετε δοκιμαστικά βραβεία, εφόσον ο ιστότοπος  θα είναι προσβάσιμος πριν ξεκινήσετε τη λειτουργία του.

** Τι γίνεται αν δεν μπορώ να κάνω ολόκληρο τον ιστότοπό μου δημόσια πρόσβασιμο; **

Η μόνη απαιτούμενη διεύθυνση URL για την επαλήθευση είναι η διεύθυνση [your-site-url]/badges/assertion.php. Έτσι εάν μπορείτε να τροποποιήσετε το firewall σας για να επιτρέψετε την εξωτερική πρόσβαση σε αυτό το αρχείο, η επαλήθευση του βραβείου θα εξακολουθήσει να λειτουργεί.';
$string['backpackbadges'] = 'Έχετε {$a->totalbadges} βραβείο(α) που εμφανίζονται από {$a->totalcollections} συλλογές. <a href="mybackpack.php">Αλλαγή ρυθμίσεων backpack</a>.';
$string['backpackcannotsendverification'] = 'Αδυναμία αποστολής email επιβεβαίωσης';
$string['backpackconnection'] = 'Σύνδεση Backpack';
$string['backpackconnectioncancelattempt'] = 'Σύνδεση με τη χρήση διαφορετικών διευθύνσεων email';
$string['backpackconnectionconnect'] = 'Σύνδεση στο Backpack';
$string['backpackconnection_help'] = 'Αυτή η σελίδα σάς επιτρέπει να ρυθμίσετε τη σύνδεση σε έναν εξωτερικό πάροχο backpack. Η σύνδεση σε ένα backpack σας επιτρέπει να εμφανίζετε εξωτερικά βραβεία σε αυτό το site και να προωθείτε τα βραβεία που κερδίζετε εδώ στο backpack σας.

Αυτήν τη στιγμή, υποστηρίζεται μόνο το <a href="http://backpack.openbadges.org"> Backpack του Mozilla OpenBadges </a>. Θα πρέπει να εγγραφείτε σε μια υπηρεσία backpack πριν προσπαθήσετε να ρυθμίσετε τη σύνδεση backpack σε αυτή τη σελίδα';
$string['backpackconnectionresendemail'] = 'Αποστολή ξανά του email επιβεβαίωσης';
$string['backpackconnectionunexpectedresult'] = 'Παρουσιάστηκε πρόβλημα σύνδεσης με το backpack σας. Προσπαθήστε ξανά αργότερα. <br> <br> Εάν το πρόβλημα παραμένει, επικοινωνήστε με τον διαχειριστή του συστήματος σας.';
$string['backpackdetails'] = 'Ρυθμίσεις Backpack';
$string['backpackemail'] = 'Διεύθυνση ηλεκτρονικού ταχυδρομείου';
$string['backpackemailverificationpending'] = 'Σε αναμονή επιβεβαίωσης';
$string['backpackimport'] = 'Ρυθμίσεις εισαγωγής βραβείου';
$string['badgeprivacysetting'] = 'Ρυθμίσεις ιδιωτικότητας βραβείων';
$string['badges'] = 'Βραβεία';
$string['badgesdisabled'] = 'Τα Βραβεία δεν εχουν ενεργοποιηθεί σε αυτή τη σελίδα.';
$string['badgesettings'] = 'Ρυθμίσεις βραβείων';
$string['badgestatus_0'] = 'Μη διαθέσιμα στους χρήστες';
$string['badgestatus_2'] = 'Μη διαθέσιμα στους χρήστες';
$string['badgestatus_4'] = 'Αρχειοθετημένα';
$string['bcriteria'] = 'Κριτήρια';
$string['bdetails'] = 'Επεξεργασία λεπτομερειών';
$string['bmessage'] = 'Μήνυμα';
$string['boverview'] = 'Επισκόπηση';
$string['configenablebadges'] = 'Εάν ενεργοποιηθεί, αυτό το χαρακτηριστικό σας επιτρέπει να δημιουργείτε βραβεία και να τα απονέμετε στους χρήστες του ιστοτόπου.';
$string['createbutton'] = 'Δημιουργία βραβείου';
$string['criteria_1'] = 'Ολοκλήρωση δραστηριότητας';
$string['criteriacreated'] = 'Τα κριτήρια βραβείου δημιουργήθηκαν με επιτυχία';
$string['criteriasummary'] = 'Σύνοψη κριτηρίων';
$string['eventbadgecreated'] = 'Το βραβείο δημιουργήθηκε';
$string['eventbadgecriteriacreated'] = 'Τα κριτήρια βραβείου δημιουργήθηκαν';
$string['message'] = 'Σώμα μηνύματος';
$string['month'] = 'Μήνας (-ες)';
$string['newbadge'] = 'Προσθήκη νέου βραβείου';
$string['notifymonthly'] = 'Μηνιαία';
$string['save'] = 'Αποθήκευση';
$string['sitebadges'] = 'Βραβεία ιστοτόπου';
$string['status_help'] = 'Η κατάσταση ενός βραβείου καθορίζει τη συμπεριφορά του στο σύστημα:
<br/><br/>
* **ΔΙΑΘΕΣΙΜΟ** - Σημαίνει ότι αυτό το βραβείο μπορεί να αποκτηθεί από τους χρήστες. Όταν ένα βραβείο είναι διαθέσιμο στους χρήστες, δεν είναι δυνατή η τροποποίηση των κριτηρίων του.
<br/><br/>
* **ΜΗ ΔΙΑΘΕΣΙΜΟ** - Σημαίνει ότι αυτό το βραβείο δεν είναι διαθέσιμο στους χρήστες και δεν μπορεί να αποκτηθεί ή να εκδοθεί χειροκίνητα. Αν το βραβείο αυτό δεν έχει εκδοθεί ποτέ πριν, είναι δυνατή η αλλαγή των κριτηρίων.
<br/><br/>
Μόλις ένα βραβείο εκδοθεί για τουλάχιστον έναν χρήστη, γίνεται αυτόματα **ΚΛΕΙΔΩΜΕΝΟ**. Τα κλειδωμένα βραβεία μπορούν ακόμα να αποκτηθούν από τους χρήστες, αλλά δεν είναι πλέον  δυνατή η αλλαγή των κριτηρίων τους. Αν χρειάζεται να τροποποιήσετε τις λεπτομέρειες ή τα κριτήρια ενός κλειδωμένου βραβείου, μπορείτε να αντιγράψετε το βραβείο και να κάνετε όλες τις απαιτούμενες αλλαγές.
<br/><br/>
*Γιατί κλειδώνουμε βραβεία;*
<br/><br/>
Θέλουμε να είμαστε σίγουροι ότι όλοι οι χρήστες πληρούν τις ίδιες απαιτήσεις για να αποκτήσουν ένα βραβείο. Επί του παρόντος, δεν είναι δυνατή η ανάκληση βραβείων. Αν επιτρέπαμε τη συνεχή τροποποίηση των απαιτήσεων των βραβείων, πιθανότατα θα καταλήγαμε με χρήστες που θα είχαν το ίδιο βραβείο για την κάλυψη εντελώς διαφορετικών απαιτήσεων.';
$string['subject'] = 'Θέμα μηνύματος';
