<?php

// This file is part of Moodle - http://moodle.org/
//
// Moodle is free software: you can redistribute it and/or modify
// it under the terms of the GNU General Public License as published by
// the Free Software Foundation, either version 3 of the License, or
// (at your option) any later version.
//
// Moodle is distributed in the hope that it will be useful,
// but WITHOUT ANY WARRANTY; without even the implied warranty of
// MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
// GNU General Public License for more details.
//
// You should have received a copy of the GNU General Public License
// along with Moodle.  If not, see <http://www.gnu.org/licenses/>.

/**
 * Strings for component 'hub', language 'el', branch 'MOODLE_36_STABLE'
 *
 * @package   hub
 * @copyright 1999 onwards Martin Dougiamas  {@link http://moodle.com}
 * @license   http://www.gnu.org/copyleft/gpl.html GNU GPL v3 or later
 */

defined('MOODLE_INTERNAL') || die();

$string['addscreenshots'] = 'Προσθήκη στιγμιοτύπων οθόνης';
$string['advertise'] = 'Μοιραστείτε αυτό το μάθημα για να συμμετάσχουν χρήστες';
$string['advertised'] = 'Για να συμμετάσχουν χρήστες';
$string['advertiseon'] = 'Μοιραστείτε αυτό το μάθημα με {$a}';
$string['advertiseonhub'] = 'Μοιραστείτε αυτό το μάθημα για να συμμετάσχουν χρήστες';
$string['advertiseonmoodleorg'] = 'Διαφήμιση αυτού του μαθήματος στο moodle.org';
$string['advertisepublication_help'] = 'Αυτό το μάθημα θα εμφανιστεί στο Moodle.net ως ένα μάθημα όπου άτομα μπορούν να εγγραφούν και να συμμετάσχουν. Η αυτο-καταχώρηση με χρήση ηλεκτρονικού ταχυδρομείου θα πρέπει να είναι ενεργοποιημένη στον ιστότοπο και θα πρέπει να ενεργοποιήσετε την αυτο-εγγραφή σε αυτό το μάθημα.';
$string['all'] = 'Όλοι';
$string['allowglobalsearch'] = 'Δημοσιεύστε αυτόν τον κεντρικό κόμβο και επιτρέψτε καθολικές αναζητήσεις μέσα από όλα τα μαθήματα';
$string['allowpublicsearch'] = 'Δημοσιεύστε αυτόν τον κεντρικό κόμβο ώστε ο κόσμος να μπορεί να τον χρησιμοποιήσει';
$string['audience'] = 'Ακροατήριο (Kοινό)';
$string['audienceadmins'] = 'Διαχειριστές του Moodle';
$string['audienceeducators'] = 'Εκπαιδευτές, Διδάσκοντες, κ.λπ.';
$string['audience_help'] = 'Επιλέξτε το επιθυμητό ακροατήριο για το μάθημα.';
$string['audiencestudents'] = 'Μαθητές, Φοιτητές, Σπουδαστές, Εκπαιδευόμενοι';
$string['badgesnumber'] = 'Αριθμός διακριτικών ({$a})';
$string['badurlformat'] = 'Μη έγκυρος μορφότυπος διεύθυνσης URL';
$string['cannotsearchcommunity'] = 'Λυπούμαστε! Δεν έχετε τα σωστά δικαιώματα για να δείτε αυτή τη σελίδα';
$string['community'] = 'Κοινότητα';
$string['communityremoved'] = 'Εκείνος ο σύνδεσμος έχει απομακρυνθεί από τη λίστα σας';
$string['completeregistration'] = 'Ολοκλήρωση εγγραφής στο Moodle.net';
$string['confirmregistration'] = 'Επιβεβαίωση εγγραφής';
$string['contactable'] = 'Επικοινωνία με το κοινό';
$string['contactable_help'] = 'Αν οριστεί σε «ναι», ο κεντρικός κόμβος θα εμφανίζει την διεύθυνση ηλ. ταχυδρομείου σας.';
$string['contactemail'] = 'Διεύθυνση επικοινωνίας ηλεκτρονικού ταχυδρομείου';
$string['contactname'] = 'Όνομα επικοινωνίας';
$string['contactphone'] = 'Τηλέφωνο';
$string['contactphone_help'] = 'Οι αριθμοί τηλεφώνου εμφανίζονται μόνο στον διαχειριστή του κεντρικού κόμβου και δεν εμφανίζονται δημόσια.';
$string['continue'] = 'Συνέχεια';
$string['contributornames'] = 'Άλλοι συνεισφέροντες';
$string['contributornames_help'] = 'Μπορείτε να χρησιμοποιήσετε αυτό το πεδίο για να απαριθμήσετε τα ονόματα οποιουδήποτε άλλου που συνέβαλε σε αυτό το μάθημα.';
$string['coursemap'] = 'Χάρτης μαθήματος';
$string['coursename'] = 'Όνομα';
$string['courseprivate'] = 'Ιδιωτικό';
$string['coursepublic'] = 'Δημόσιο';
$string['coursepublished'] = 'Αυτό το μάθημα έχει διαμοιραστεί με επιτυχία στο «{$a}».';
$string['courseshortname'] = 'Σύντομο όνομα';
$string['courseshortname_help'] = 'Εισαγάγετε ένα σύντομο όνομα για το μάθημά σας. Δεν χρειάζεται να είναι μοναδικό.';
$string['coursesnumber'] = 'Αριθμός μαθημάτων ({$a})';
$string['courseunpublished'] = 'Το μάθημα {$a->courseshortname} δεν διαμοιράζεται πλέον από τον κεντρικό κόμβο {$a->hubname}.';
$string['courseurl'] = 'Διεύθυνση URL μαθήματος';
$string['courseurl_help'] = 'Είναι η διεύθυνση URL του μαθήματός σας. Αυτή η διεύθυνση εμφανίζεται ως σύνδεσμος σε ένα αποτέλεσμα αναζήτησης.';
$string['creatorname'] = 'Δημιουργός';
$string['creatorname_help'] = 'Δημιουργός είναι ο δημιουργός του μαθήματος.';
$string['creatornotes'] = 'Σημειώσεις δημιουργού';
$string['creatornotes_help'] = 'Οι σημειώσεις δημιουργού είναι ένας οδηγός για τους διδάσκοντες σχετικά με τον τρόπο χρήσης του μαθήματος.';
$string['deletescreenshots'] = 'Διαγράψτε αυτά τα στιγμιότυπα οθόνης';
$string['deletescreenshots_help'] = 'Διαγραφή όλων των ήδη ανεβασμένων στιγμιοτύπων οθόνης.';
$string['demourl'] = 'Διεύθυνση URL επίδειξης';
$string['demourl_help'] = 'Καταχωρήστε τη URL διεύθυνση επίδειξης του μαθήματος. Από προεπιλογή, είναι η διεύθυνση του μαθήματός σας. Η διεύθυνση επίδειξης εμφανίζεται ως σύνδεσμος σε ένα αποτέλεσμα αναζήτησης.';
$string['description'] = 'Περιγραφή';
$string['description_help'] = 'Αυτό το κείμενο περιγραφής θα εμφανίζεται στην λίστα του μαθήματος στο Moodle.net.';
$string['detectednotexistingpublication'] = 'Ο κεντρικός κόμβος {$a->hubname} εμφανίζει στη λίστα του ένα μάθημα που δεν υπάρχει πλέον. Ειδοποιήστε τον διαχειριστή του κόμβου ότι η δημοσίευση με αριθμό {$a->id} πρέπει να αφαιρεθεί.';
$string['downloadable'] = 'Μπορεί να γίνει λήψη';
$string['educationallevel'] = 'Εκπαιδευτικό επίπεδο';
$string['educationallevel_help'] = 'Επιλέξτε το καταλληλότερο εκπαιδευτικό επίπεδο στο οποίο ταιριάζει το μάθημα.';
$string['edulevelassociation'] = 'Ένωση, Σωματείο, κ.λπ.';
$string['edulevelcorporate'] = 'Επιχείρηση, Εταιρία, κ.λπ.';
$string['edulevelgovernment'] = 'Κρατική υπηρεσία, κ.λπ.';
$string['edulevelother'] = 'Άλλο';
$string['edulevelprimary'] = 'Πρωτοβάθμια εκπαίδευση';
$string['edulevelsecondary'] = 'Δευτεροβάθμια εκπαίδευση';
$string['eduleveltertiary'] = 'Τριτοβάθμια εκπαίδευση';
$string['emailalert'] = 'Ειδοποιήσεις μέσω ηλ. ταχυδρομείου';
$string['emailalert_help'] = 'Αν ενεργοποιηθεί, ο διαχειριστής του κεντρικού κόμβου θα σας στέλνει μηνύματα ηλ. ταχυδρομείου για ζητήματα ασφαλείας και άλλα σημαντικά νέα.';
$string['enrollable'] = 'Μπορεί να γίνει εγγραφή';
$string['errorbadimageheightwidth'] = 'Η εικόνα θα πρέπει να έχει μέγιστο μέγεθος {$a->width} X {$a->height}';
$string['errorcourseinfo'] = 'Παρουσιάστηκε σφάλμα κατά την ανάκτηση μεταδεδομένων μαθήματος από {$a}. Παρακαλούμε, δοκιμάστε ξανά να ανακτήσετε τα μεταδεδομένα του μαθήματος ξαναφορτώνοντας αυτή τη σελίδα αργότερα. Διαφορετικά, μπορείτε να αποφασίσετε να συνεχίσετε τη διαδικασία καταχώρησης με τα ακόλουθα προεπιλεγμένα μεταδεδομένα.';
$string['errorcoursepublish'] = 'Παρουσιάστηκε σφάλμα κατά τη δημοσίευση του μαθήματος ({$a}). Παρακαλώ προσπαθήστε ξανά αργότερα.';
$string['errorcoursewronglypublished'] = 'Ένα σφάλμα δημοσίευσης έχει επιστραφεί από το Moodle.net. Παρακαλώ προσπαθήστε ξανά αργότερα.';
$string['errorcron'] = 'Ένα σφάλμα παρουσιάστηκε κατά την ενημέρωση καταχώρησης στον κεντρικό κόμβο «{$a->hubname}» ({$a->errormessage})';
$string['errorcronnoxmlrpc'] = 'Το XML-RPC πρέπει να ενεργοποιηθεί για την ενημέρωση της εγγραφής.';
$string['errorhublisting'] = 'Ένα σφάλμα παρουσιάστηκε κατά την ανάκτηση της λίστας κεντρικών κόμβων από το Moodle. Παρακαλούμε, δοκιμάστε ξανά αργότερα. ({$a})';
$string['errorlangnotrecognized'] = 'Ο παρεχόμενος κώδικας γλώσσας δεν είναι αναγνωρίσιμος από το Moodle. Παρακαλώ επικοινωνήστε με τον/την {$a}';
$string['errorotherhubsnotsupported'] = 'Αυτή η σελίδα δεν μπορεί πλέον να χρησιμοποιηθεί για εγγραφή σε άλλους ιστοτόπους εκτός του Moodle.net';
$string['errorregistration'] = 'Παρουσιάστηκε σφάλμα κατά την εγγραφή. Παρακαλούμε δοκιμάστε ξανά αργότερα. ({$a})';
$string['errorregistrationupdate'] = 'Παρουσιάστηκε σφάλμα κατά την ενημέρωση εγγραφής ({$a})';
$string['errorunpublishcourses'] = 'Λόγω μη αναμενόμενου σφάλματος, τα μαθήματα δεν ήταν δυνατό να διαγραφούν από το Moodle.net. Δοκιμάστε ξανά αργότερα (συνιστάται) ή επικοινωνήστε με τον διαχειριστή του Moodle.net.';
$string['errorws'] = '{$a}';
$string['errorwstokenreset'] = '{$a}. Το κουπόνι εγγραφής σε αυτόν τον ιστότοπο έχει επαναφερθεί. Τώρα μπορείτε να καταχωρήσετε ξανά τον ιστότοπό σας.';
$string['existingscreenshotnumber'] = '{$a} υπάρχοντα στιγμιότυπα οθόνης. Θα μπορείτε να βλέπετε αυτά τα στιγμιότυπα οθόνης σε αυτή τη σελίδα, μόλις ο διαχειριστής του Moodle.net ενεργοποιήσει το μάθημά σας.';
$string['existingscreenshots'] = 'Υπάρχοντα στιγμιότυπα οθόνης';
$string['forceunregister'] = 'Ναι, καθαρισμός δεδομένων εγγραφής';
$string['forceunregisterconfirmation'] = 'Ο ιστότοπός σας δεν μπορεί να επικοινωνήσει με τον {$a}. Αυτός ο κεντρικός κόμβος μπορεί να είναι προσωρινά εκτός λειτουργίας. Εκτός αν είστε σίγουροι ότι θέλετε να συνεχίσετε την αφαίρεση της καταχώρησης τοπικά, παρακαλούμε ακυρώστε και προσπαθήστε ξανά αργότερα.';
$string['geolocation'] = 'Γεωτοποθεσία';
$string['geolocation_help'] = 'Στο μέλλον ίσως παρέχουμε αναζήτηση βάσει τοποθεσίας. Αν θέλετε να καθορίσετε την τοποθεσία για το μάθημά σας, χρησιμοποιήστε εδώ μια τιμή γεωγραφικού πλάτους/μήκους (π.χ.: -31.947884, 115.871285). Ένας τρόπος για να την βρείτε είναι να χρησιμοποιήσετε το Google Maps.';
$string['hub'] = 'Κεντρικός κόμβος';
$string['imageurl'] = 'Διεύθυνση URL εικόνας';
$string['imageurl_help'] = 'Αυτή η εικόνα θα εμφανιστεί στον κεντρικό κόμβο και πρέπει να είναι διαθέσιμη από τον κόμβο ανά πάσα στιγμή. Η εικόνα πρέπει να έχει μέγιστο μέγεθος {$a->width} X {$a->height} (ΥxΠ)';
$string['information'] = 'Πληροφορίες';
$string['issuedbadgesnumber'] = 'Αριθμός εκδοθέντων διακριτικών ({$a})';
$string['language'] = 'Γλώσσα';
$string['language_help'] = 'Η κύρια γλώσσα αυτού του μαθήματος.';
$string['lasttimechecked'] = 'Τελευταία φορά που ελέγχθηκε';
$string['licence'] = 'Άδεια';
$string['licence_help'] = 'Επιλέξτε την άδεια με την οποία θέλετε να διανείμετε το μάθημά σας.';
$string['licence_link'] = 'άδειες';
$string['logourl'] = 'Διεύθυνση URL λογότυπου';
$string['mobilenotificationsenabled'] = 'Ενεργοποιημένες ειδοποιήσεις κινητών ({$a})';
$string['mobileservicesenabled'] = 'Ενεργοποιημένες υπηρεσίες κινητών ({$a})';
$string['modulenumberaverage'] = 'Μέσος όρος αριθμού αρθρωμάτων μαθήματος ({$a})';
$string['moodleorg'] = 'Moodle';
$string['mustselectsubject'] = 'Πρέπει να επιλέξετε ένα θέμα';
$string['name'] = 'Όνομα';
$string['name_help'] = 'Αυτό το όνομα θα εμφανίζεται στην καταχώρηση του μαθήματος.';
$string['neverchecked'] = 'Ποτέ δεν ελέγχθηκε';
$string['next'] = 'Επόμενο';
$string['no'] = 'Όχι';
$string['nocheckstatusfromunreghub'] = 'Ο ιστότοπος δεν είναι καταχωρημένος στον κεντρικό κόμβο οπότε η κατάστασή του δεν μπορεί να ελεγχθεί.';
$string['nohubselected'] = 'Δεν επιλέχθηκε κανένας κεντρικός κόμβος';
$string['none'] = 'Κανένα';
$string['nosearch'] = 'Να μην δημοσιευτούν κεντρικοί κόμβοι ή μαθήματα';
$string['notregisteredonhub'] = 'Ο διαχειριστής του ιστοτόπου σας πρέπει να καταχωρήσει αυτόν τον ιστότοπο στο Moodle.net πριν να μπορέσετε να μοιραστείτε ένα μάθημα.';
$string['notregisteredonmoodleorg'] = 'Ο διαχειριστής του ιστοτόπου σας πρέπει να καταχωρήσει αυτόν τον ιστότοπο στο Moodle.net (παλιά moodle.org).';
$string['operation'] = 'Ενέργειες';
$string['orenterprivatehub'] = 'Εναλλακτικά, δώστε μια διεύθυνση URL ενός ιδιωτικού κεντρικού κόμβου:';
$string['participantnumberaverage'] = 'Μέσος όρος αριθμού συμμετεχόντων ({$a})';
$string['policyagreed'] = 'Ειδοποίηση περί απορρήτου και συμφωνία επεξεργασίας δεδομένων';
$string['policyagreeddesc'] = 'Συμφωνώ με την <a href="{$a}" target="_blank"> ειδοποίηση περί απορρήτου και συμφωνία επεξεργασίας δεδομένων</a> για το Moodle.net';
$string['postaladdress'] = 'Ταχυδρομική διεύθυνση';
$string['postaladdress_help'] = 'Ταχυδρομική διεύθυνση αυτού του ιστοτόπου, ή της οντότητας που αντιπροσωπεύεται από αυτόν τον ιστότοπο.';
$string['postsnumber'] = 'Αριθμός αναρτήσεων ({$a})';
$string['previousregistrationdeleted'] = 'Η προηγούμενη εγγραφή έχει διαγραφεί από {$a}. Μπορείτε να ξεκινήσετε εκ νέου τη διαδικασία εγγραφής. Ευχαριστούμε.';
$string['prioritise'] = 'Ορισμός προτεραιότητας';
$string['privacy'] = 'Ιδιωτικότητα';
$string['privacy_help'] = 'Ο κεντρικός κόμβος ίσως χρειαστεί να εμφανίσει μια λίστα καταχωρημένων ιστοτόπων. Αν το κάνει τότε μπορείτε να επιλέξετε εάν θα εμφανίζεστε ή όχι σε αυτή τη λίστα.';
$string['private'] = 'Ιδιωτικός';
$string['privatehuburl'] = 'Διεύθυνση URL ιδιωτικού κεντρικού κόμβου';
$string['publicationinfo'] = 'Πληροφορίες δημοσίευσης μαθημάτων';
$string['publichub'] = 'Δημόσιος κεντρικός κόμβος';
$string['publish'] = 'Διαμοιρασμός';
$string['publishcourse'] = 'Διαμοιρασμός {$a}';
$string['publishcourseon'] = 'Διαμοιρασμός στο {$a}';
$string['publishedon'] = 'Διαμοιρασμός μαθήματος';
$string['publisheremail'] = 'Διεύθυνση ηλ. ταχυδρομείου του εκδότη';
$string['publisheremail_help'] = 'Η διεύθυνση ηλ. ταχυδρομείου του εκδότη επιτρέπει στον διαχειριστή του κεντρικού κόμβου να (προ)ειδοποιεί τον εκδότη για οποιεσδήποτε αλλαγές στην κατάσταση του δημοσιευμένου μαθήματος.';
$string['publishername'] = 'Εκδότης';
$string['publishername_help'] = 'Εκδότης είναι το άτομο ή ο οργανισμός που είναι ο επίσημος εκδότης του μαθήματος. Εκτός αν το δημοσιεύετε εξ ονόματος κάποιου άλλου, συνήθως θα είστε εσείς.';
$string['publishon'] = 'Διαμοιρασμός στο';
$string['publishonspecifichub'] = 'Δημοσιεύστε σε έναν άλλο κεντρικό κόμβο';
$string['questionsnumber'] = 'Αριθμός ερωτήσεων ({$a})';
$string['readvertiseon'] = 'Ενημέρωση διαφημιστικών πληροφοριών στο {$a}';
$string['registeredactiveuserdevices'] = 'Αριθμός ενεργών χρηστών με καταχωρημένες κινητές συσκευές που λαμβάνουν ειδοποιήσεις ({$a})';
$string['registeredcourses'] = 'Καταχωρημένα μαθήματα';
$string['registeredmoodleorg'] = 'Moodle ({$a})';
$string['registeredon'] = 'Που είναι καταχωρημένος ο ιστότοπός σας';
$string['registeredsites'] = 'Καταχωρημένοι ιστότοποι';
$string['registereduserdevices'] = 'Αριθμός χρηστών με καταχωρημένες κινητές συσκευές ({$a})';
$string['registermoochtips'] = 'Κάνοντας καταχώρηση, θα λαμβάνετε συναγερμικές ειδοποιήσεις ασφαλείας, θα μπορείτε να ενεργοποιήσετε προωθητικές ειδοποιήσεις από τον ιστότοπό σας προς την εφαρμογή κινητών, και συνεισφέρετε στις στατιστικές του Moodle για την παγκόσμια κοινότητα.';
$string['registersite'] = 'Καταχώρηση στο {$a}';
$string['registerwith'] = 'Καταχωρηθήτε σε έναν κεντρικό κόμβο';
$string['registerwithmoodleorg'] = 'Καταχώρηση του ιστοτόπου σας';
$string['registerwithmoodleorgcomplete'] = 'Ολοκλήρωση της καταχώρησης του ιστοτόπου σας';
$string['registerwithmoodleorginfo'] = 'Θα θέλαμε να μείνουμε σε επαφή και να σας παρέχουμε σημαντικά πράγματα για την ιστοσελίδα σας Moodle! Με την καταχώρησή σας:

* Μπορείτε να εγγραφείτε για να λαμβάνετε ειδοποιήσεις για νέες εκδόσεις/διανομές Moodle, ειδοποιήσεις/συναγερμούς ασφαλείας και άλλα σημαντικά νέα.
* Μπορείτε να αποκτήσετε πρόσβαση και να ενεργοποιήσετε προωθητικές ειδοποιήσεις από τον ιστότοπό σας Moodle μέσω της δωρεάν εφαρμογής Moodle για κινητά.
* Συμβάλλετε στις στατιστικές Moodle της παγκόσμιας κοινότητας, οι οποίες μας βοηθούν να βελτιώσουμε το Moodle και τους δικτυακούς τόπους της κοινότητάς μας.
* Εάν επιθυμείτε, ο ιστότοπός σας μπορεί να συμπεριληφθεί στον κατάλογο των καταχωρημένων ιστοτόπων Moodle στη χώρα σας.';
$string['registerwithmoodleorginfoapp'] = 'Σχετικά με την εφαρμογή κινητού Moodle';
$string['registerwithmoodleorginfosites'] = 'Όλοι ιστότοποι στη χώρα μου';
$string['registerwithmoodleorginfostats'] = 'Στατιστικά Moodle';
$string['registerwithmoodleorgupdate'] = 'Ενημέρωση της καταχώρησης του ιστοτόπου σας';
$string['registrationconfirmed'] = 'Η εγγραφή στον ιστότοπο επιβεβαιώθηκε';
$string['registrationconfirmedon'] = 'Σας ευχαριστούμε για την καταχώρηση του ιστοτόπου σας. Οι πληροφορίες καταχώρησης θα ενημερώνονται από την προγραμματισμένη εργασία «Καταχώρηση ιστοτόπου».';
$string['registrationinfo'] = 'Πληροφορίες καταχώρησης';
$string['registrationupdated'] = 'Η καταχώρηση ενημερώθηκε.';
$string['registrationupdatedfailed'] = 'Η ενημέρωση της καταχώρησης απέτυχε.';
$string['removefromhub'] = 'Αφαίρεση από το Moodle.net';
$string['renewregistration'] = 'Ανανέωση καταχώρησης';
$string['resourcesnumber'] = 'Αριθμός πόρων ({$a})';
$string['restartregistration'] = 'Επανεκκίνηση καταχώρησης';
$string['roleassignmentsnumber'] = 'Αριθμός ρόλων που ανατέθηκαν ({$a})';
$string['screenshots'] = 'Στιγμιοτύπα οθόνης';
$string['screenshots_help'] = 'Οποιαδήποτε στιγμιότυπα οθόνης του μαθήματος θα εμφανιστούν στα αποτελέσματα αναζήτησης.';
$string['search'] = 'Αναζήτηση';
$string['selecthub'] = 'Επιλέξτε κεντρικό κόμβο';
$string['selecthubforadvertise'] = 'Επιλέξτε κεντρικό κόμβο για διαφήμιση';
$string['selecthubforsharing'] = 'Επιλέξτε κεντρικό κόμβο για ανέβασμα';
$string['selecthubinfo'] = 'Ένας κεντρικός κόμβος κοινότητας είναι ένας εξυπηρετητής που διατηρεί λίστα με μαθήματα. Μπορείτε να διαμοιράσετε τα μαθήματά σας μόνο σε κεντρικούς κόμβους στους οποίους ο ιστότοπός σας Moodle είναι καταχωρημένος. Αν ο κεντρικός κόμβος που επιθυμείτε δεν εμφανίζεται στην παρακάτω λίστα, παρακαλούμε επικοινωνήστε με τον διαχειριστή του ιστοτόπου σας.';
$string['sendfollowinginfo'] = 'Περισσότερες πληροφορίες';
$string['sendfollowinginfo_help'] = 'Οι ακόλουθες πληροφορίες θα σταλούν για να συμβάλλουν μόνο σε γενικά στατιστικά στοιχεία. Δεν θα δημοσιοποιηθούν σε καμία λίστα ιστοτόπων.';
$string['sendingcourse'] = 'Αποστολή μαθήματος';
$string['sendingsize'] = 'Παρακαλούμε, περιμένετε. Το αρχείο μαθήματος ανεβαίνει ({$a->total} Mb)...';
$string['sent'] = '...ολοκληρώθηκε';
$string['settings'] = 'Ρυθμίσεις';
$string['settingsupdated'] = 'Οι ρυθμίσεις έχουν ενημερωθεί.';
$string['share'] = 'Μοιραστείτε αυτό το μάθημα για να μπορεί να γίνει λήψη από χρήστες';
$string['shared'] = 'Για να μπορεί να γίνει λήψη από χρήστες';
$string['shareon'] = 'Ανεβάστε αυτό το μάθημα στο {$a}';
$string['shareonhub'] = 'Ανεβάστε αυτό το μάθημα σε έναν κεντρικό κόμβο';
$string['sharepublication_help'] = 'Ένα αντίγραφο αυτού του μαθήματος θα είναι διαθέσιμο στο Moodle.net για να επαναφερθεί και να χρησιμοποιηθεί από τους χρήστες στο δικό τους ιστότοπο.';
$string['siteadmin'] = 'Διαχειριστής';
$string['siteadmin_help'] = 'Το πλήρες όνομα του διαχειριστή του ιστοτόπου.';
$string['sitecommnews'] = 'Ενημερωτικό δελτίο Moodle';
$string['sitecommnews_help'] = 'Έχετε την επιλογή να εγγραφείτε στο ενημερωτικό δελτίο του Moodle. Μπορείτε να εγγραφείτε οποιαδήποτε στιγμή.';
$string['sitecommnewsno'] = 'Όχι, δεν θέλω να λαμβάνω οποιαδήποτε μηνύματα ηλεκτρονικού ταχυδρομείου';
$string['sitecommnewsyes'] = 'Ναι, θα ήθελα να λαμβάνω το ενημερωτικό δελτίο του Moodle';
$string['sitecountry'] = 'Χώρα';
$string['sitecountry_help'] = 'Η χώρα στην οποία βρίσκεται ο οργανισμός ή το ίδρυμά σας.';
$string['sitecreated'] = 'Ο ιστότοπος δημιουργήθηκε';
$string['sitedesc'] = 'Περιγραφή';
$string['sitedesc_help'] = 'Παρέχετε κάποιες πληροφορίες για το πως χρησιμοποιείτε το Moodle.';
$string['siteemail'] = 'Διεύθυνση ηλεκτρονικού ταχυδρομείου διαχειριστή';
$string['siteemail_help'] = 'Μια διεύθυνση ηλ. ταχυδρομείου είναι απαραίτητη έτσι ώστε το επιτελείο του Moodle HQ να μπορεί να έρθει σε επαφή μαζί σας αν χρειαστεί. Μπορεί να χρησιμοποιηθεί επίσης για άλλους σκοπούς αν το επιτρέψετε παρακάτω. Προτείνουμε μια γενική διεύθυνση ηλ. ταχυδρομείου σχετική με μια θέση (π.χ. proistamenos@etairia1.gr), όχι μια προσωπική διεύθυνση.';
$string['sitegeolocation'] = 'Γεωτοποθεσία';
$string['sitegeolocation_help'] = 'Στο μέλλον μπορεί να παρέχουμε αναζήτηση κεντρικών κόμβων με βάση την τοποθεσία. Αν θέλετε να καθορίσετε την τοποθεσία του ιστοτόπου σας χρησιμοποιήστε μια τιμή γεωγραφικό πλάτος/μήκος εδώ (π.χ. -31.947884,115.871285). Ένας τρόπος για να το βρείτε αυτό είναι να χρησιμοποιήσετε τους χάρτες του Google.';
$string['sitelang'] = 'Γλώσσα';
$string['sitelang_help'] = 'Ποια είναι η κύρια γλώσσα που χρησιμοποιείται στον Moodle ιστότοπό σας;';
$string['sitename'] = 'Όνομα';
$string['sitename_help'] = 'Το όνομα του ιστοτόπου θα εμφανιστεί στην λίστα ιστοτόπων αν o κεντρικός κόμβος το επιτρέπει.';
$string['sitephone'] = 'Τηλέφωνο';
$string['sitephone_help'] = 'Το τηλέφωνό σας θα το δει μόνο ο διαχειριστής του κεντρικού κόμβου';
$string['siteprivacy'] = 'Λίστα ιστοτόπου (Ιδιωτικότητα)';
$string['siteprivacy_help'] = 'Μπορείτε να επιλέξετε να εμφανίζεται ο ιστότοπός σας δημόσια στη λίστα των καταχωρημένων ιστοτόπων, με ή χωρίς σύνδεσμο προς αυτόν.';
$string['siteprivacylinked'] = 'Εμφάνιση του ονόματος του ιστοτόπου μου μαζί με τον σύνδεσμο';
$string['siteprivacynotpublished'] = 'Να μην εμφανίζεται ο ιστότοπός μου στη λίστα';
$string['siteprivacypublished'] = 'Εμφάνιση μόνο του ονόματος του ιστοτόπου μου';
$string['siteregconfcomment'] = 'Ο ιστότοπός σας χρειάζεται μια τελική επιβεβαίωση για {$a} (προκειμένου να αποφευχθούν ανεπίκλητα ηλεκτρονικά μηνύματα (spam) στο {$a})';
$string['siteregistrationcontact'] = 'Εμφάνιση φόρμας επικοινωνίας';
$string['siteregistrationcontact_help'] = 'Αν το επιτρέψετε, άλλα άτομα στην κοινότητα μας Moodle (που χρειάζονται λογαριασμό σύνδεσης) μπορούν να επικοινωνήσουν μαζί σας μέσω μιας φόρμας στον ιστότοπο της Moodle κοινότητάς μας. Ωστόσο, δεν θα μπορέσουν ποτέ να δουν τη διεύθυνση ηλεκτρονικού ταχυδρομείου σας.';
$string['siteregistrationemail'] = 'Ειδοποιήσεις νέων διανομών Moodle, συναγερμοί/ειδοποιήσεις ασφαλείας και άλλα τεχνικά θέματα';
$string['siteregistrationemail_help'] = 'Έχετε την επιλογή να εγγραφείτε στη λίστα ηλεκτρονικού ταχυδρομείου χαμηλού όγκου, για ειδοποιήσεις νέων διανομών Moodle, συναγερμούς/ειδοποιήσεις ασφαλείας και άλλα σημαντικά νέα. Μπορείτε να διακόψετε την εγγραφή σας οποιαδήποτε στιγμή.';
$string['siteregistrationupdated'] = 'Η καταχώρηση ιστοτόπου ενημερώθηκε';
$string['siterelease'] = 'Έκδοση/διανομή Moodle';
$string['siterelease_help'] = 'Ακριβής αριθμός (υπο)έκδοσης/διανομής του Moodle αυτού του ιστοτόπου.';
$string['sitereleasenum'] = 'Έκδοση/διανομή Moodle ({$a})';
$string['siteupdatedcron'] = 'Η καταχώρηση ιστοτόπου ενημερώθηκε σε «{$a}»';
$string['siteupdatesend'] = 'Ολοκληρώθηκε η ενημέρωση καταχώρησης στους κεντρικούς κόμβους.';
$string['siteupdatesstart'] = 'Ξεκίνησε η ενημέρωση καταχώρησης στους κεντρικούς κόμβους...';
$string['siteurl'] = 'Διεύθυνση URL ιστοτόπου';
$string['siteurl_help'] = 'Αυτό το URL είναι η διεύθυνση αυτού του ιστοτόπου. Αν οι ρυθμίσεις απορρήτου επιτρέπουν στους επισκέπτες να βλέπουν τις διευθύνσεις ιστοτόπων, τότε αυτό εδώ είναι το URL που θα χρησιμοποιηθεί.';
$string['siteversion'] = 'Έκδοση Moodle';
$string['siteversion_help'] = 'Η έκδοση Moodle αυτού του ιστοτόπου.';
$string['skipregistration'] = 'Παράλειψη';
$string['specifichubregistrationdetail'] = 'Μπορείτε επίσης να καταχωρήσετε τον ιστότοπό σας σε άλλους κεντρικούς κόμβους της κοινότητας.';
$string['statistics'] = 'Ιδιωτικότητα στατιστικών';
$string['status'] = 'Κατάσταση λίστας';
$string['statuspublished'] = 'Στη λίστα';
$string['statusunpublished'] = 'Όχι στη λίστα';
$string['subject'] = 'Θέμα';
$string['subject_help'] = 'Επιλέξτε την κύρια θεματική περιοχή που καλύπτει το μάθημα.';
$string['tags'] = 'Ετικέτες';
$string['tags_help'] = 'Οι ετικέτες συμβάλλουν στην περαιτέρω κατηγοριοποίηση του μαθήματός σας και στη διευκόλυνση της εύρεσης του. Χρησιμοποιήστε απλές, γεμάτες σημασία λέξεις και διαχωρίστε τις με κόμμα. Παράδειγμα: μαθηματικά, άλγεβρα, γεωμετρία';
$string['trustme'] = 'Εμπιστοσύνη';
$string['type'] = 'Διαμοιραζόμενο';
$string['unknownstatus'] = 'Άγνωστη';
$string['unlistedurl'] = 'Διεύθυνση URL κεντρικού κόμβου που δεν εμφανίζεται στη λίστα';
$string['unprioritise'] = 'Αναίρεση προτεραιότητας';
$string['unpublish'] = 'Διακοπή διαμοιρασμού';
$string['unpublishalladvertisedcourses'] = 'Αφαιρέστε όλα τα μαθήματα που μοιράστηκαν στο Moodle.net για συμμετοχή από χρήστες';
$string['unpublishalluploadedcourses'] = 'Αφαιρέστε όλα τα μαθήματα που μοιράστηκαν στο Moodle.net για λήψη από χρήστες';
$string['unpublishconfirmation'] = 'Θέλετε πραγματικά να αφαιρεθεί το μάθημα «{$a->courseshortname}» από τον κεντρικό κόμβο «{$a->hubname}»;';
$string['unpublishcourse'] = 'Διακοπή διαμοιρασμού {$a}';
$string['unregister'] = 'Διαγραφή καταχώρησης';
$string['unregisterconfirmation'] = 'Πρόκειται να διαγράψετε την καταχώρηση αυτού του ιστοτόπου από τον κεντρικό κόμβο {$a}. Μόλις αποσυνδεθείτε από αυτόν, δεν θα μπορείτε να διαχειριστείτε όποια μαθήματα αφήσατε εκεί. Είστε σίγουροι ότι θέλετε  να διαγράψετε την καταχώρηση;';
$string['unregisterexplained'] = 'Αν ο ιστότοπος με διεύθυνση URL {$a} έχει εγγραφεί στο Moodle.net, η εγγραφή του θα καταργηθεί.';
$string['unregisterfrom'] = 'Διαγραφή καταχώρησης από {$a}';
$string['unregistrationerror'] = 'Ένα σφάλμα παρουσιάστηκε όταν ο ιστότοπος προσπάθησε να διαγράψει την καταχώρηση από το Moodle.net: {$a}';
$string['untrustme'] = 'Μη έμπιστο';
$string['update'] = 'Ενημέρωση';
$string['updatesite'] = 'Ενημέρωση εγγραφής στο {$a}';
$string['updatesiteregistration'] = 'Ενημέρωση καταχώρησης';
$string['updatestatus'] = 'Έλεγχος τώρα.';
$string['uploaded'] = 'Ανεβασμένα';
$string['url'] = 'Διεύθυνση URL κεντρικού κόμβου';
$string['urlalreadyregistered'] = 'Ο ιστότοπός σας φαίνεται να είναι ήδη καταχωρημένος στο Moodle.net, πράγμα που σημαίνει ότι κάτι έχει πάει στραβά. Επικοινωνήστε με το διαχειριστή του Moodle.net για να επαναφέρετε την καταχώρησή σας, ώστε να μπορείτε να δοκιμάσετε ξανά.';
$string['usedifferentemail'] = 'Χρήση διαφορετικής διεύθυνσης ηλ. ταχυδρομείου';
$string['usersnumber'] = 'Αριθμός χρηστών ({$a})';
$string['warning'] = 'ΠΡΟΕΙΔΟΠΟΙΗΣΗ';
$string['wrongtoken'] = 'Η εγγραφή απέτυχε για κάποιο άγνωστο λόγο (δίκτυο;). Παρακαλούμε προσπαθήστε ξανά.';
$string['wrongurlformat'] = 'Μη έγκυρος μορφότυπος διεύθυνσης URL';
$string['xmlrpcdisabledcommunity'] = 'Η επέκταση XML-RPC δεν είναι ενεργοποιημένη στον εξυπηρετητή. Δεν μπορείτε να κάνετε αναζήτηση και να κατεβάσετε μαθήματα.';
$string['xmlrpcdisabledpublish'] = 'Η επέκταση XML-RPC δεν είναι ενεργοποιημένη στον εξυπηρετητή, επομένως δεν είναι δυνατή η κοινή χρήση μαθημάτων ή η διαχείριση διαμοιραζόμενων μαθημάτων.';
$string['xmlrpcdisabledregistration'] = 'Η επέκταση XML-RPC δεν είναι ενεργοποιημένη στον εξυπηρετητή. Δεν θα μπορείτε να διαγράψετε ή να ενημερώσετε την καταχώρησή σας μέχρι να την ενεργοποιήσετε.';
