<?php

// This file is part of Moodle - http://moodle.org/
//
// Moodle is free software: you can redistribute it and/or modify
// it under the terms of the GNU General Public License as published by
// the Free Software Foundation, either version 3 of the License, or
// (at your option) any later version.
//
// Moodle is distributed in the hope that it will be useful,
// but WITHOUT ANY WARRANTY; without even the implied warranty of
// MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
// GNU General Public License for more details.
//
// You should have received a copy of the GNU General Public License
// along with Moodle.  If not, see <http://www.gnu.org/licenses/>.

/**
 * Strings for component 'resource', language 'el', branch 'MOODLE_31_STABLE'
 *
 * @package   resource
 * @copyright 1999 onwards Martin Dougiamas  {@link http://moodle.com}
 * @license   http://www.gnu.org/copyleft/gpl.html GNU GPL v3 or later
 */

defined('MOODLE_INTERNAL') || die();

$string['clicktodownload'] = 'Πατήστε στο σύνδεσμο {$a} για να κατεβάσετε το αρχείο.';
$string['clicktoopen2'] = 'Πατήστε στο σύνδεσμο {$a} για να δείτε το αρχείο.';
$string['configdisplayoptions'] = 'Επιλέξτε όλες τις επιλογές που θα πρέπει να είναι διαθέσιμες, οι υπάρχουσες ρυθμίσεις δεν τροποποιούνται. Κρατήστε πατημένο το πλήκτρο CTRL για να επιλέξετε πολλαπλά πεδία.';
$string['configframesize'] = 'Όταν μια ιστοσελίδα ή ένα φορτωμένο αρχείο εμφανίζεται μέσα σε πλαίσιο, αυτή η τιμή είναι το μέγεθος (σε εικονοστοιχεία) του πλαισίου στην κορυφή (που περιέχει την πλοήγηση).';
$string['configparametersettings'] = 'Αυτό ορίζει την προκαθορισμένη τιμή για τις ρυθμίσεις Παραμέτρων στην φόρμα όταν προστίθενται νέες πηγές. Μετά την πρώτη φορά, αυτό γίνεται προσωπική επιλογή του κάθε χρήστη.';
$string['configpopup'] = 'Όταν προσθέσετε μία νέα πηγή η οποία μπορεί να εμφανιστεί σε αναδυόμενο παράθυρο, να είναι ενεργοποιημένη από την αρχή αυτή η δυνατότητα;';
$string['configpopupdirectories'] = 'Να εμφανίζονται συνδέσεις φακέλων στα αναδυόμενα παράθυρα εξ ορισμού;';
$string['configpopupheight'] = 'Ποιο είναι το προεπιλεγμένο ύψος των αναδυόμενων παραθύρων;';
$string['configpopuplocation'] = 'Να εμφανίζεται η γραμμή διευθύνσεων στα αναδυόμενα παράθυρα εξ ορισμού;';
$string['configpopupmenubar'] = 'Να εμφανίζεται η γραμμή μενού στα αναδυόμενα παράθυρα εξ ορισμού;';
$string['configpopupresizable'] = 'Να υπάρχει η δυνατότητα αλλαγής του μεγέθους ενός αναδυόμενου παραθύρου εξ ορισμού;';
$string['configpopupscrollbars'] = 'Να υπάρχει δυνατότητα εμφάνισης γραμμή κύλισης στα αναδυόμενα παράθυρα εξ ορισμού;';
$string['configpopupstatus'] = 'Να εμφανίζεται η γραμμή κατάστασης στα αναδυόμενα παράθυρα  εξ ορισμού;';
$string['configpopuptoolbar'] = 'Να εμφανίζονται οι εργαλειοθήκες στα αναδυόμενα παράθυρα εξ ορισμού;';
$string['configpopupwidth'] = 'Ποιο είναι το προεπιλεγμένο πλάτος για τα νέα popup παράθυρα;';
$string['contentheader'] = 'Περιεχόμενο';
$string['displayoptions'] = 'Διαθέσιμες επιλογές εμφάνισης';
$string['displayselect'] = 'Εμφάνιση';
$string['displayselectexplain'] = 'Επιλέξτε τύπο εμφάνισης, δυστυχώς δεν είναι όλοι οι τύποι κατάλληλοι για όλα τα αρχεία.';
$string['displayselect_help'] = 'Η ρύθμιση αυτή, μαζί με τον τύπο αρχείου και κατά πόσον ο περιηγητής επιτρέπει την ενσωμάτωση, καθορίζει πως θα εμφανίζεται το αρχείο. Οι επιλογές περιλαμβάνουν: * Αυτόματο - Η καλύτερη επιλογή εμφάνισης για τον τύπο αρχείου είναι να επιλεγεί αυτόματα * Ενσωμάτωση -Το αρχείο εμφανίζεται μέσα στη σελίδα κάτω από τη μπάρα πλοήγησης μαζί με την περιγραφή του αρχείου και οποιοδήποτε μπλοκ * Επιβολή κατεβάσματος αρχείου - Ζητείται από το χρήστη να κατεβάσει το αρχείο * Ανοιχτό - Μόνο το αρχείο εμφανίζεται στο παράθυρο του περιηγητή * Σε αναδυόμενο παράθυρο - Το αρχείο  εμφανίζεται σε ένα νέο παράθυρο του περιηγητή χωρίς μενού ή γραμμή διευθύνσεων * Σε πλαίσιο - Το αρχείο εμφανίζεται μέσα σε ένα πλαίσιο κάτω από τη μπάρα πλοήγησης και την περιγραφή αρχείου * Νέο παράθυρο - Το αρχείο εμφανίζεται σε ένα νέο παράθυρο περιηγητή με μενού και γραμμή διευθύνσεων';
$string['dnduploadresource'] = 'Δημιουργία πηγής πληροφόρισης';
$string['encryptedcode'] = 'Κρυπτογραφημένος Κώδικας';
$string['filenotfound'] = 'Το αρχείο δεν βρέθηκε';
$string['filterfiles'] = 'Χρήση φίλτρων για το περιεχόμενο αρχείου';
$string['filterfilesexplain'] = 'Επιλέξτε τύπο φιλτραρίσματος για το περιεχόμενο του αρχείου, παρακαλώ σημειώστε ότι αυτό μπορεί να προκαλέσει προβλήματα για ορισμένες Flash και Java εφαρμογές. Παρακαλώ βεβαιωθείτε ότι όλα τα αρχεία κειμένου είναι σε κωδικοποίηση UTF-8.';
$string['filtername'] = 'Αυτόματη σύνδεση ονομάτων πηγών';
$string['forcedownload'] = 'Επιβολή κατεβάσματος αρχείου';
$string['framesize'] = 'Μέγεθος πλαισίου';
$string['legacyfiles'] = 'Μετάπτωση από παλαιότερο αρχείο μαθήματος';
$string['legacyfilesactive'] = 'Ενεργό';
$string['legacyfilesdone'] = 'Τελείωσε';
$string['modifieddate'] = 'Τροποποιήθηκε {$a}';
$string['modulename'] = 'Πηγή πληροφοριών';
$string['modulename_help'] = 'Το άρθρωμα πηγή πληροφοριών επιτρέπει σε έναν διδάσκοντα να παρέχει ένα αρχείο ως πόρος του μαθήματος. Όπου είναι δυνατόν, το αρχείο θα εμφανιστεί στη διεπαφή του μαθήματος, διαφορετικά θα ζητηθεί από τους μαθητές να το κατεβάσουν. Το αρχείο μπορεί να περιλαμβάνει συνοδευτικά αρχεία, για παράδειγμα, μια σελίδα HTML μπορεί να έχει ενσωματωμένες εικόνες ή Flash αντικείμενα.<br/><br/>
Σημειώστε ότι οι μαθητές πρέπει να έχουν το κατάλληλο λογισμικό στους υπολογιστές τους για να ανοίξουν το αρχείο.<br/><br/>
Ένα αρχείο μπορεί να χρησιμοποιηθεί<br/><br/>
* Για το διαμοιρασμό παρουσιάσειων στην τάξη<br/>
* Για να συμπεριλάβετε μια μίνι ιστοσελίδα ως πόρο του μαθήματος<br/>
* Για να παρέχει προσχέδια αρχείων συγκεκριμένων προγραμμάτων λογισμικού (π.χ. Photoshop .psd), έτσι ώστε οι μαθητές να μπορούν να τα επεξεργαστούν και να τα υποβάλουν προς αξιολόγηση';
$string['modulenameplural'] = 'Πηγές πληροφοριών';
$string['notmigrated'] = 'Αυτός ο τύπος κληρονομιά πόρων ({$ a}) δεν είχε ακόμη μεταναστεύσει, συγγνώμη.';
$string['optionsheader'] = 'Επιλογές εμφάνισης';
$string['page-mod-resource-x'] = 'Οποιαδήποτε σελίδα του αρθρώματος πηγή πληροφοριών';
$string['pluginadministration'] = 'Διαχείριση αρθρώματος πηγή πληροφοριών';
$string['pluginname'] = 'Πηγή πληροφοριών';
$string['popupheight'] = 'Ύψος αναδυόμενου παραθύρου (σε εικονοστοιχεία)';
$string['popupheightexplain'] = 'Καθορίζει το προεπιλεγμένο ύψος του αναδυόμενου παράθυρου.';
$string['popupresource'] = 'Αυτή η πηγή θα εμφανιστεί αυτόματα σε αναδυόμενο παράθυρο.';
$string['popupresourcelink'] = 'Εάν αυτό δε συμβεί, πατήστε εδώ: {$a}';
$string['popupwidth'] = 'Πλάτος αναδυόμενου παραθύρου (σε εικονοστοιχεία)';
$string['popupwidthexplain'] = 'Καθορίζει το προεπιλεγμένο πλάτος του αναδυόμενου παράθυρου.';
$string['printintro'] = 'Έμφάνιση περιγραφής πηγής';
$string['printintroexplain'] = 'Εμφάνιση περιγραφής πηγής κάτω από το περιεχόμενο; Ορισμένοι τύποι εμφάνισης μπορεί να μην εμφανίζουν την περιγραφή, ακόμα και αν έχει ενεργοποιηθεί.';
$string['resource:addinstance'] = 'Προσθήκη νέου πόρου';
$string['resourcecontent'] = 'Αρχεία και υπο-φάκελοι';
$string['resource:exportresource'] = 'Export resource';
$string['resource:view'] = 'Προβολή πηγής';
$string['search:activity'] = 'Πηγή πληροφοριών';
$string['selectmainfile'] = 'Παρακαλώ επιλέξτε το βασικό αρχείο πατώντας το εικονίδιο δίπλα από το όνομα αρχείου.';
$string['showdate'] = 'Εμφάνιση ημερομηνίας μεταφόρτωσης/τροποποίησης';
$string['showdate_desc'] = 'Εμφάνιση ημερομηνίας μεταφόρτωσης/τροποποίησης στη σελίδα μαθήματος;';
$string['showdate_help'] = 'Εμφανίζει την ημερομηνία μεταφόρτωσης/τροποποίησης δίπλα από τους συνδέσμους στο αρχείο.<br/><br/>
Αν υπάρχουν πολλαπλά αρχεία σε αυτό τον πόρο, θα εμφανιστεί η ημερομηνία μεταφόρτωσης/τροποποίησης του αρχείου εκκίνησης.';
$string['showsize'] = 'Εμφάνιση μεγέθους';
$string['showsize_desc'] = 'Εμφάνιση μεγέθους αρχείου στη σελίδα μαθήματος;';
$string['showsize_help'] = 'Εμφανίζει το μέγεθος του αρχείου δίπλα από τους συνδέσμους στο αρχείο.<br/><br/>
Αν υπάρχουν πολλαπλά αρχεία σε αυτό τον πόρο, θα εμφανιστεί το συνολικό μέγεθος όλων των αρχείων.';
$string['showtype'] = 'Εμφάνιση τύπου';
$string['showtype_desc'] = 'Εμφάνιση τύπου αρχείου (π.χ. \'αρχείο Word\') στη σελίδα μαθήματος;';
$string['showtype_help'] = 'Εμφανίζει τον τύπο του αρχείου, όπως \'αρχείο Word\',  δίπλα από τους συνδέσμους στο αρχείο.<br/><br/>
Αν υπάρχουν πολλαπλά αρχεία σε αυτό τον πόρο, θα εμφανιστεί το συνολικό μέγεθος όλων των αρχείων.<br/><br/>
Αν ο τύπος αρχείου δεν είναι γνώριμος στο σύστημα, δεν θα εμφανιστεί.';
$string['uploadeddate'] = 'Μεταφορτώθηκε {$a}';
