<?php

// This file is part of Moodle - http://moodle.org/
//
// Moodle is free software: you can redistribute it and/or modify
// it under the terms of the GNU General Public License as published by
// the Free Software Foundation, either version 3 of the License, or
// (at your option) any later version.
//
// Moodle is distributed in the hope that it will be useful,
// but WITHOUT ANY WARRANTY; without even the implied warranty of
// MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
// GNU General Public License for more details.
//
// You should have received a copy of the GNU General Public License
// along with Moodle.  If not, see <http://www.gnu.org/licenses/>.

/**
 * Strings for component 'tool_usertours', language 'el', branch 'MOODLE_34_STABLE'
 *
 * @package   tool_usertours
 * @copyright 1999 onwards Martin Dougiamas  {@link http://moodle.com}
 * @license   http://www.gnu.org/copyleft/gpl.html GNU GPL v3 or later
 */

defined('MOODLE_INTERNAL') || die();

$string['above'] = 'Πάνω από';
$string['actions'] = 'Ενέργειες';
$string['appliesto'] = 'Ισχύει για';
$string['backdrop'] = 'Εμφάνιση με φόντο σκηνικού';
$string['backdrop_help'] = 'Μπορείτε να χρησιμοποιήσετε ένα φόντο σκηνικού για να επισημάνετε το τμήμα της σελίδας στο οποίο δείχνετε.

Σημείωση: Το φόντο σκηνικού δεν είναι συμβατό με ορισμένα μέρη της σελίδας, όπως η γραμμή πλοήγησης.';
$string['below'] = 'Παρακάτω';
$string['block'] = 'Μπλοκ';
$string['block_named'] = 'Μπλοκ με όνομα «{$a}»';
$string['cachedef_stepdata'] = 'Λίστα με βήματα περιηγήσεων χρήστη';
$string['cachedef_tourdata'] = 'Λίστα με πληροφορίες ενεργοποιημένων περιηγήσεων χρήστη που βρίσκει και φέρνει κάθε σελίδα';
$string['confirmstepremovalquestion'] = 'Είστε βέβαιοι ότι θέλετε να καταργήσετε αυτό το βήμα;';
$string['confirmstepremovaltitle'] = 'Επιβεβαίωση κατάργησης βήματος';
$string['confirmtourremovalquestion'] = 'Είστε σίγουροι ότι θέλετε να διαγράψετε αυτή την περιήγηση;';
$string['confirmtourremovaltitle'] = 'Επιβεβαίωση διαγραφής περιήγησης';
$string['content'] = 'Περιεχόμενο';
$string['content_heading'] = 'Περιεχόμενο';
$string['content_help'] = 'Περιεχόμενο που περιγράφει το βήμα μπορεί να προστεθεί ως απλό κείμενο, που περικλείεται σε ετικέτες multilang (για χρήση με το φίλτρο πολυγλωσσικού περιεχομένου), εάν απαιτείται. Εναλλακτικά, ένα (αλφαριθμητικό) αναγνωριστικό γλώσσας μπορεί να εισαχθεί με μορφότυπο: αναγνωριστικό,στοιχείο (χωρίς παρενθέσεις ή κενό διάστημα μετά το κόμμα).';
$string['cssselector'] = 'Επιλογέας CSS';
$string['defaultvalue'] = 'Προεπιλογή ({$a})';
$string['delay'] = 'Καθυστέρηση πριν εμφανιστεί το βήμα';
$string['delay_help'] = 'Μπορείτε προαιρετικά να επιλέξετε να προσθέσετε μια καθυστέρηση πριν εμφανιστεί το βήμα.

Αυτή η καθυστέρηση είναι σε χιλιοστά του δευτερολέπτου.';
$string['description'] = 'Περιγραφή';
$string['done'] = 'Έγινε';
$string['editstep'] = 'Επεξεργασία "{$a}"';
$string['enabled'] = 'Ενεργοποιημένο';
$string['endtour'] = 'Τέλος περιήγησης';
$string['event_step_shown'] = 'Βήμα που εμφανίζεται';
$string['event_tour_ended'] = 'Η περιήγηση τελείωσε';
$string['event_tour_reset'] = 'Επαναφορά περιήγησης';
$string['event_tour_started'] = 'Η περιήγηση ξεκίνησε';
$string['exporttour'] = 'Εξαγωγή περιήγησης';
$string['filter_category'] = 'Κατηγορία';
$string['filter_category_help'] = 'Εμφάνιση τη περιήγησης σε μια σελίδα που συσχετίζεται με ένα μάθημα στην επιλεγμένη κατηγορία.';
$string['filter_course'] = 'Μαθήματα';
$string['filter_courseformat'] = 'Μορφότυπος μαθημάτων';
$string['filter_courseformat_help'] = 'Εμφάνιση τη περιήγησης σε μια σελίδα που συσχετίζεται με ένα μάθημα που χρησιμοποιεί τον επιλεγμένο μορφότυπο μαθήματος.';
$string['filter_course_help'] = 'Εμφάνιση τη περιήγησης σε μια σελίδα που συσχετίζεται με το επιλεγμένο μάθημα.';
$string['filter_header'] = 'Φίλτρα περιήγησης';
$string['filter_help'] = 'Επιλέξτε τις συνθήκες κάτω από τις οποίες η περιήγηση θα εμφανίζεται. Για να εμφανιστεί μια περιήγηση σε ένα χρήστη πρέπει να ικανοποιούνται όλα τα φίλτρα.';
$string['filter_role'] = 'Ρόλος';
$string['filter_role_help'] = 'Μια περιήγηση μπορεί να περιορίζεται σε χρήστες με επιλεγμένους ρόλους στο πλαίσιο όπου εμφανίζεται η περιήγηση. Για παράδειγμα, ο περιορισμός μιας περιήγησης στο Ταμπλό σε χρήστες με το ρόλο του μαθητή δεν θα λειτουργήσει αν οι χρήστες έχουν το ρόλο μαθητών σε ένα μάθημα (όπως συμβαίνει γενικά). Μια περιήγηση στο Ταμπλό μπορεί να περιοριστεί μόνο σε χρήστες με ρόλο συστήματος.';
$string['filter_theme'] = 'Θέμα';
$string['filter_theme_help'] = 'Εμφάνιση της περιήγησης όταν ο χρήστης χρησιμοποιεί ένα από τα επιλεγμένα θέματα.';
$string['importtour'] = 'Εισαγωγή περιήγησης';
$string['left'] = 'Αριστερά';
$string['modifyshippedtourwarning'] = 'Αυτή είναι μια περιήγηση χρήστη που έχει περιληφθεί στο Moodle. Οποιεσδήποτε τροποποιήσεις πραγματοποιείτε μπορεί να παρακαμφθούν (χαθούν) κατά την επόμενη αναβάθμιση του ιστοτόπου σας.';
$string['movestepdown'] = 'Μετακίνηση του βήματος προς τα κάτω';
$string['movestepup'] = 'Μετακίνηση του βήματος προς τα πάνω';
$string['movetourdown'] = 'Μετακίνηση περιήγησης προς τα κάτω';
$string['movetourup'] = 'Μετακίνηση περιήγησης προς τα πάνω';
$string['name'] = 'Όνομα';
$string['newstep'] = 'Νέο βήμα';
$string['newtour'] = 'Δημιουργία νέας περιήγησης';
$string['next'] = 'Επόμενο';
$string['options_heading'] = 'Επιλογές';
$string['orphan'] = 'Εμφάνιση εάν ο στόχος δεν βρέθηκε';
$string['orphan_help'] = 'Εμφάνιση του βήματος εάν ο στόχος δεν βρέθηκε στη σελίδα.';
$string['pathmatch'] = 'Εφαρμόστε στη διεύθυνση URL που ταιριάζει';
$string['pathmatch_help'] = 'Περιηγήσεις (οδηγοί βήμα προς βήμα) θα εμφανίζονται σε κάθε σελίδα της οποίας η URL διεύθυνση ταιριάζει με αυτήν την τιμή.

Μπορείτε να χρησιμοποιήσετε τον χαρακτήρα % ως ένα χαρακτήρα μπαλαντέρ για να εκφράσετε οτιδήποτε.

Μερικά παραδείγματα τιμών περιλαμβάνουν:

* /my/% - που εκφράζει το ταμπλό
* /course/view.php?id=2 - που εκφράζει ένα συγκεκριμένο μάθημα
* /mod/forum/view.php% - που εκφράζει την λίστα συζητήσεων ενός φόρουμ
* /user/profile.php% - που εκφράζει την σελίδα προφίλ του χρήστη

Αν θέλετε να εμφανίζεται μια περιήγηση στην Αρχική σελίδα ιστοτόπου, μπορείτε να χρησιμοποιήσετε την τιμή: «FRONTPAGE».';
$string['pausetour'] = 'Παύση';
$string['placement'] = 'Τοποθέτηση';
$string['placement_help'] = 'Ένα βήμα μπορεί να τοποθετηθεί πάνω, κάτω, αριστερά ή δεξιά του στόχου. Πάνω ή κάτω, συνιστάται, καθώς αυτές προσαρμόζονται καλύτερα στην οθόνη κινητών τηλεφώνων. Αν το βήμα δεν ταιριάζει σε μια συγκεκριμένη σελίδα στο συγκεκριμένο σημείο, θα τοποθετηθεί αυτόματα αλλού.';
$string['pluginname'] = 'Περιηγήσεις χρηστών';
$string['privacy:metadata:preference:completed'] = 'Πότε ολοκλήρωσε τελευταία ένας χρήστης μια περιήγηση χρήστη.';
$string['privacy:metadata:preference:requested'] = 'Πότε έγινε τελευταία φορά χειροκίνητα αίτημα από τον χρήστη για μια περιήγηση χρήστη.';
$string['privacy:request:preference:completed'] = 'Η τελευταία φορά που σημειώσατε την περιήγηση χρήστη «{$a->name}» ως ολοκληρωμένη ήταν στις {$a->time}';
$string['privacy:request:preference:requested'] = 'Η τελευταία φορά που αιτηθήκατε την περιήγηση χρήστη «{$a->name}» ήταν στις {$a->time}';
$string['reflex'] = 'Συνεχίστε με κλικ';
$string['reflex_help'] = 'Προχωρήστε στο επόμενο βήμα όταν πατηθεί ο στόχος.';
$string['resettouronpage'] = 'Επαναφορά περιήγησης χρήστη σε αυτή τη σελίδα';
$string['resumetour'] = 'Επανάληψη/συνέχιση';
$string['right'] = 'Δεξιά';
$string['select_block'] = 'Επιλέξτε ένα μπλοκ';
$string['selector_defaulttitle'] = 'Δώστε έναν περιγραφικό τίτλο';
$string['selectordisplayname'] = 'Ένας επιλογέας CSS που ταιριάζει με «{$a}»';
$string['selecttype'] = 'Επιλογή τύπου βήματος';
$string['sharedtourslink'] = 'Αποθετήριο περιηγήσεων';
$string['skip'] = 'Παράκαμψη';
$string['target'] = 'Στόχος';
$string['target_block'] = 'Μπλοκ';
$string['target_heading'] = 'Στόχος βήματος';
$string['target_selector'] = 'Επιλογέας';
$string['target_selector_targetvalue'] = 'Επιλογείς CSS';
$string['target_selector_targetvalue_help'] = 'Ένας επιλογέας CSS μπορεί να χρησιμοποιηθεί για να στοχεύσει σχεδόν οποιοδήποτε στοιχείο της σελίδας. Ο κατάλληλος επιλογέας μπορεί εύκολα να βρεθεί χρησιμοποιώντας τα εργαλεία προγραμματιστή για τον περιηγητή ιστού σας.';
$string['targettype'] = 'Τύπος στόχου';
$string['targettype_help'] = 'Κάθε βήμα σχετίζεται με ένα μέρος της σελίδας - το στόχο. Οι τύποι στόχων είναι:

* Μπλοκ - για την εμφάνιση ενός βήματος δίπλα σε ένα συγκεκριμένο μπλοκ
* Επιλογέας CSS - για τον ακριβή ορισμό της περιοχής προορισμού χρησιμοποιώντας CSS
* Εμφάνιση στο μέσον της σελίδας - για ένα βήμα που δεν χρειάζεται να συσχετιστεί με ένα συγκεκριμένο τμήμα της σελίδας';
$string['target_unattached'] = 'Εμφάνιση στη μέση της σελίδας';
$string['title'] = 'Τίτλος';
$string['title_help'] = 'Ο τίτλος ενός βήματος μπορεί να προστεθεί ως απλό κείμενο, που περικλείεται σε ετικέτες multilang (για χρήση με το φίλτρο πολυγλωσσικού περιεχομένου) εάν απαιτείται. Εναλλακτικά, ένα (αλφαριθμητικό) αναγνωριστικό γλώσσας μπορεί να εισαχθεί με μορφότυπο: αναγνωριστικό,στοιχείο (χωρίς παρενθέσεις ή κενό διάστημα μετά το κόμμα).';
$string['tour1_content_addingblocks'] = 'Στην πραγματικότητα, σκεφτείτε προσεκτικά αν πρέπει να συμπεριλάβετε κάποιο μπλοκ στις σελίδες σας. Τα μπλοκ δεν εμφανίζονται στην εφαρμογή κινητού Moodle, επομένως, ως γενικός κανόνας, είναι πολύ καλύτερο να βεβαιωθείτε ότι ο ιστότοπός σας λειτουργεί καλά χωρίς καθόλου μπλοκ.';
$string['tour1_content_blockregion'] = 'Υπάρχει ακόμη μια περιοχή μπλοκ εδώ. Συνιστούμε να καταργήσετε πλήρως τα μπλοκ Πλοήγησης και Διαχείρισης, καθώς όλες οι λειτουργίες βρίσκονται αλλού στο θέμα Boost.';
$string['tour1_content_customisation'] = 'Για να προσαρμόσετε την εμφάνιση του ιστοτόπου σας και της αρχικής σελίδας, χρησιμοποιήστε το μενού ρυθμίσεων στη γωνία αυτής της κεφαλίδας. Δοκιμάστε να ξεκινήσετε την επεξεργασία αμέσως τώρα.';
$string['tour1_content_end'] = 'Αυτό είναι το τέλος της περιήγησης χρήστη σας. Δεν θα εμφανιστεί ξανά εκτός αν την επαναφέρετε χρησιμοποιώντας το σύνδεσμο στο υποσέλιδο. Ως διαχειριστής μπορείτε επίσης να δημιουργήσετε τις δικές σας περιηγήσεις όπως αυτή!';
$string['tour1_content_navigation'] = 'Η κύρια πλοήγηση γίνεται τώρα μέσω αυτού του συρταριού πλοήγησης. Τα περιεχόμενα ενημερώνονται σε σχέση με το πού βρίσκεστε στον ιστότοπο. Χρησιμοποιήστε το κουμπί στην κορυφή για απόκρυψη/εμφάνισή του.';
$string['tour1_content_welcome'] = 'Καλώς ήλθατε στο θέμα Boost. Εάν κάνατε αναβάθμιση από μια παλαιότερη έκδοση, ίσως βρείτε ότι κάποια πράγματα φαίνονται λίγο διαφορετικά με αυτό το θέμα.';
$string['tour1_title_addingblocks'] = 'Προσθήκη μπλοκ';
$string['tour1_title_blockregion'] = 'Περιοχή μπλοκ';
$string['tour1_title_customisation'] = 'Προσαρμογή';
$string['tour1_title_end'] = 'Τέλος περιήγησης';
$string['tour1_title_navigation'] = 'Πλοήγηση';
$string['tour1_title_welcome'] = 'Καλώς ήρθατε';
$string['tour2_content_addblock'] = 'Αν ενεργοποιήσετε την επεξεργασία, μπορείτε να προσθέσετε μπλοκ από το συρτάρι πλοήγησης. Ωστόσο, σκεφτείτε προσεκτικά αν πρέπει να συμπεριλάβετε κάποιο μπλοκ στις σελίδες σας. Τα μπλοκ δεν εμφανίζονται στην εφαρμογή κινητού Moodle, οπότε για την καλύτερη εμπειρία χρήστη είναι καλύτερο να βεβαιωθείτε ότι το μάθημά σας λειτουργεί καλά χωρίς καθόλου μπλοκ.';
$string['tour2_content_addingblocks'] = 'Μπορείτε να προσθέσετε μπλοκ σε αυτή τη σελίδα χρησιμοποιώντας αυτό το πλήκτρο. Ωστόσο, σκεφτείτε προσεκτικά αν πρέπει να συμπεριλάβετε κάποιο μπλοκ στις σελίδες σας. Τα μπλοκ δεν εμφανίζονται στην εφαρμογή κινητού Moodle, οπότε για την καλύτερη εμπειρία χρήστη είναι καλύτερο να βεβαιωθείτε ότι το μάθημά σας λειτουργεί καλά χωρίς καθόλου μπλοκ.';
$string['tour2_content_customisation'] = 'Για να αλλάξετε ρυθμίσεις μαθημάτων, χρησιμοποιήστε το μενού ρυθμίσεων στη γωνία αυτής της κεφαλίδας. Θα βρείτε ένα παρόμοιο μενού ρυθμίσεων στην αρχική σελίδα κάθε δραστηριότητας. Δοκιμάστε να ξεκινήσετε την επεξεργασία αμέσως τώρα.';
$string['tour2_content_end'] = 'Αυτό είναι το τέλος της περιήγησης χρήστη σας. Δεν θα εμφανιστεί ξανά εκτός αν την επαναφέρετε χρησιμοποιώντας το σύνδεσμο στο υποσέλιδο. Ο διαχειριστής ιστοτόπου μπορεί επίσης να δημιουργήσει επιπλέον περιηγήσεις για αυτόν τον ιστότοπο αν απαιτείται!';
$string['tour2_content_navigation'] = 'Η πλοήγηση γίνεται τώρα μέσω αυτού του συρταριού πλοήγησης. Χρησιμοποιήστε το κουμπί στην κορυφή για απόκρυψη ή εμφάνισή του. Θα δείτε ότι υπάρχουν σύνδεσμοι για τμήματα του μαθήματός σας.';
$string['tour2_content_opendrawer'] = 'Δοκιμάστε να ανοίξετε τώρα το συρτάρι πλοήγησης.';
$string['tour2_content_participants'] = 'Δείτε τους συμμετέχοντες εδώ. Αυτός είναι ο χώρος όπου μπορείτε να προσθέσετε ή να αφαιρέσετε μαθητές.';
$string['tour2_content_welcome'] = 'Καλώς ήλθατε στο θέμα Boost. Εάν ο ιστότοπός σας έχει αναβαθμιστεί από μια παλαιότερη έκδοση, ίσως βρείτε ότι κάποια πράγματα φαίνονται λίγο διαφορετικά εδώ, στη σελίδα του μαθήματος.';
$string['tour2_title_addblock'] = 'Προσθήκη ενός μπλοκ';
$string['tour2_title_addingblocks'] = 'Προσθήκη των μπλοκ';
$string['tour2_title_customisation'] = 'Προσαρμογή';
$string['tour2_title_end'] = 'Τέλος περιήγησης';
$string['tour2_title_navigation'] = 'Πλοήγηση';
$string['tour2_title_opendrawer'] = 'Άνοιγμα του συρταριού πλοήγησης';
$string['tour2_title_participants'] = 'Συμμετέχοντες μαθήματος';
$string['tour2_title_welcome'] = 'Καλώς ήρθατε';
$string['tourconfig'] = 'Αρχείο ρυθμίσεων περιήγησης προς εισαγωγή';
$string['tourisenabled'] = 'Η περιήγηση είναι ενεργοποιημένη';
$string['tourlist_explanation'] = 'Μπορείτε να δημιουργήσετε όσες περιηγήσεις επιθυμείτε και να τις ενεργοποιήσετε για διάφορα μέρη του Moodle. Μόνο μία περιήγηση μπορεί να δημιουργηθεί ανά σελίδα.';
$string['tour_resetforall'] = 'Στην κατάσταση της περιήγησης έχει γίνει επαναφορά. Θα εμφανιστεί ξανά σε όλους τους χρήστες.';
$string['tours'] = 'Περιηγήσεις';
$string['usertours'] = 'Περιηγήσεις χρηστών';
$string['usertours:managetours'] = 'Δημιουργία, επεξεργασία και διαγραφή περιηγήσεων χρηστών';
$string['viewtour_edit'] = 'Μπορείτε να <a href="{$a->editlink}">επεξεργαστείτε τις προεπιλογές της περιήγησης</a>  και <a href="{$a->resetlink}">να επιβάλετε την εμφάνιση της περιήγησης</a> ξανά σε όλους τους χρήστες.';
$string['viewtour_info'] = 'Αυτή είναι η περιήγηση «{$a->tourname}». Ισχύει για τη διαδρομή «{$a->path}».';
