<?php
$string['multianswerwiris'] = 'Συμπλήρωση κενών - επιστήμη';
$string['multianswerwiris_help'] = 'Παρόμοια με την τυπική ερώτηση ενσωματωμένων απαντήσεων (συμπλήρωση κενών), αλλά μπορείτε να δώσετε διαφορετικό κείμενο ερώτησης, εισάγοντας τυχαίους αριθμούς, τύπους ή σχεδιαγράμματα. Στα σχόλια μπορούν επίσης να χρησιμοποιούνται οι τυχαίες τιμές.';
$string['editingmultianswerwiris'] = 'Επεξεργασία ερώτησης ενσωματωμένων απαντήσεων (συμπλήρωση κενών) για μαθηματικά και επιστήμη από τη WIRIS';
$string['addingmultianswerwiris'] = 'Προσθήκη ερώτησης ενσωματωμένων απαντήσεων (συμπλήρωση κενών) για μαθηματικά και επιστήμη από τη WIRIS';
$string['multianswerwirissummary'] = 'Παρόμοια με την τυπική ερώτηση ενσωματωμένων απαντήσεων (συμπλήρωση κενών), αλλά μπορείτε να δώσετε διαφορετικό κείμενο ερώτησης, εισάγοντας τυχαίους αριθμούς, τύπους ή σχεδιαγράμματα. Στα σχόλια μπορούν επίσης να χρησιμοποιούνται οι τυχαίες τιμές.';
$string['multianswerwiris_algorithm'] = 'Αλγόριθμος';
$string['multianswerwiris_wiris_variables'] = 'Μεταβλητές WIRIS ';

//From Moodle 2.3
$string['pluginname'] = 'Συμπλήρωση κενών - επιστήμη';
$string['pluginname_help'] = 'Παρόμοια με την τυπική ερώτηση ενσωματωμένων απαντήσεων (συμπλήρωση κενών), αλλά μπορείτε να δώσετε διαφορετικό κείμενο ερώτησης, εισάγοντας τυχαίους αριθμούς, τύπους ή σχεδιαγράμματα. Στα σχόλια μπορούν επίσης να χρησιμοποιούνται οι τυχαίες τιμές.';
$string['pluginnamesummary'] = 'Παρόμοια με την τυπική ερώτηση ενσωματωμένων απαντήσεων (συμπλήρωση κενών), αλλά μπορείτε να δώσετε διαφορετικό κείμενο ερώτησης, εισάγοντας τυχαίους αριθμούς, τύπους ή σχεδιαγράμματα. Στα σχόλια μπορούν επίσης να χρησιμοποιούνται οι τυχαίες τιμές.';
$string['pluginnameadding'] = 'Προσθήκη ερώτησης ενσωματωμένων απαντήσεων (συμπλήρωση κενών) για μαθηματικά και επιστήμη από τη WIRIS';
$string['pluginnameediting'] = 'Επεξεργασία ερώτησης ενσωματωμένων απαντήσεων (συμπλήρωση κενών) για μαθηματικά και επιστήμη από τη WIRIS';
?>