<?php
// This file is part of Moodle - http://moodle.org/
//
// Moodle is free software: you can redistribute it and/or modify
// it under the terms of the GNU General Public License as published by
// the Free Software Foundation, either version 3 of the License, or
// (at your option) any later version.
//
// Moodle is distributed in the hope that it will be useful,
// but WITHOUT ANY WARRANTY; without even the implied warranty of
// MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
// GNU General Public License for more details.
//
// You should have received a copy of the GNU General Public License
// along with Moodle.  If not, see <http://www.gnu.org/licenses/>.

$string['multianswerwiris'] = 'Συμπλή�?ωση κενών - επιστήμη';
$string['multianswerwiris_help'] = 'Πα�?όμοια με την τυπική ε�?ώτηση ενσωματωμένων απαντήσεων (συμπλή�?ωση κενών), αλλά μπο�?είτε να δώσετε διαφο�?ετικό κείμενο ε�?ώτησης, εισάγοντας τυχαίους α�?ιθμο�?ς, τ�?πους ή σχεδιαγ�?άμματα. Στα σχόλια μπο�?ο�?ν επίσης να χ�?ησιμοποιο�?νται οι τυχαίες τιμές.';
$string['editingmultianswerwiris'] = 'Επεξε�?γασία ε�?ώτησης ενσωματωμένων απαντήσεων (συμπλή�?ωση κενών) για μαθηματικά και επιστήμη από τη WIRIS';
$string['addingmultianswerwiris'] = 'Π�?οσθήκη ε�?ώτησης ενσωματωμένων απαντήσεων (συμπλή�?ωση κενών) για μαθηματικά και επιστήμη από τη WIRIS';
$string['multianswerwirissummary'] = 'Πα�?όμοια με την τυπική ε�?ώτηση ενσωματωμένων απαντήσεων (συμπλή�?ωση κενών), αλλά μπο�?είτε να δώσετε διαφο�?ετικό κείμενο ε�?ώτησης, εισάγοντας τυχαίους α�?ιθμο�?ς, τ�?πους ή σχεδιαγ�?άμματα. Στα σχόλια μπο�?ο�?ν επίσης να χ�?ησιμοποιο�?νται οι τυχαίες τιμές.';
$string['multianswerwiris_algorithm'] = 'Αλγό�?ιθμος';
$string['multianswerwiris_wiris_variables'] = 'Μεταβλητές WIRIS ';

// From Moodle 2.3.
$string['pluginname'] = 'Συμπλή�?ωση κενών - επιστήμη';
$string['pluginname_help'] = 'Πα�?όμοια με την τυπική ε�?ώτηση ενσωματωμένων απαντήσεων (συμπλή�?ωση κενών), αλλά μπο�?είτε να δώσετε διαφο�?ετικό κείμενο ε�?ώτησης, εισάγοντας τυχαίους α�?ιθμο�?ς, τ�?πους ή σχεδιαγ�?άμματα. Στα σχόλια μπο�?ο�?ν επίσης να χ�?ησιμοποιο�?νται οι τυχαίες τιμές.';
$string['pluginnamesummary'] = 'Πα�?όμοια με την τυπική ε�?ώτηση ενσωματωμένων απαντήσεων (συμπλή�?ωση κενών), αλλά μπο�?είτε να δώσετε διαφο�?ετικό κείμενο ε�?ώτησης, εισάγοντας τυχαίους α�?ιθμο�?ς, τ�?πους ή σχεδιαγ�?άμματα. Στα σχόλια μπο�?ο�?ν επίσης να χ�?ησιμοποιο�?νται οι τυχαίες τιμές.';
$string['pluginnameadding'] = 'Π�?οσθήκη ε�?ώτησης ενσωματωμένων απαντήσεων (συμπλή�?ωση κενών) για μαθηματικά και επιστήμη από τη WIRIS';
$string['pluginnameediting'] = 'Επεξε�?γασία ε�?ώτησης ενσωματωμένων απαντήσεων (συμπλή�?ωση κενών) για μαθηματικά και επιστήμη από τη WIRIS';
$string['contentnotviewable'] = 'Το πε�?ιεχόμενο δεν μπο�?εί να εμφανιστεί.';
