<?php
// This file is part of Moodle - https://moodle.org/
//
// Moodle is free software: you can redistribute it and/or modify
// it under the terms of the GNU General Public License as published by
// the Free Software Foundation, either version 3 of the License, or
// (at your option) any later version.
//
// Moodle is distributed in the hope that it will be useful,
// but WITHOUT ANY WARRANTY; without even the implied warranty of
// MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
// GNU General Public License for more details.
//
// You should have received a copy of the GNU General Public License
// along with Moodle.  If not, see <https://www.gnu.org/licenses/>.

/**
 * Strings for component 'install', language 'ur', version '4.4'.
 *
 * @package     install
 * @category    string
 * @copyright   1999 Martin Dougiamas and contributors
 * @license     https://www.gnu.org/copyleft/gpl.html GNU GPL v3 or later
 */

defined('MOODLE_INTERNAL') || die();

$string['admindirerror'] = 'متعین ایڈمن ڈائرکٹری غلط ہے';
$string['admindirname'] = 'ایڈمن ڈائرکٹری';
$string['admindirsetting'] = 'بہت کم ویب ہوسٹس /admin کو بطور خاص یو آر ایل استعمال کرتے ہیں تاکہ آپ کنٹرول پینل یا کسی اور چیز تک رسائی حاصل کر سکیں۔ بدقسمتی سے یہ موڈل ایڈمن پیجز کے معیاری مقام سے متصادم ہے۔ آپ اسے اپنی انسٹالیشن میں ایڈمن ڈائرکٹری کا نام بدل کر، اور اس نئے نام کو یہاں رکھ کر ٹھیک کر سکتے ہیں۔ مثال کے طور پر: <br /> <br /><b>moodleadmin</b><br /> <br /> یہ Moodle میں ایڈمن لنکس کو ٹھیک کر دے گا۔';
$string['admindirsettinghead'] = 'ایڈمن ڈائرکٹری سیٹ کرنا۔۔۔';
$string['admindirsettingsub'] = 'بہت کم ویب ہوسٹس /admin کو بطور خاص یو آر ایل استعمال کرتے ہیں تاکہ آپ کنٹرول پینل یا کسی اور چیز تک رسائی حاصل کر سکیں۔ بدقسمتی سے یہ موڈل ایڈمن پیجز کے معیاری مقام سے متصادم ہے۔ آپ اسے اپنی انسٹالیشن میں ایڈمن ڈائرکٹری کا نام بدل کر، اور اس نئے نام کو یہاں رکھ کر ٹھیک کر سکتے ہیں۔ مثال کے طور پر: <br /> <br /><b>moodleadmin</b><br /> <br /> یہ Moodle میں ایڈمن لنکس کو ٹھیک کر دے گا۔';
$string['availablelangs'] = 'دستیاب لینگویج پیک';
$string['caution'] = 'احتیاط';
$string['chooselanguage'] = 'ایک زبان کا انتخاب کریں';
$string['chooselanguagehead'] = 'ایک زبان کا انتخاب کریں';
$string['chooselanguagesub'] = 'براہ کرم انسٹالیشن کے لیے ایک زبان کا انتخاب کریں۔ اس زبان کو سائٹ کے لیے ڈیفالٹ زبان کے طور پر بھی استعمال کیا جائے گا، حالانکہ اسے بعد میں تبدیل کیا جا سکتا ہے۔';
$string['cliadminemail'] = 'نیا منتظم صارف کا ای میل پتہ';
$string['cliadminpassword'] = 'نیا ایڈمن صارف پاس ورڈ';
$string['cliadminusername'] = 'ایڈمن اکاؤنٹ کا صارف نام';
$string['clialreadyconfigured'] = 'کنفیگریشن فائل config.php پہلے سے موجود ہے۔ اس سائٹ کے لیے Moodle انسٹال کرنے کے لیے براہ کرم admin/cli/install_database.php استعمال کریں۔';
$string['clialreadyinstalled'] = 'کنفیگریشن فائل config.php پہلے سے موجود ہے۔ اس سائٹ کے لیے Moodle کو اپ گریڈ کرنے کے لیے براہ کرم admin/cli/install_database.php استعمال کریں۔';
$string['cliinstallfinished'] = 'تنصیب کامیابی سے مکمل ہو گئی۔';
$string['cliinstallheader'] = 'موڈل {$a} کمانڈ لائن انسٹالیشن پروگرام';
$string['climustagreelicense'] = 'نان انٹرایکٹو موڈ میں آپ کو --agree-license آپشن کی وضاحت کرکے لائسنس سے اتفاق کرنا ہوگا۔';
$string['cliskipdatabase'] = 'ڈیٹا بیس کی تنصیب کو چھوڑنا۔';
$string['clitablesexist'] = 'ڈیٹا بیس کی میزیں پہلے سے موجود ہیں؛ CLI کی تنصیب جاری نہیں رہ سکتی۔';
$string['compatibilitysettings'] = 'آپ کی پی ایچ پی کی ترتیبات کی جانچ ہو رہی ہے۔۔۔';
$string['compatibilitysettingshead'] = 'آپ کی پی ایچ پی کی ترتیبات کی جانچ ہو رہی ہے۔۔۔';
$string['compatibilitysettingssub'] = 'موڈل کو صحیح طریقے سے چلانے کے لیے آپ کے سرور کو یہ تمام ٹیسٹ پاس کرنے چاہئیں';
$string['configfilenotwritten'] = 'انسٹالر اسکرپٹ خود بخود ایک config.php فائل بنانے کے قابل نہیں تھا جس میں آپ کی منتخب کردہ ترتیبات شامل ہوں، شاید اس لیے کہ Moodle ڈائریکٹری قابل تحریر نہیں ہے۔ آپ Moodle کی روٹ ڈائرکٹری میں config.php نامی فائل میں درج ذیل کوڈ کو دستی طور پر کاپی کر سکتے ہیں۔';
$string['configfilewritten'] = 'config.php کو کامیابی سے بنایا گیا ہے';
$string['configurationcomplete'] = 'کنفیگریشن مکمل ہو گئی';
$string['configurationcompletehead'] = 'کنفیگریشن مکمل ہو گئی';
$string['configurationcompletesub'] = 'موڈل نے آپ کی موڈل انسٹالیشن کی روٹ میں موجود فائل میں آپ کی کنفیگریشن کو محفوظ کرنے کی کوشش کی۔';
$string['database'] = 'ڈیٹا بیس';
$string['databasehead'] = 'ڈیٹا بیس کی ترتیبات';
$string['databasehost'] = 'ڈیٹا بیس میزبان';
$string['databasename'] = 'ڈیٹا بیس نام';
$string['databasepass'] = 'ڈیٹا بیس پاس ورڈ';
$string['databaseport'] = 'ڈیٹا بیس پورٹ';
$string['databasesocket'] = 'یونکس ساکٹ';
$string['databasetypehead'] = 'ڈیٹا بیس ڈرائیور کا انتخاب کریں';
$string['databasetypesub'] = 'موڈل کئی قسم کے ڈیٹا بیس سرورز کو سپورٹ کرتا ہے۔ براہ کرم سرور ایڈمنسٹریٹر سے رابطہ کریں اگر آپ نہیں جانتے کہ کس قسم کا استعمال کرنا ہے۔';
$string['databaseuser'] = 'ڈیٹا بیس صارف';
$string['dataroot'] = 'ڈیٹا ڈائریکٹری';
$string['datarooterror'] = 'آپ کی بتائی گئی \'ڈیٹا ڈائرکٹری\' نہ مل سکی اور نہ ہی بنائی جا سکی۔ یا تو راستے کو درست کریں یا اس ڈائرکٹری کو دستی طور پر بنائیں۔';
$string['datarootpermission'] = 'ڈیٹا ڈائریکٹریز کی اجازت';
$string['datarootpublicerror'] = 'آپ نے جو \'ڈیٹا ڈائرکٹری\' بیان کی ہے وہ ویب کے ذریعے براہ راست قابل رسائی ہے، آپ کو مختلف ڈائریکٹری استعمال کرنی چاہیے۔';
$string['dbconnectionerror'] = 'ہم آپ کے بتائے ہوئے ڈیٹا بیس سے منسلک نہیں ہو سکے۔ براہ کرم اپنے ڈیٹا بیس کی ترتیبات کو چیک کریں۔';
$string['dbcreationerror'] = 'ڈیٹا بیس بنانے میں خرابی۔ فراہم کردہ ترتیبات کے ساتھ دیئے گئے ڈیٹا بیس کا نام نہیں بنایا جا سکا';
$string['dbhost'] = 'میزبان سرور';
$string['dbpass'] = 'پاس ورڈ';
$string['dbport'] = 'پورٹ';
$string['dbprefix'] = 'جدولوں کا سابقہ';
$string['dbtype'] = 'قسم';
$string['directorysettings'] = '<p>براہ کرم اس Moodle انسٹالیشن کے مقامات کی تصدیق کریں۔</p> <p><b>ویب ایڈریس:</b> مکمل ویب ایڈریس کی وضاحت کریں جہاں Moodle تک رسائی حاصل کی جائے گی۔ اگر آپ کی ویب سائٹ ایک سے زیادہ یو آر ایل کے ذریعے قابل رسائی ہے تو پھر سب سے فطری انتخاب کریں جسے آپ کے طلباء استعمال کریں گے۔ ٹریلنگ سلیش شامل نہ کریں۔</p> <p><b>موڈل ڈائرکٹری:</b> اس انسٹالیشن کے لیے مکمل ڈائرکٹری کا راستہ بتائیں یقینی بنائیں کہ اوپری/لوئر کیس درست ہے۔</p> <p>< b>ڈیٹا ڈائریکٹری:</b> آپ کو ایک ایسی جگہ کی ضرورت ہے جہاں موڈل اپ لوڈ کی گئی فائلوں کو محفوظ کر سکے۔ یہ ڈائریکٹری ویب سرور صارف (عام طور پر \'کوئی نہیں\' یا \'اپاچی\') کے ذریعہ پڑھنے کے قابل اور لکھنے کے قابل ہونی چاہئے، لیکن یہ ویب کے ذریعے براہ راست قابل رسائی نہیں ہونی چاہئے۔ اگر موجود نہیں ہے تو انسٹالر اسے بنانے کی کوشش کرے گا۔</p>';
$string['directorysettingshead'] = 'براہ کرم اس Moodle انسٹالیشن کے مقامات کی تصدیق کریں';
$string['directorysettingssub'] = '<b>ویب ایڈریس:</b> مکمل ویب ایڈریس کی وضاحت کریں جہاں موڈل تک رسائی حاصل کی جائے گی۔ اگر آپ کی ویب سائٹ ایک سے زیادہ یو آر ایل کے ذریعے قابل رسائی ہے تو پھر سب سے فطری انتخاب کریں جسے آپ کے طلباء استعمال کریں گے۔ ٹریلنگ سلیش شامل نہ کریں۔ <br /> <br /> <b>موڈل ڈائرکٹری:</b> اس انسٹالیشن کے لیے مکمل ڈائرکٹری کا راستہ بتائیں یقینی بنائیں کہ اوپری/لوئر کیس درست ہے۔ <br /> <br /> <b>ڈیٹا ڈائریکٹری:</b> آپ کو ایک ایسی جگہ کی ضرورت ہے جہاں Moodle اپ لوڈ کی گئی فائلوں کو محفوظ کر سکے۔ یہ ڈائرکٹری ویب سرور کے صارف (عام طور پر \'کوئی نہیں\' یا \'اپاچی\') کے ذریعہ پڑھنے کے قابل اور قابل تحریر ہونی چاہیے، لیکن یہ ویب کے ذریعے براہ راست قابل رسائی نہیں ہونی چاہیے۔ اگر موجود نہیں ہے تو انسٹالر اسے بنانے کی کوشش کرے گا۔';
$string['dirroot'] = 'موڈل ڈائرکٹری';
$string['dirrooterror'] = 'ایسا لگتا ہے کہ \'موڈل ڈائرکٹری\' کی ترتیب غلط ہے - ہمیں وہاں موڈل انسٹالیشن نہیں مل رہی ہے۔ نیچے کی قدر دوبارہ ترتیب دی گئی ہے۔';
$string['download'] = 'ڈاؤن لوڈ کریں';
$string['downloadlanguagebutton'] = 'ڈاؤن لوڈ کریں &quot;{$a}&quot; زبان پیک';
$string['downloadlanguagehead'] = 'زبان پیک ڈاؤن لوڈ کریں';
$string['downloadlanguagenotneeded'] = 'آپ ڈیفالٹ لینگویج پیک، "{$a}" کا استعمال کرتے ہوئے انسٹالیشن کا عمل جاری رکھ سکتے ہیں۔';
$string['downloadlanguagesub'] = 'اب آپ کے پاس لینگویج پیک ڈاؤن لوڈ کرنے اور اس زبان میں انسٹالیشن کے عمل کو جاری رکھنے کا اختیار ہے۔<br /><br />اگر آپ لینگویج پیک ڈاؤن لوڈ کرنے سے قاصر ہیں، تو انسٹالیشن کا عمل انگریزی میں جاری رہے گا۔ (انسٹالیشن کا عمل مکمل ہونے کے بعد، آپ کو اضافی لینگویج پیک ڈاؤن لوڈ اور انسٹال کرنے کا موقع ملے گا۔)';
$string['doyouagree'] = 'آپ اتفاق کرتے ہیں ؟ (ہاں نہیں):';
$string['environmenthead'] = 'اپنے ماحول کی جانچ کر رہا ہے۔۔۔';
$string['environmentsub'] = 'ہم چیک کر رہے ہیں کہ آیا آپ کے سسٹم کے مختلف اجزاء سسٹم کی ضروریات کو پورا کرتے ہیں';
$string['environmentsub2'] = 'ہر موڈل ریلیز میں کچھ کم از کم پی ایچ پی ورژن کی ضرورت اور متعدد لازمی پی ایچ پی ایکسٹینشنز ہوتے ہیں۔ ہر انسٹال اور اپ گریڈ سے پہلے ماحول کی مکمل جانچ کی جاتی ہے۔ اگر آپ نیا ورژن انسٹال کرنا یا پی ایچ پی ایکسٹینشنز کو فعال کرنا نہیں جانتے ہیں تو براہ کرم سرور ایڈمنسٹریٹر سے رابطہ کریں۔';
$string['errorsinenvironment'] = 'ماحولیات کی جانچ ناکام!';
$string['fail'] = 'ناکام';
$string['fileuploads'] = 'فائل اپ لوڈز';
$string['fileuploadserror'] = 'یہ آن ہونا چاہیے';
$string['fileuploadshelp'] = '<p>لگتا ہے کہ آپ کے سرور پر فائل اپ لوڈ کرنا غیر فعال ہے۔</p> <p>موڈل اب بھی انسٹال کیا جا سکتا ہے، لیکن اس قابلیت کے بغیر، آپ کورس کی فائلیں یا نئی صارف پروفائل تصاویر اپ لوڈ نہیں کر سکیں گے۔</p> <p>فائل اپ لوڈ کرنے کے لیے آپ کو (یا آپ کے سسٹم ایڈمنسٹریٹر) کو آپ کے سسٹم پر اہم php.ini فائل میں ترمیم کرنے کی ضرورت ہوگی اور <b>file_uploads</b> کی ترتیب کو \'1\' میں تبدیل کرنا ہوگا۔</p>';
$string['inputdatadirectory'] = 'ڈیٹا ڈائریکٹری:';
$string['inputwebadress'] = 'ویب سائٹ کا پتہ :';
$string['inputwebdirectory'] = 'موڈل ڈائرکٹری:';
$string['installation'] = 'تنصیب';
$string['invaliddbprefix'] = 'غلط سابقہ۔ سابقہ صرف چھوٹے حروف اور انڈر سکور پر مشتمل ہو سکتا ہے۔';
$string['langdownloaderror'] = 'بدقسمتی سے زبان "{$a}" ڈاؤن لوڈ نہیں ہو سکی۔ تنصیب کا عمل انگریزی میں جاری رہے گا۔';
$string['langdownloadok'] = 'زبان "{$a}" کامیابی کے ساتھ انسٹال ہو گئی۔ تنصیب کا عمل اس زبان میں جاری رہے گا۔';
$string['memorylimit'] = 'میموری کی حد';
$string['memorylimiterror'] = 'پی ایچ پی میموری کی حد کافی کم رکھی گئی ہے۔۔۔ آپ کو بعد میں مسائل کا سامنا کرنا پڑ سکتا ہے۔';
$string['memorylimithelp'] = '<p>آپ کے سرور کے لیے PHP میموری کی حد فی الحال {$a} پر سیٹ ہے۔</p> <p>اس کی وجہ سے Moodle کو بعد میں میموری کے مسائل کا سامنا کرنا پڑ سکتا ہے، خاص طور پر اگر آپ کے پاس بہت سارے ماڈیولز فعال ہیں اور/یا بہت سارے صارف۔ ایسا کرنے کے کئی طریقے ہیں جنہیں آپ آزما سکتے ہیں:</p> <ol> <li>اگر آپ قابل ہیں تو، پی ایچ پی کو <i>--enable-memory-limit</i> کے ساتھ دوبارہ مرتب کریں۔ یہ موڈل کو میموری کی حد خود سیٹ کرنے کی اجازت دے گا۔</li> <li>اگر آپ کو اپنی php.ini فائل تک رسائی حاصل ہے، تو آپ وہاں کی <b>memory_limit</b> سیٹنگ کو 40M جیسی چیز میں تبدیل کر سکتے ہیں۔ اگر آپ کے پاس رسائی نہیں ہے تو آپ اپنے منتظم سے اپنے لیے ایسا کرنے کے لیے کہہ سکتے ہیں۔</li> <li>کچھ پی ایچ پی سرورز پر آپ موڈل ڈائرکٹری میں ایک .htaccess فائل بنا سکتے ہیں جس میں یہ لائن ہے: <blockquote> <div>php_value memory_limit 40M</div></blockquote> <p>تاہم، کچھ سرورز پر یہ <b>تمام</b> پی ایچ پی صفحات کو کام کرنے سے روک دے گا (صفحات کو دیکھتے وقت آپ کو غلطیاں نظر آئیں گی) تاکہ آپ کو .htaccess فائل کو ہٹانا پڑے گا۔</p></li></ol>';
$string['mysqliextensionisnotpresentinphp'] = 'PHP کو MySQLi ایکسٹینشن کے ساتھ مناسب طریقے سے ترتیب نہیں دیا گیا ہے تاکہ یہ MySQL کے ساتھ بات چیت کر سکے۔ براہ کرم اپنی php.ini فائل چیک کریں یا پی ایچ پی کو دوبارہ مرتب کریں۔';
$string['nativeauroramysql'] = 'Aurora MySQL (آبائی/auroramysql)';
$string['nativeauroramysqlhelp'] = '<p>ڈیٹا بیس وہ جگہ ہے جہاں موڈل کی زیادہ تر ترتیبات اور ڈیٹا محفوظ کیا جاتا ہے اور اسے یہاں کنفیگر کیا جانا چاہیے۔</p> <p>ڈیٹا بیس کا نام، صارف نام، اور پاس ورڈ مطلوبہ فیلڈز ہیں۔ جدول کا سابقہ اختیاری ہے۔</p> <p>ڈیٹا بیس کے نام میں صرف حروف عددی حروف، ڈالر ($) اور انڈر سکور (_) شامل ہوسکتے ہیں۔</p> <p>اگر ڈیٹا بیس فی الحال موجود نہیں ہے، اور صارف آپ specify کو اجازت ہے، Moodle درست اجازتوں اور ترتیبات کے ساتھ ایک نیا ڈیٹا بیس بنانے کی کوشش کرے گا۔</p> <p>یہ ڈرائیور میراثی MyISAM انجن کے ساتھ مطابقت نہیں رکھتا۔</p>';
$string['nativemariadb'] = 'ماریا ڈی بی (مقامی/ماریا ڈی بی)';
$string['nativemariadbhelp'] = '<p>ڈیٹا بیس وہ جگہ ہے جہاں موڈل کی زیادہ تر ترتیبات اور ڈیٹا محفوظ کیا جاتا ہے اور اسے یہاں کنفیگر کیا جانا چاہیے۔</p> <p>ڈیٹا بیس کا نام، صارف نام، اور پاس ورڈ مطلوبہ فیلڈز ہیں۔ جدول کا سابقہ اختیاری ہے۔</p> <p>ڈیٹا بیس کے نام میں صرف حروف عددی حروف، ڈالر ($) اور انڈر سکور (_) شامل ہوسکتے ہیں۔</p> <p>اگر ڈیٹا بیس فی الحال موجود نہیں ہے، اور صارف آپ specify کو اجازت ہے، Moodle درست اجازتوں اور ترتیبات کے ساتھ ایک نیا ڈیٹا بیس بنانے کی کوشش کرے گا۔</p> <p>یہ ڈرائیور میراثی MyISAM انجن کے ساتھ مطابقت نہیں رکھتا۔</p>';
$string['nativemysqli'] = 'بہتر کردہ MySQL (مقامی/mysqli)';
$string['nativemysqlihelp'] = '<p>ڈیٹا بیس وہ جگہ ہے جہاں موڈل کی زیادہ تر ترتیبات اور ڈیٹا محفوظ کیا جاتا ہے اور اسے یہاں کنفیگر کیا جانا چاہیے۔</p> <p>ڈیٹا بیس کا نام، صارف نام، اور پاس ورڈ مطلوبہ فیلڈز ہیں۔ جدول کا سابقہ اختیاری ہے۔</p> <p>ڈیٹا بیس کے نام میں صرف حروف عددی حروف، ڈالر ($) اور انڈر سکور (_) شامل ہوسکتے ہیں۔</p> <p>اگر ڈیٹا بیس فی الحال موجود نہیں ہے، اور صارف آپ specify کو اجازت ہے، Moodle درست اجازتوں اور ترتیبات کے ساتھ ایک نیا ڈیٹا بیس بنانے کی کوشش کرے گا۔</p>';
$string['nativeoci'] = 'اوریکل (آبائی/او سی آئی)';
$string['nativeocihelp'] = 'اب آپ کو ڈیٹا بیس کو ترتیب دینے کی ضرورت ہے جہاں زیادہ تر Moodle ڈیٹا کو محفوظ کیا جائے گا۔ یہ ڈیٹا بیس پہلے سے ہی بنایا گیا ہو گا اور اس تک رسائی کے لیے صارف نام اور پاس ورڈ بنایا گیا ہو گا۔ جدول کا سابقہ لازمی ہے۔';
$string['nativepgsql'] = 'PostgreSQL (آبائی/pgsql)';
$string['nativepgsqlhelp'] = '<p>ڈیٹا بیس وہ جگہ ہے جہاں موڈل کی زیادہ تر ترتیبات اور ڈیٹا محفوظ کیا جاتا ہے اور اسے یہاں ترتیب دینا ضروری ہے۔</p> <p>ڈیٹا بیس کا نام، صارف نام، پاس ورڈ اور ٹیبل کا سابقہ مطلوبہ فیلڈز ہیں۔ ڈیٹابیس پہلے سے موجود ہونا چاہیے اور صارف کو اسے پڑھنے اور لکھنے دونوں تک رسائی حاصل ہونی چاہیے۔</p>';
$string['nativesqlsrv'] = 'SQL*Server Microsoft (آبائی/sqlsrv)';
$string['nativesqlsrvhelp'] = 'اب آپ کو ڈیٹا بیس کو ترتیب دینے کی ضرورت ہے جہاں زیادہ تر Moodle ڈیٹا کو محفوظ کیا جائے گا۔ یہ ڈیٹا بیس پہلے سے ہی بنایا گیا ہو گا اور اس تک رسائی کے لیے صارف نام اور پاس ورڈ بنایا گیا ہو گا۔ جدول کا سابقہ لازمی ہے۔';
$string['nativesqlsrvnodriver'] = 'پی ایچ پی کے لیے ایس کیو ایل سرور کے لیے مائیکروسافٹ ڈرائیورز انسٹال نہیں ہیں یا مناسب طریقے سے کنفیگر نہیں ہوئے ہیں۔';
$string['ociextensionisnotpresentinphp'] = 'PHP کو OCI8 ایکسٹینشن کے ساتھ مناسب طریقے سے ترتیب نہیں دیا گیا ہے تاکہ یہ اوریکل کے ساتھ بات چیت کر سکے۔ براہ کرم اپنی php.ini فائل چیک کریں یا پی ایچ پی کو دوبارہ مرتب کریں۔';
$string['pass'] = 'پاس';
$string['paths'] = 'راستے';
$string['pathserrcreatedataroot'] = 'ڈیٹا ڈائرکٹری ({$a->dataroot}) انسٹالر کے ذریعے نہیں بنائی جا سکتی۔';
$string['pathshead'] = 'راستوں کی تصدیق کریں';
$string['pathsrodataroot'] = 'Dataroot ڈائریکٹری قابل تحریر نہیں ہے۔';
$string['pathsroparentdataroot'] = 'پیرنٹ ڈائرکٹری ({$a->parent}) قابل تحریر نہیں ہے۔ ڈیٹا ڈائرکٹری ({$a->dataroot}) انسٹالر کے ذریعے نہیں بنائی جا سکتی۔';
$string['pathssubadmindir'] = 'بہت کم ویب ہوسٹس /admin کو بطور خاص یو آر ایل استعمال کرتے ہیں تاکہ آپ کنٹرول پینل یا کسی اور چیز تک رسائی حاصل کر سکیں۔ بدقسمتی سے یہ موڈل ایڈمن پیجز کے معیاری مقام سے متصادم ہے۔ آپ اسے اپنی انسٹالیشن میں ایڈمن ڈائرکٹری کا نام بدل کر، اور اس نئے نام کو یہاں رکھ کر ٹھیک کر سکتے ہیں۔ مثال کے طور پر: <em>moodleadmin</em>۔ یہ Moodle میں ایڈمن لنکس کو ٹھیک کر دے گا۔';
$string['pathssubdataroot'] = '<p>ایک ڈائرکٹری جہاں Moodle صارفین کی طرف سے اپ لوڈ کردہ تمام فائل مواد کو اسٹور کرے گا۔</p> <p>یہ ڈائرکٹری ویب سرور صارف (عام طور پر \'www-data\'، \'nobody\'، یا \'کے ذریعے پڑھنے اور لکھنے کے قابل دونوں ہونی چاہیے۔ apache\')۔</p> <p>یہ ویب پر براہ راست قابل رسائی نہیں ہونا چاہیے۔</p> <p>اگر ڈائرکٹری فی الحال موجود نہیں ہے تو انسٹالیشن کا عمل اسے بنانے کی کوشش کرے گا۔</p>';
$string['pathssubdirroot'] = '<p>موڈل کوڈ پر مشتمل ڈائریکٹری کا مکمل راستہ۔</p>';
$string['pathssubwwwroot'] = '<p>مکمل پتہ جہاں Moodle تک رسائی حاصل کی جائے گی یعنی وہ ایڈریس جسے صارفین Moodle تک رسائی کے لیے اپنے براؤزر کے ایڈریس بار میں داخل کریں گے۔</p> <p>متعدد پتوں کا استعمال کرتے ہوئے Moodle تک رسائی ممکن نہیں ہے۔ اگر آپ کی سائٹ ایک سے زیادہ پتوں کے ذریعے قابل رسائی ہے تو پھر سب سے آسان کا انتخاب کریں اور دوسرے پتے میں سے ہر ایک کے لیے مستقل ری ڈائریکٹ سیٹ کریں۔</p> <p>اگر آپ کی سائٹ انٹرنیٹ اور اندرونی نیٹ ورک دونوں سے قابل رسائی ہے (کبھی کبھی ایک انٹرانیٹ کہا جاتا ہے)، پھر یہاں عوامی پتہ استعمال کریں۔</p> <p>اگر موجودہ پتہ درست نہیں ہے، تو براہ کرم اپنے براؤزر کے ایڈریس بار میں URL کو تبدیل کریں اور انسٹالیشن دوبارہ شروع کریں۔</p>';
$string['pathsunsecuredataroot'] = 'Dataroot مقام محفوظ نہیں ہے';
$string['pathswrongadmindir'] = 'ایڈمن ڈائرکٹری موجود نہیں ہے';
$string['pgsqlextensionisnotpresentinphp'] = 'پی ایچ پی کو پی جی ایس کیو ایل ایکسٹینشن کے ساتھ مناسب طریقے سے کنفیگر نہیں کیا گیا ہے تاکہ یہ PostgreSQL کے ساتھ بات چیت کر سکے۔ براہ کرم اپنی php.ini فائل چیک کریں یا پی ایچ پی کو دوبارہ مرتب کریں۔';
$string['phpextension'] = '{$a} پی ایچ پی کی توسیع';
$string['phpversion'] = 'پی ایچ پی ورژن';
$string['phpversionhelp'] = '<p>موڈل کو کم از کم 5.6.5 یا 7.1 کا پی ایچ پی ورژن درکار ہے (7.0.x میں انجن کی کچھ حدود ہیں)۔</p> <p>آپ فی الحال ورژن {$a} چلا رہے ہیں۔</p> <p> آپ کو پی ایچ پی کو اپ گریڈ کرنا ہوگا یا پی ایچ پی کے نئے ورژن کے ساتھ میزبان پر جانا ہوگا۔</p>';
$string['releasenoteslink'] = 'Moodle کے اس ورژن کے بارے میں معلومات کے لیے، براہ کرم {$a} پر ریلیز نوٹس دیکھیں';
$string['safemode'] = 'محفوظ طریقہ';
$string['safemodeerror'] = 'موڈل کو سیف موڈ آن ہونے میں پریشانی ہو سکتی ہے';
$string['safemodehelp'] = '<p>موڈل کو سیف موڈ آن کرنے میں مختلف قسم کے مسائل ہو سکتے ہیں، کم از کم یہ کہ اسے نئی فائلیں بنانے کی اجازت نہیں ہوگی۔ اس لیے آپ کو اپنی Moodle سائٹ کے لیے صرف ایک نئی ویب ہوسٹنگ کمپنی تلاش کرنی پڑ سکتی ہے۔';
$string['sessionautostart'] = 'سیشن خودکار آغاز';
$string['sessionautostarterror'] = 'یہ بند ہونا چاہیے';
$string['sessionautostarthelp'] = '<p>موڈل کو سیشن سپورٹ کی ضرورت ہوتی ہے اور وہ اس کے بغیر کام نہیں کرے گا۔</p> <p>php.ini فائل میں سیشنز کو فعال کیا جا سکتا ہے۔۔۔ session.auto_start پیرامیٹر تلاش کریں۔</p>';
$string['sqliteextensionisnotpresentinphp'] = 'پی ایچ پی کو SQLite ایکسٹینشن کے ساتھ مناسب طریقے سے کنفیگر نہیں کیا گیا ہے۔ براہ کرم اپنی php.ini فائل چیک کریں یا پی ایچ پی کو دوبارہ مرتب کریں۔';
$string['upgradingqtypeplugin'] = 'سوال/ٹائپ پلگ ان کو اپ گریڈ کرنا';
$string['welcomep20'] = 'آپ یہ صفحہ دیکھ رہے ہیں کیونکہ آپ نے اپنے کمپیوٹر میں <strong>{$a->packname} {$a->packversion}</strong> پیکیج کو کامیابی سے انسٹال اور لانچ کیا ہے۔ مبارک ہو!';
$string['welcomep30'] = '<strong>{$a->installername</strong> کی اس ریلیز میں ایک ایسا ماحول بنانے کے لیے ایپلیکیشنز شامل ہیں جس میں <strong>Moodle</strong> کام کرے گا، یعنی:';
$string['welcomep40'] = 'پیکیج میں <strong>Moodle {$a->moodlerelease} ({$a->moodleversion})</strong> بھی شامل ہے۔';
$string['welcomep50'] = 'اس پیکج میں تمام درخواستوں کا استعمال ان کے متعلقہ لائسنسوں کے ذریعے کیا جاتا ہے۔ مکمل <strong>{$a->installername}</strong> پیکیج <a href="https://www.opensource.org/docs/definition_plain.html">اوپن سورس</a> ہے اور اس کے تحت تقسیم کیا گیا ہے۔ <a href="https://www.gnu.org/copyleft/gpl.html">GPL</a> لائسنس۔';
$string['welcomep60'] = 'مندرجہ ذیل صفحات آپ کو اپنے کمپیوٹر پر <strong>Moodle</strong> کو ترتیب دینے اور ترتیب دینے کے لیے کچھ آسان اقدامات کی پیروی کرنے کی رہنمائی کریں گے۔ آپ پہلے سے طے شدہ ترتیبات کو قبول کر سکتے ہیں یا اختیاری طور پر، اپنی ضروریات کے مطابق ان میں ترمیم کر سکتے ہیں۔';
$string['welcomep70'] = '<strong>Moodle</strong> کے سیٹ اپ کے ساتھ جاری رکھنے کے لیے نیچے "اگلا" بٹن پر کلک کریں۔';
$string['wwwroot'] = 'ویب سائٹ کا پتہ';
$string['wwwrooterror'] = '\'ویب ایڈریس\' درست معلوم نہیں ہوتا ہے - یہ Moodle انسٹالیشن وہاں موجود نہیں دکھائی دیتی ہے۔ نیچے کی قدر دوبارہ ترتیب دی گئی ہے۔';
