<?php
// This file is part of Moodle - http://moodle.org/
//
// Moodle is free software: you can redistribute it and/or modify
// it under the terms of the GNU General Public License as published by
// the Free Software Foundation, either version 3 of the License, or
// (at your option) any later version.
//
// Moodle is distributed in the hope that it will be useful,
// but WITHOUT ANY WARRANTY; without even the implied warranty of
// MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
// GNU General Public License for more details.
//
// You should have received a copy of the GNU General Public License
// along with Moodle.  If not, see <http://www.gnu.org/licenses/>.

$string['essaywiris'] = 'Δοκίμιο - επιστήμη';
$string['essaywiris_help'] = 'Πα�?όμοια με την τυπική ε�?ώτηση τ�?που δοκιμίου, αλλά μπο�?είτε να δώσετε διαφο�?ετικό κείμενο ε�?ώτησης, εισάγοντας τυχαίους α�?ιθμο�?ς, τ�?πους ή σχεδιαγ�?άμματα. Στα σχόλια μπο�?ο�?ν επίσης να χ�?ησιμοποιο�?νται οι τυχαίες τιμές.';
$string['editingessaywiris'] = 'Επεξε�?γασία ε�?ώτησης τ�?που δοκιμίου για μαθηματικά και επιστήμη από τη WIRIS';
$string['addingessaywiris'] = 'Π�?οσθήκη ε�?ώτησης τ�?που δοκιμίου για μαθηματικά και επιστήμη από τη WIRIS';
$string['essaywirissummary'] = 'Πα�?όμοια με την τυπική ε�?ώτηση τ�?που δοκιμίου, αλλά μπο�?είτε να δώσετε διαφο�?ετικό κείμενο ε�?ώτησης, εισάγοντας τυχαίους α�?ιθμο�?ς, τ�?πους ή σχεδιαγ�?άμματα. Στα σχόλια μπο�?ο�?ν επίσης να χ�?ησιμοποιο�?νται οι τυχαίες τιμές.';
$string['essaywiris_algorithm'] = 'Αλγό�?ιθμος';
$string['essaywiris_wiris_variables'] = 'Μεταβλητές WIRIS ';

// From Moodle 2.3.
$string['pluginname'] = 'Δοκίμιο - επιστήμη';
$string['pluginname_help'] = 'Πα�?όμοια με την τυπική ε�?ώτηση τ�?που δοκιμίου, αλλά μπο�?είτε να δώσετε διαφο�?ετικό κείμενο ε�?ώτησης, εισάγοντας τυχαίους α�?ιθμο�?ς, τ�?πους ή σχεδιαγ�?άμματα. Στα σχόλια μπο�?ο�?ν επίσης να χ�?ησιμοποιο�?νται οι τυχαίες τιμές.';
$string['pluginnamesummary'] = 'Πα�?όμοια με την τυπική ε�?ώτηση τ�?που δοκιμίου, αλλά μπο�?είτε να δώσετε διαφο�?ετικό κείμενο ε�?ώτησης, εισάγοντας τυχαίους α�?ιθμο�?ς, τ�?πους ή σχεδιαγ�?άμματα. Στα σχόλια μπο�?ο�?ν επίσης να χ�?ησιμοποιο�?νται οι τυχαίες τιμές.';
$string['pluginnameadding'] = 'Π�?οσθήκη ε�?ώτησης τ�?που δοκιμίου για μαθηματικά και επιστήμη από τη WIRIS';
$string['pluginnameediting'] = 'Επεξε�?γασία ε�?ώτησης τ�?που δοκιμίου για μαθηματικά και επιστήμη από τη WIRIS';
