<?php
$string['essaywiris'] = 'Δοκίμιο - επιστήμη';
$string['essaywiris_help'] = 'Παρόμοια με την τυπική ερώτηση τύπου δοκιμίου, αλλά μπορείτε να δώσετε διαφορετικό κείμενο ερώτησης, εισάγοντας τυχαίους αριθμούς, τύπους ή σχεδιαγράμματα. Στα σχόλια μπορούν επίσης να χρησιμοποιούνται οι τυχαίες τιμές.';
$string['editingessaywiris'] = 'Επεξεργασία ερώτησης τύπου δοκιμίου για μαθηματικά και επιστήμη από τη WIRIS';
$string['addingessaywiris'] = 'Προσθήκη ερώτησης τύπου δοκιμίου για μαθηματικά και επιστήμη από τη WIRIS';
$string['essaywirissummary'] = 'Παρόμοια με την τυπική ερώτηση τύπου δοκιμίου, αλλά μπορείτε να δώσετε διαφορετικό κείμενο ερώτησης, εισάγοντας τυχαίους αριθμούς, τύπους ή σχεδιαγράμματα. Στα σχόλια μπορούν επίσης να χρησιμοποιούνται οι τυχαίες τιμές.';
$string['essaywiris_algorithm'] = 'Αλγόριθμος';
$string['essaywiris_wiris_variables'] = 'Μεταβλητές WIRIS ';

//From Moodle 2.3
$string['pluginname'] = 'Δοκίμιο - επιστήμη';
$string['pluginname_help'] = 'Παρόμοια με την τυπική ερώτηση τύπου δοκιμίου, αλλά μπορείτε να δώσετε διαφορετικό κείμενο ερώτησης, εισάγοντας τυχαίους αριθμούς, τύπους ή σχεδιαγράμματα. Στα σχόλια μπορούν επίσης να χρησιμοποιούνται οι τυχαίες τιμές.';
$string['pluginnamesummary'] = 'Παρόμοια με την τυπική ερώτηση τύπου δοκιμίου, αλλά μπορείτε να δώσετε διαφορετικό κείμενο ερώτησης, εισάγοντας τυχαίους αριθμούς, τύπους ή σχεδιαγράμματα. Στα σχόλια μπορούν επίσης να χρησιμοποιούνται οι τυχαίες τιμές.';
$string['pluginnameadding'] = 'Προσθήκη ερώτησης τύπου δοκιμίου για μαθηματικά και επιστήμη από τη WIRIS';
$string['pluginnameediting'] = 'Επεξεργασία ερώτησης τύπου δοκιμίου για μαθηματικά και επιστήμη από τη WIRIS';
?>