<?php
$string['shortanswerwiris'] = 'Σύντομη απάντηση - επιστήμη';
$string['shortanswerwiris_help'] = 'Παρόμοια με την τυπική σύντομη απάντηση, αλλά μπορείτε να ελέγξετε την απάντηση χρησιμοποιώντας τη μαθηματική ισοδυναμία της επιλογής σας. Προαιρετικά, μπορείτε να εισαγάγετε τυχαίες παραμέτρους στη διατύπωση της ερώτησής σας και να δώσετε έναν πλήρως ολοκληρωμένο επεξεργαστή για την απάντηση.';
$string['editingshortanswerwiris'] = 'Επεξεργασία ερώτησης τύπου σύντομης απάντησης για μαθηματικά και επιστήμη από τη WIRIS';
$string['addingshortanswerwiris'] = 'Προσθήκη ερώτησης τύπου σύντομης απάντησης για μαθηματικά και επιστήμη από τη WIRIS';
$string['shortanswerwirissummary'] = 'Παρόμοια με την τυπική σύντομη απάντηση, αλλά μπορείτε να ελέγξετε την απάντηση χρησιμοποιώντας τη μαθηματική ισοδυναμία της επιλογής σας. Προαιρετικά, μπορείτε να εισαγάγετε τυχαίες παραμέτρους στη διατύπωση της ερώτησής σας και να δώσετε έναν πλήρως ολοκληρωμένο επεξεργαστή για την απάντηση.';
$string['shortanswerwiris_addanswers'] = 'Κενό για άλλη επιλογή';
$string['shortanswerwiris_answersinstruct'] = 'Πρέπει να δώσετε τουλάχιστον μία σωστή απάντηση. Οι απαντήσεις που παραμένουν κενές δεν θα χρησιμοποιούνται. Η πρώτη απάντηση που αντιστοιχεί θα χρησιμοποιείται για τον προσδιορισμό της βαθμολογίας και των σχολίων.';
$string['shortanswerwiris_algorithm'] = 'Αλγόριθμος';
$string['shortanswerwiris_cantimportcompoundtest'] = 'Η ερώτηση μαθητικών και επιστήμης με σύντομη απάντηση δεν ήταν δυνατό να εισαχθεί σωστά από τη μορφή Moodle 1.9. Η ερώτηση θα πρέπει να επιδιορθωθεί με μη αυτόματο τρόπο, σύμφωνα με τις οδηγίες που δίνονται στη σελίδα <a href="http://www.wiris.com/quizzes/docs/moodle/manual/compound-answer#upgrade">http://www.wiris.com/quizzes/docs/moodle/manual/compound-answer#upgrade</a>.';
$string['filloutoneanswer'] = 'Πρέπει να δώσετε τουλάχιστον μία πιθανή απάντηση. Η πρώτη απάντηση που αντιστοιχεί θα χρησιμοποιείται για τον προσδιορισμό της βαθμολογίας και των σχολίων. Κάντε κλικ στο εικονίδιο δίπλα στο πεδίο της απάντησης για να επεξεργαστείτε τις μαθηματικές ιδιότητες της απάντησης και της ερώτησης.';

//From Moodle 2.3
$string['pluginname'] = 'Σύντομη απάντηση - επιστήμη';
$string['pluginname_help'] = 'Παρόμοια με την τυπική σύντομη απάντηση, αλλά μπορείτε να ελέγξετε την απάντηση χρησιμοποιώντας τη μαθηματική ισοδυναμία της επιλογής σας. Προαιρετικά, μπορείτε να εισαγάγετε τυχαίες παραμέτρους στη διατύπωση της ερώτησής σας και να δώσετε έναν πλήρως ολοκληρωμένο επεξεργαστή για την απάντηση.';
$string['pluginnamesummary'] = 'Παρόμοια με την τυπική σύντομη απάντηση, αλλά μπορείτε να ελέγξετε την απάντηση χρησιμοποιώντας τη μαθηματική ισοδυναμία της επιλογής σας. Προαιρετικά, μπορείτε να εισαγάγετε τυχαίες παραμέτρους στη διατύπωση της ερώτησής σας και να δώσετε έναν πλήρως ολοκληρωμένο επεξεργαστή για την απάντηση.';
$string['pluginnameediting'] = 'Επεξεργασία ερώτησης τύπου σύντομης απάντησης για μαθηματικά και επιστήμη από τη WIRIS';
$string['pluginnameadding'] = 'Προσθήκη ερώτησης τύπου σύντομης απάντησης για μαθηματικά και επιστήμη από τη WIRIS';
$string['contentnotviewable'] = 'Το περιεχόμενο δεν μπορεί να εμφανιστεί.';
?>