<?php
// This file is part of Moodle - http://moodle.org/
//
// Moodle is free software: you can redistribute it and/or modify
// it under the terms of the GNU General Public License as published by
// the Free Software Foundation, either version 3 of the License, or
// (at your option) any later version.
//
// Moodle is distributed in the hope that it will be useful,
// but WITHOUT ANY WARRANTY; without even the implied warranty of
// MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
// GNU General Public License for more details.
//
// You should have received a copy of the GNU General Public License
// along with Moodle.  If not, see <http://www.gnu.org/licenses/>.

$string['multichoicewiris'] = 'Πολλαπλή επιλογή - επιστήμη';
$string['multichoicewiris_help'] = 'Πα�?όμοια με την τυπική πολλαπλή επιλογή, αλλά μπο�?είτε να δώσετε διαφο�?ετικό κείμενο ε�?ώτησης και επιλογές, εισάγοντας τυχαίους α�?ιθμο�?ς, τ�?πους ή σχεδιαγ�?άμματα. Στα σχόλια μπο�?ο�?ν επίσης να χ�?ησιμοποιο�?νται οι τυχαίες τιμές.';
$string['editingmultichoicewiris'] = 'Επεξε�?γασία ε�?ώτησης πολλαπλής επιλογής για μαθηματικά και επιστήμη από τη WIRIS';
$string['addingmultichoicewiris'] = 'Π�?οσθήκη ε�?ώτησης πολλαπλής επιλογής για μαθηματικά και επιστήμη από τη WIRIS';
$string['multichoicewirissummary'] = 'Πα�?όμοια με την τυπική πολλαπλή επιλογή, αλλά μπο�?είτε να δώσετε διαφο�?ετικό κείμενο ε�?ώτησης και επιλογές, εισάγοντας τυχαίους α�?ιθμο�?ς, τ�?πους ή σχεδιαγ�?άμματα. Στα σχόλια μπο�?ο�?ν επίσης να χ�?ησιμοποιο�?νται οι τυχαίες τιμές.';
$string['multichoicewiris_algorithm'] = 'Αλγό�?ιθμος';
$string['multichoicewiris_wiris_variables'] = 'Μεταβλητές WIRIS ';
$string['multichoicewiris_cantimportoverride'] = 'Η ε�?ώτηση μαθητικών και επιστήμης με πολλαπλή επιλογή δεν ήταν δυνατό να εισαχθεί σωστά από τη μο�?φή Moodle 1.9. Η ε�?ώτηση θα π�?έπει να επιδιο�?θωθεί με μη αυτόματο τ�?όπο, σ�?μφωνα με τις οδηγίες που δίνονται στη σελίδα <a href="http://www.wiris.com/quizzes/docs/moodle/manual/multiple-choice#frommoodle1">http://www.wiris.com/quizzes/docs/moodle/manual/multiple-choice#frommoodle1</a>.';

// From Moodle 2.3.
$string['pluginname'] = 'Πολλαπλή επιλογή - επιστήμη';
$string['pluginname_help'] = 'Πα�?όμοια με την τυπική πολλαπλή επιλογή, αλλά μπο�?είτε να δώσετε διαφο�?ετικό κείμενο ε�?ώτησης και επιλογές, εισάγοντας τυχαίους α�?ιθμο�?ς, τ�?πους ή σχεδιαγ�?άμματα. Στα σχόλια μπο�?ο�?ν επίσης να χ�?ησιμοποιο�?νται οι τυχαίες τιμές.';
$string['pluginnamesummary'] = 'Πα�?όμοια με την τυπική πολλαπλή επιλογή, αλλά μπο�?είτε να δώσετε διαφο�?ετικό κείμενο ε�?ώτησης και επιλογές, εισάγοντας τυχαίους α�?ιθμο�?ς, τ�?πους ή σχεδιαγ�?άμματα. Στα σχόλια μπο�?ο�?ν επίσης να χ�?ησιμοποιο�?νται οι τυχαίες τιμές.';
$string['pluginnameadding'] = 'Π�?οσθήκη ε�?ώτησης πολλαπλής επιλογής για μαθηματικά και επιστήμη από τη WIRIS';
$string['pluginnameediting'] = 'Επεξε�?γασία ε�?ώτησης πολλαπλής επιλογής για μαθηματικά και επιστήμη από τη WIRIS';
