<?php
$string['multichoicewiris'] = 'Πολλαπλή επιλογή - επιστήμη';
$string['multichoicewiris_help'] = 'Παρόμοια με την τυπική πολλαπλή επιλογή, αλλά μπορείτε να δώσετε διαφορετικό κείμενο ερώτησης και επιλογές, εισάγοντας τυχαίους αριθμούς, τύπους ή σχεδιαγράμματα. Στα σχόλια μπορούν επίσης να χρησιμοποιούνται οι τυχαίες τιμές.';
$string['editingmultichoicewiris'] = 'Επεξεργασία ερώτησης πολλαπλής επιλογής για μαθηματικά και επιστήμη από τη WIRIS';
$string['addingmultichoicewiris'] = 'Προσθήκη ερώτησης πολλαπλής επιλογής για μαθηματικά και επιστήμη από τη WIRIS';
$string['multichoicewirissummary'] = 'Παρόμοια με την τυπική πολλαπλή επιλογή, αλλά μπορείτε να δώσετε διαφορετικό κείμενο ερώτησης και επιλογές, εισάγοντας τυχαίους αριθμούς, τύπους ή σχεδιαγράμματα. Στα σχόλια μπορούν επίσης να χρησιμοποιούνται οι τυχαίες τιμές.';
$string['multichoicewiris_algorithm'] = 'Αλγόριθμος';
$string['multichoicewiris_wiris_variables'] = 'Μεταβλητές WIRIS ';
$string['multichoicewiris_cantimportoverride'] = 'Η ερώτηση μαθητικών και επιστήμης με πολλαπλή επιλογή δεν ήταν δυνατό να εισαχθεί σωστά από τη μορφή Moodle 1.9. Η ερώτηση θα πρέπει να επιδιορθωθεί με μη αυτόματο τρόπο, σύμφωνα με τις οδηγίες που δίνονται στη σελίδα <a href="http://www.wiris.com/quizzes/docs/moodle/manual/multiple-choice#frommoodle1">http://www.wiris.com/quizzes/docs/moodle/manual/multiple-choice#frommoodle1</a>.';

//From Moodle 2.3
$string['pluginname'] = 'Πολλαπλή επιλογή - επιστήμη';
$string['pluginname_help'] = 'Παρόμοια με την τυπική πολλαπλή επιλογή, αλλά μπορείτε να δώσετε διαφορετικό κείμενο ερώτησης και επιλογές, εισάγοντας τυχαίους αριθμούς, τύπους ή σχεδιαγράμματα. Στα σχόλια μπορούν επίσης να χρησιμοποιούνται οι τυχαίες τιμές.';
$string['pluginnamesummary'] = 'Παρόμοια με την τυπική πολλαπλή επιλογή, αλλά μπορείτε να δώσετε διαφορετικό κείμενο ερώτησης και επιλογές, εισάγοντας τυχαίους αριθμούς, τύπους ή σχεδιαγράμματα. Στα σχόλια μπορούν επίσης να χρησιμοποιούνται οι τυχαίες τιμές.';
$string['pluginnameadding'] = 'Προσθήκη ερώτησης πολλαπλής επιλογής για μαθηματικά και επιστήμη από τη WIRIS';
$string['pluginnameediting'] = 'Επεξεργασία ερώτησης πολλαπλής επιλογής για μαθηματικά και επιστήμη από τη WIRIS';
?>