<?php
// This file is part of Moodle - https://moodle.org/
//
// Moodle is free software: you can redistribute it and/or modify
// it under the terms of the GNU General Public License as published by
// the Free Software Foundation, either version 3 of the License, or
// (at your option) any later version.
//
// Moodle is distributed in the hope that it will be useful,
// but WITHOUT ANY WARRANTY; without even the implied warranty of
// MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
// GNU General Public License for more details.
//
// You should have received a copy of the GNU General Public License
// along with Moodle.  If not, see <https://www.gnu.org/licenses/>.

/**
 * Strings for component 'survey', language 'uk', version '4.1'.
 *
 * @package     survey
 * @category    string
 * @copyright   1999 Martin Dougiamas and contributors
 * @license     https://www.gnu.org/copyleft/gpl.html GNU GPL v3 or later
 */

defined('MOODLE_INTERNAL') || die();

$string['actual'] = 'Фактичний';
$string['actualclass'] = 'Фактичний клас';
$string['actualstudent'] = '{$a} фактичний';
$string['allquestionrequireanswer'] = 'Всі питання вимагають відповіді';
$string['allquestions'] = 'Всі питання за порядком, всі студенти';
$string['allscales'] = 'Всі шкали, всі студенти';
$string['alreadysubmitted'] = 'Ви вже дали відповіді в цій анкеті';
$string['analysisof'] = 'Аналізи {$a}';
$string['answers'] = 'Відповіді';
$string['attls1'] = 'Оцінюючи висловлювання, я зосереджуюся на його аргументованості, а не на особистості людини';
$string['attls10'] = 'Для мене дуже важливим є залишатися найбільш об\'єктивним, коли я щось аналізую';
$string['attls10short'] = 'Залишатися об\'єктивним';
$string['attls11'] = 'Я намагаюся довести думку людині, замість того, щоб спростовувати її';
$string['attls11short'] = 'Довести думку людині';
$string['attls12'] = 'Я використовую певні критерії при оцінюванні аргументів';
$string['attls12short'] = 'Використати критерії';
$string['attls13'] = 'Я більш схильний до розуміння думки людини, ніж до її оцінювання';
$string['attls13short'] = 'Спробувати зрозуміти людину';
$string['attls14'] = 'Я намагаюся показати людям слабкі місця в їхніх міркуваннях, щоб допомогти їм уточнити аргументи';
$string['attls14short'] = 'Показувати слабкі місця аргументів';
$string['attls15'] = 'Я звичайно уявляю себе на місці опонента, під час дискусії, щоб зрозуміти, чому він так думає';
$string['attls15short'] = 'Уявити себе на місці опонента';
$string['attls16'] = 'Під час аналізу я ретельно враховую навіть незначні деталі';
$string['attls16short'] = 'Ретельний аналіз';
$string['attls17'] = 'Обговорюючи проблему, я ціную логіку вище за свої упередження';
$string['attls17short'] = 'Цінувати логіку';
$string['attls18'] = 'Я можу зрозуміти думку, що відрізняється від моєї через співчуття.';
$string['attls18short'] = 'Розуміти через співчуття';
$string['attls19'] = 'Коли я зіштовхуюся з людьми, чиї думки здаються мені далекими, я роблю зусилля, щоб розширити свій кругозір та знайти спосіб усвідомити, як вони могли думати в такий спосіб.';
$string['attls19short'] = 'Роблю зусилля для розширення кругозору';
$string['attls1short'] = 'Зосереджуватися на аргументованості';
$string['attls2'] = 'Мені подобається грати в \'Адвоката диявола\' - я відстоюю протилежну точку зору';
$string['attls20'] = 'Я проводжу час у спробах зрозуміти що не так. Наприклад, я буду шукати приклади в літературній інтерпретації.';
$string['attls20short'] = 'Дізнаватися, що неправильно';
$string['attls2short'] = 'Грати в \'Адвоката диявола\'';
$string['attls3'] = 'Я намагаюся зрозуміти, звідки ця людина, який надбаний досвід змушує її так думати';
$string['attls3short'] = 'Зрозуміти, звідки людина';
$string['attls4'] = 'Найбільш важливою частиною моєї освіти було навчитися розуміти людей, які значною мірою відрізняються від мене';
$string['attls4short'] = 'Зрозуміти людей';
$string['attls5'] = 'Я думаю, що найкращий спосіб сформувати свою точку зору - спілкуватися із якнайбільшою кількістю різних людей';
$string['attls5short'] = 'спілкуватися з різними людьми';
$string['attls6'] = 'Мені подобається чути думки людей, які прийшли з іншого середовища - це допомагає мені зрозуміти, як можна по-різному дивитися на одну й ту саму річ';
$string['attls6short'] = 'Подобається чути думки';
$string['attls7'] = 'Я вважаю, що можу посилити свою позицію через суперечки з людьми, не згодними зі мною';
$string['attls7short'] = 'Посилюю позицію в суперечках';
$string['attls8'] = 'Мені завжди були цікаво, чому люди говорять і вірять у деякі речі';
$string['attls8short'] = 'Довідатися чому';
$string['attls9'] = 'Я часто помічаю за собою, що сперечаюся із авторами книг, які читаю, намагаючись логічно обгрунтувати, чому вони помиляються';
$string['attls9short'] = 'Сперечатися з авторами';
$string['attlsintro'] = 'Мета цієї анкети - допомогти нам оцінити Ваше ставлення до навчання.<br />В анкеті немає правильних і неправильних відповідей, нас цікавить тільки Ваша думка. Отримані результати будуть оброблені з повною конфіденційністю, і їхній зміст ніяк не позначиться на Ваших оцінках';
$string['attlsm1'] = 'Ставлення до стилю мислення та навчання';
$string['attlsm2'] = 'Пов\'язане навчання';
$string['attlsm3'] = 'Роздільне навчання';
$string['attlsmintro'] = 'В обговоренні ...';
$string['attlsname'] = 'ATTLS (версія з 20 запитань)';
$string['cannotfindanswer'] = 'Ще немає відповідей в цій анкеті.';
$string['cannotfindquestion'] = 'Немає питань';
$string['cannotfindsurveytmpt'] = 'Не знайдено шаблону анкети!';
$string['ciq1'] = 'У який момент Ви були найбільше зайняті навчанням?';
$string['ciq1short'] = 'Найбільш зацікавлений';
$string['ciq2'] = 'У який момент Ви були найбільше віддалені від навчання?';
$string['ciq2short'] = 'Найбільш віддалений';
$string['ciq3'] = 'Чию діяльність у форумах Ви знаходите найбільш корисною?';
$string['ciq3short'] = 'Корисний момент';
$string['ciq4'] = 'Чию діяльність у форумах Ви знаходите найбільш заплутаною і такою несподіваною?';
$string['ciq4short'] = 'Момент, що збиває з пантелику';
$string['ciq5'] = 'Які події справили на вас найбільше враження';
$string['ciq5short'] = 'Вражаючий момент';
$string['ciqintro'] = 'Згадуючи про недавні події в класі, відповідайте на наступні питання.';
$string['ciqname'] = 'Критичні інциденти';
$string['clicktocontinue'] = 'Продовжити...';
$string['clicktocontinuecheck'] = 'Перевірити та продовжити...';
$string['colles1'] = 'Моє навчання фокусується на темах, які мене цікавлять';
$string['colles10'] = 'Я прошу інших студентів пояснити свої думки';
$string['colles10short'] = 'Прошу пояснити';
$string['colles11'] = 'інші студенти просять мене пояснити мої думки';
$string['colles11short'] = 'Мене просять пояснити';
$string['colles12'] = 'Інші студенти розділяють мої погляди';
$string['colles12short'] = 'Студенти підтримують мене';
$string['colles13'] = 'Викладачі стимулюють моє мислення';
$string['colles13short'] = 'Викладачі стимулюють мислення';
$string['colles14'] = 'Викладачі надихають мене практично застосувати знання';
$string['colles14short'] = 'Викладачі надихають мене';
$string['colles15'] = 'Викладач моделює гарні теми для обговорень';
$string['colles15short'] = 'Моделює гарні обговорення';
$string['colles16'] = 'Викладач моделює критичну саморефлексію';
$string['colles16short'] = 'Викладач моделює саморефлексію';
$string['colles17'] = 'Інші студенти надихають мене на участь';
$string['colles17short'] = 'Студенти надихають мене';
$string['colles18'] = 'Інші студенти високо цінують мій внесок';
$string['colles18short'] = 'Студенти мене високо цінують';
$string['colles19'] = 'Інші студенти цінують мій внесок';
$string['colles19short'] = 'Студенти цінують мене';
$string['colles1short'] = 'Зосереджуватися на цікавих темах';
$string['colles2'] = 'Я вивчаю те, що буде мені корисним в професійній практиці';
$string['colles20'] = 'Інші студенти з розумінням ставляться до моєї боротьби за знання';
$string['colles20short'] = 'Студенти розуміють мене';
$string['colles21'] = 'У мене складається гарне враження від повідомлень інших студентів';
$string['colles21short'] = 'Я розумію інших студентів';
$string['colles22'] = 'Мої повідомлення справляють гарне враження на інших студентів';
$string['colles22short'] = 'Студенти розуміють мене';
$string['colles23'] = 'Повідомлення викладачів справляють на мене гарне враження.';
$string['colles23short'] = 'Я розумію викладачів';
$string['colles24'] = 'Мої повідомлення справляють гарне враження на викладачів.';
$string['colles24short'] = 'Викладачі розуміють мене';
$string['colles2short'] = 'Необхідне для практики';
$string['colles3'] = 'Я вивчаю те, що може вдосконалити мої професійні навички';
$string['colles3short'] = 'Удосконалення навичок';
$string['colles4'] = 'Те, що я вивчаю тісно пов\'язане із моєю професійною практикою';
$string['colles4short'] = 'Пов\'язане із практикою';
$string['colles5'] = 'Я критично ставлюся до процесу свого навчання';
$string['colles5short'] = 'Критичний підхід до навчання';
$string['colles6'] = 'Я з критикою ставлюся до своїх власних поглядів';
$string['colles6short'] = 'Критичний підхід до своїх поглядів';
$string['colles7'] = 'Я ставлюся критично до поглядів інших студентів';
$string['colles7short'] = 'Критичний підхід до чужих поглядів';
$string['colles8'] = 'Я критично ставлюся до прочитаних думок';
$string['colles8short'] = 'Читати із критикою';
$string['colles9'] = 'Я пояснюю свої ідеї іншим студентам';
$string['colles9short'] = 'Пояснювати свої ідеї';
$string['collesaintro'] = 'Метою даного анкетування є допомогти нам зрозуміти наскільки корисним для Вас виявилося дистанційне навчання.

ожне із 24 тверджень є про ваш особистий досвід.

Тут немає \'правильних\' або \'неправильних\' відповідей: ми цікавимося тільки Вашою думкою. Будьте впевнені, що Ваші відповіді будуть оброблені на високому рівні конфіденційності, і ніяк не позначаться на Ваших оцінках.

Ваші відповіді допоможуть нам поліпшити якість дистанційного навчання в майбутньому. Наперед Вам вдячні.';
$string['collesaname'] = 'COLLES (Фактично)';
$string['collesapintro'] = 'Метою даного дослідження є допомогти нам зрозуміти, наскільки корисним для Вас виявилося дистанційне навчання.

Кожне із цих 24 тверджень передбачає, що Ви порівняєте Ваші бажання (ідеал) і фактичний досвід у даному питанні.

Тут немає \'правильних\' чи \'неправильних\' відповідей: ми цікавимося тільки Вашою думкою. Будьте впевнені, що Ваші відповіді будуть розглядатися на високому рівні конфіденційності, і не позначаться на Ваших оцінках.

Ваші відповіді допоможуть нам поліпшити якість дистанційного навчання в майбутньому.

Наперед Вам вдячні.';
$string['collesapname'] = 'COLLES (Переваги та Фактично)';
$string['collesm1'] = 'Релевантність';
$string['collesm1short'] = 'Релевантність';
$string['collesm2'] = 'Рефлективне мислення';
$string['collesm2short'] = 'Рефлективне мислення';
$string['collesm3'] = 'Інтерактивність';
$string['collesm3short'] = 'Інтерактивність';
$string['collesm4'] = 'Підтримка викладача';
$string['collesm4short'] = 'Підтримка викладача';
$string['collesm5'] = 'Підтримка рівних за статусом';
$string['collesm5short'] = 'Підтримка рівних за статусом';
$string['collesm6'] = 'Інтерпретація';
$string['collesm6short'] = 'Інтерпретація';
$string['collesmintro'] = 'У цьому розділі...';
$string['collespintro'] = 'Метою даного анкетування є допомогти нам зрозуміти, що Ви найбільше цінуєте в дистанційному навчанні.

Кожне із цих 24 тверджень передбачає, що Ви порівняєте Ваші бажання (ідеал) і фактичний досвід у цьому питанні.

Тут немає \'правильних\' чи \'неправильних\' відповідей: ми цікавимося тільки Вашою думкою. Будьте впевнені, що ваші відповіді будуть розглядатися на високому рівні конфіденційності, і не позначаться на Ваших оцінках.

Ваші відповіді допоможуть нам поліпшити якість дистанційного навчання в майбутньому.

Наперед Вам вдячні.';
$string['collespname'] = 'COLLES (Переваги)';
$string['completiondetail:submit'] = 'Надсилайте відповіді';
$string['completionsubmit'] = 'Студент повинен подати заявку';
$string['customintro'] = 'Ручний вступ';
$string['deleteallanswers'] = 'Видалити всі відповіді';
$string['deleteanalysis'] = 'Видалити аналіз';
$string['done'] = 'Завершено';
$string['download'] = 'Завантажити';
$string['downloadexcel'] = 'Завантажити дані як електронну таблицю Excel';
$string['downloadinfo'] = 'Ви можете завантажити дані анкетування в зручній для аналізу формі: Excel, SPSS і т.д.';
$string['downloadresults'] = 'Завантажити результати';
$string['downloadtext'] = 'Завантажити результати в текстовому форматі';
$string['editingasurvey'] = 'Редагування анкети';
$string['errorunabletosavenotes'] = 'Виникла помилка під час збереження ваших нотаток.';
$string['eventreportdownloaded'] = 'Завантажено звіт анкети';
$string['eventreportviewed'] = 'Переглянуто звіт анкети';
$string['eventresponsesubmitted'] = 'Надано відповідь на анкету';
$string['guestsnotallowed'] = 'Тільки зараховані користувачі можуть відповідати в анкеті';
$string['howlong'] = 'Як довго Ви заповнювали анкету?';
$string['howlongoptions'] = 'менше 1 хв, 1-2 хв, 2-3 хв, 3-4 хв, 4-5- хв, 5-10 хв, більше, ніж 10';
$string['ifoundthat'] = 'Я довідався, що';
$string['indicator:cognitivedepth'] = 'Анкета: пізнавальний аспект';
$string['indicator:cognitivedepth_help'] = 'Цей показник базується на глибині пізнання, досягнутої студентом під час опитування.';
$string['indicator:cognitivedepthdef'] = 'Опитування пізнавальне';
$string['indicator:cognitivedepthdef_help'] = 'Учасник досяг цього відсотка когнітивної залученості, запропонованої діяльністю опитування протягом цього інтервалу аналізу (Рівні = Немає перегляду, Перегляд, Подання)';
$string['indicator:cognitivedepthdef_link'] = 'Learning_analytics_indicators#Cognitive_depth';
$string['indicator:socialbreadth'] = 'Анкета: соціальний аспект';
$string['indicator:socialbreadth_help'] = 'Цей показник базується на соціальному розширенні, досягнутому студентом під час опитування.';
$string['indicator:socialbreadthdef'] = 'Опитування соц';
$string['indicator:socialbreadthdef_help'] = 'Учасник досяг цього відсотка соціальної залученості, запропонованої діяльністю опитування протягом цього інтервалу аналізу (Рівні = Без участі, лише учасник)';
$string['indicator:socialbreadthdef_link'] = 'Learning_analytics_indicators#Social_breadth';
$string['introtext'] = 'Вступний текст';
$string['invalidsurveyid'] = 'Неправильний код анкети';
$string['invalidtmptid'] = 'Неправильний код шаблону';
$string['ipreferthat'] = 'Я волію, щоб';
$string['modulename'] = 'Анкета';
$string['modulename_help'] = '<p>Включає готові анкети для оцінювання та стимулювання навчання в дистанційних курсах. Викладач може використовувати їх для збору даних, які допоможуть йому краще дізнатися про своїх студентів та поміркувати про ефективність навчання.</p>
<p>Існують три типи анкет:</p>
<ul>
  <li>Ставлення до стилю мислення та навчання (ATTLS - Attitudes to Thinking and Learning Survey). Ця анкета призначена для визначення рівня відношення студентів до навчання у курсі. Вона включає 20 типових питань.
  <li>Критичні інциденти (Critical Incidents). У цій анкеті студентам пропонується оцінити деякі події та їх ставлення до цих подій.</li>
  <li>Середовище навчання з елементами конструктивізму (COLLES - Constructivist On-Line Learning Environment Survey). Ця анкета складається з 24 питань про курс, причому студенти можуть висловити своє уявлення та реальне положення про курс при дистанційній методиці вивчення.</li>
</ul>
<p>Ці анкети містять заздалегідь задані питання, які не редагуються. Викладачі, які хочуть створити свої анкети можуть використовувати елемент курсу <b>Анкета</b> (Анкетне опитування) або <b>Зворотній зв’язок</b>.</p>';
$string['modulename_link'] = 'mod/survey/view';
$string['modulenameplural'] = 'Анкети';
$string['name'] = 'Ім\'я';
$string['newsurveyresponses'] = 'Нові заповнені анкети';
$string['nobodyyet'] = 'Ніхто не заповнив цю анкету';
$string['notdone'] = 'Поки не заповнена';
$string['notes'] = 'Ваш особистий аналіз і нотатки';
$string['notyetanswered'] = 'Ще без відповідей';
$string['othercomments'] = 'Чи є у Вас ще коментарі?';
$string['page-mod-survey-x'] = 'Будь-яка сторінка модуля Анкети';
$string['peoplecompleted'] = '{$a} людей уже заповнили цю анкету';
$string['pluginadministration'] = 'Керування анкетою';
$string['pluginname'] = 'Анкета';
$string['preferred'] = 'Бажаний';
$string['preferredclass'] = 'Бажаний клас';
$string['preferredstudent'] = '{$a} бажаний';
$string['privacy:metadata:analysis'] = 'Запис аналізу відповідей на опитування.';
$string['privacy:metadata:analysis:notes'] = 'Нотатки, збережені проти відповідей користувача.';
$string['privacy:metadata:analysis:userid'] = 'Ідентифікатор користувача, який відповідає на опитування.';
$string['privacy:metadata:answers'] = 'Збірка відповідей на опитування.';
$string['privacy:metadata:answers:answer1'] = 'Поле для зберігання відповіді на запитання.';
$string['privacy:metadata:answers:answer2'] = 'Додаткове поле для збереження відповіді на запитання.';
$string['privacy:metadata:answers:question'] = 'Питання.';
$string['privacy:metadata:answers:time'] = 'Час, коли була опублікована відповідь.';
$string['privacy:metadata:answers:userid'] = 'Ідентифікатор користувача, який надіслав свою відповідь.';
$string['question'] = 'Питання';
$string['questions'] = 'Питання';
$string['questionsnotanswered'] = 'На деякі питання не було отримано відповідей';
$string['report'] = 'Звіт по анкеті';
$string['responsereports'] = 'Звіти відповідей';
$string['responses'] = 'Відповіді';
$string['savednotes'] = 'Ваші нотатки були збережені';
$string['scaleagree5'] = 'Зовсім ні, Частково згодний, Не знаю, У чомусь згодний, Цілком згодний';
$string['scales'] = 'Шкала';
$string['scaletimes5'] = 'Майже ніколи, Рідко, Іноді, Часто, Майже завжди';
$string['search:activity'] = 'Анкета - інформація про діяльність';
$string['seemoredetail'] = 'Деталі...';
$string['selectedquestions'] = 'Обрані питання в масштабі, Всі студенти';
$string['summary'] = 'Висновок';
$string['survey:addinstance'] = 'Додати нову анкету';
$string['survey:download'] = 'Завантажувати відповіді';
$string['survey:participate'] = 'Проходити анкетування';
$string['survey:readresponses'] = 'Переглядати відповіді';
$string['surveycompleted'] = 'Ви заповнили цю анкету. Графік показує Ваші результати у порівнянні із середніми даними групи';
$string['surveycompletednograph'] = 'Ви завершили цю анкету.';
$string['surveygraph'] = 'Графік';
$string['surveyname'] = 'Назва';
$string['surveysaved'] = 'Збережено';
$string['surveytype'] = 'Тип';
$string['surveytype_help'] = 'Є 3 основні типи анкетування:

* Ставлення до стилю мислення та навчання (ATTLS) - Для вимірювання ступеня, в якому людина \'об’єднуючий знавець\' (як правило, знаходить навчання приємнішим в колективі та більше розвиває чужі думки ніж свої) або ’самодостатній знавець’ (прагне зайняти критичну позицію та навчатися сперечаючись)
* Критичні інциденти
* Конструктивізм  навчального онлайн середовища (COLLES) - Для контролю ступеня, в якому інтерактивні потужності веб-середовища можуть бути використані для залучення студентів до динамічного навчання.';
$string['surveytype_link'] = 'mod/survey/mod';
$string['thanksforanswers'] = 'Дякуємо, що заповнили анкету, {$a}';
$string['time'] = 'Час';
$string['viewsurveyresponses'] = 'Переглянути {$a} заповнених анкет';
