<?php
$string['matchwiris'] = 'Αντιστοίχιση - επιστήμη';
$string['matchwiris_help'] = 'Παρόμοια με την τυπική αντιστοίχιση, αλλά μπορείτε να δώσετε διαφορετικό κείμενο ερώτησης και επιλογές, εισάγοντας τυχαίους αριθμούς, τύπους ή σχεδιαγράμματα. Στα σχόλια μπορούν επίσης να χρησιμοποιούνται οι τυχαίες τιμές.';
$string['editingmatchwiris'] = 'Επεξεργασία ερώτησης τύπου αντιστοίχισης για μαθηματικά και επιστήμη από τη WIRIS';
$string['addingmatchwiris'] = 'Προσθήκη ερώτησης τύπου αντιστοίχισης για μαθηματικά και επιστήμη από τη WIRIS';
$string['matchwirissummary'] = 'Παρόμοια με την τυπική αντιστοίχιση, αλλά μπορείτε να δώσετε διαφορετικό κείμενο ερώτησης και επιλογές, εισάγοντας τυχαίους αριθμούς, τύπους ή σχεδιαγράμματα. Στα σχόλια μπορούν επίσης να χρησιμοποιούνται οι τυχαίες τιμές.';
$string['matchwiris_algorithm'] = 'Αλγόριθμος';
$string['matchwiris_wiris_variables'] = 'Μεταβλητές WIRIS ';

//From Moodle 2.3
$string['pluginname'] = 'Αντιστοίχιση - επιστήμη';
$string['pluginname_help'] = 'Παρόμοια με την τυπική αντιστοίχιση, αλλά μπορείτε να δώσετε διαφορετικό κείμενο ερώτησης και επιλογές, εισάγοντας τυχαίους αριθμούς, τύπους ή σχεδιαγράμματα. Στα σχόλια μπορούν επίσης να χρησιμοποιούνται οι τυχαίες τιμές.';
$string['pluginnamesummary'] = 'Παρόμοια με την τυπική αντιστοίχιση, αλλά μπορείτε να δώσετε διαφορετικό κείμενο ερώτησης και επιλογές, εισάγοντας τυχαίους αριθμούς, τύπους ή σχεδιαγράμματα. Στα σχόλια μπορούν επίσης να χρησιμοποιούνται οι τυχαίες τιμές.';
$string['pluginnameadding'] = 'Προσθήκη ερώτησης τύπου αντιστοίχισης για μαθηματικά και επιστήμη από τη WIRIS';
$string['pluginnameediting'] = 'Επεξεργασία ερώτησης τύπου αντιστοίχισης για μαθηματικά και επιστήμη από τη WIRIS';
?>