<?php
$string['truefalsewiris'] = 'Αληθές/Ψευδές - επιστήμη';
$string['truefalsewiris_help'] = 'Παρόμοια με την τυπική ερώτηση τύπου αληθές/ψευδές, αλλά μπορείτε να δώσετε διαφορετικό κείμενο ερώτησης, εισάγοντας τυχαίους αριθμούς, τύπους ή σχεδιαγράμματα. Μπορείτε να ορίσετε δυναμικά το εάν η σωστή απάντηση θα είναι αληθές ή ψευδές. Στα σχόλια μπορούν επίσης να χρησιμοποιούνται οι τυχαίες τιμές.';
$string['editingtruefalsewiris'] = 'Επεξεργασία ερώτησης τύπου αληθές/ψευδές για μαθηματικά και επιστήμη από τη WIRIS';
$string['addingtruefalsewiris'] = 'Προσθήκη ερώτησης τύπου αληθές/ψευδές για μαθηματικά και επιστήμη από τη WIRIS';
$string['truefalsewirissummary'] = 'Παρόμοια με την τυπική ερώτηση τύπου αληθές/ψευδές, αλλά μπορείτε να δώσετε διαφορετικό κείμενο ερώτησης, εισάγοντας τυχαίους αριθμούς, τύπους ή σχεδιαγράμματα. Μπορείτε να ορίσετε δυναμικά το εάν η σωστή απάντηση θα είναι αληθές ή ψευδές. Στα σχόλια μπορούν επίσης να χρησιμοποιούνται οι τυχαίες τιμές.';
$string['truefalsewirisoverrideanswer_identifier_help'] = 'Εάν ορίζεται, η τιμή αυτή θα αντικαθιστά τη σωστή απάντηση στο πεδίο παρακάτω. Στην καρτέλα «Μεταβλητές», γράψτε έναν αλγόριθμο για τον ορισμό της μεταβλητής αυτής ως «αληθές» ή «ψευδές».';
$string['truefalsewirisoverrideanswer'] = '';
$string['truefalsewirisoverrideanswer_identifier'] = 'Μεταβλητή σωστής απάντησης';;
$string['truefalsewiris_algorithm'] = 'Αλγόριθμος';
$string['truefalsewiris_correct_answer_variable'] = 'Μεταβλητή σωστής απάντησης';
$string['truefalsewiris_feedback_wrong_response'] = 'Σχόλια για τη λάθος απάντηση';
$string['truefalsewiris_feedback_right_response'] = 'Σχόλια για τη σωστή απάντηση';
$string['truefalsewiris_wiris_variables'] = 'Μεταβλητές WIRIS ';

//From Moodle 2.3
$string['pluginname'] = 'Αληθές/Ψευδές - επιστήμη';
$string['pluginname_help'] = 'Παρόμοια με την τυπική ερώτηση τύπου αληθές/ψευδές, αλλά μπορείτε να δώσετε διαφορετικό κείμενο ερώτησης, εισάγοντας τυχαίους αριθμούς, τύπους ή σχεδιαγράμματα. Μπορείτε να ορίσετε δυναμικά το εάν η σωστή απάντηση θα είναι αληθές ή ψευδές. Στα σχόλια μπορούν επίσης να χρησιμοποιούνται οι τυχαίες τιμές.';
$string['pluginnamesummary'] = 'Παρόμοια με την τυπική ερώτηση τύπου αληθές/ψευδές, αλλά μπορείτε να δώσετε διαφορετικό κείμενο ερώτησης, εισάγοντας τυχαίους αριθμούς, τύπους ή σχεδιαγράμματα. Μπορείτε να ορίσετε δυναμικά το εάν η σωστή απάντηση θα είναι αληθές ή ψευδές. Στα σχόλια μπορούν επίσης να χρησιμοποιούνται οι τυχαίες τιμές.';
$string['pluginnameediting'] = 'Επεξεργασία ερώτησης τύπου αληθές/ψευδές για μαθηματικά και επιστήμη από τη WIRIS';
$string['pluginnameadding'] = 'Προσθήκη ερώτησης τύπου αληθές/ψευδές για μαθηματικά και επιστήμη από τη WIRIS';
?>