<?php
// This file is part of Moodle - http://moodle.org/
//
// Moodle is free software: you can redistribute it and/or modify
// it under the terms of the GNU General Public License as published by
// the Free Software Foundation, either version 3 of the License, or
// (at your option) any later version.
//
// Moodle is distributed in the hope that it will be useful,
// but WITHOUT ANY WARRANTY; without even the implied warranty of
// MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
// GNU General Public License for more details.
//
// You should have received a copy of the GNU General Public License
// along with Moodle.  If not, see <http://www.gnu.org/licenses/>.

$string['truefalsewiris'] = 'Αληθές/Ψευδές - επιστήμη';
$string['truefalsewiris_help'] = 'Πα�?όμοια με την τυπική ε�?ώτηση τ�?που αληθές/ψευδές, αλλά μπο�?είτε να δώσετε διαφο�?ετικό κείμενο ε�?ώτησης, εισάγοντας τυχαίους α�?ιθμο�?ς, τ�?πους ή σχεδιαγ�?άμματα. Μπο�?είτε να ο�?ίσετε δυναμικά το εάν η σωστή απάντηση θα είναι αληθές ή ψευδές. Στα σχόλια μπο�?ο�?ν επίσης να χ�?ησιμοποιο�?νται οι τυχαίες τιμές.';
$string['editingtruefalsewiris'] = 'Επεξε�?γασία ε�?ώτησης τ�?που αληθές/ψευδές για μαθηματικά και επιστήμη από τη WIRIS';
$string['addingtruefalsewiris'] = 'Π�?οσθήκη ε�?ώτησης τ�?που αληθές/ψευδές για μαθηματικά και επιστήμη από τη WIRIS';
$string['truefalsewirissummary'] = 'Πα�?όμοια με την τυπική ε�?ώτηση τ�?που αληθές/ψευδές, αλλά μπο�?είτε να δώσετε διαφο�?ετικό κείμενο ε�?ώτησης, εισάγοντας τυχαίους α�?ιθμο�?ς, τ�?πους ή σχεδιαγ�?άμματα. Μπο�?είτε να ο�?ίσετε δυναμικά το εάν η σωστή απάντηση θα είναι αληθές ή ψευδές. Στα σχόλια μπο�?ο�?ν επίσης να χ�?ησιμοποιο�?νται οι τυχαίες τιμές.';
$string['truefalsewirisoverrideanswer_identifier_help'] = 'Εάν ο�?ίζεται, η τιμή αυτή θα αντικαθιστά τη σωστή απάντηση στο πεδίο πα�?ακάτω. Στην κα�?τέλα «Μεταβλητές», γ�?άψτε έναν αλγό�?ιθμο για τον ο�?ισμό της μεταβλητής αυτής ως «αληθές» ή «ψευδές».';
$string['truefalsewirisoverrideanswer'] = '';
$string['truefalsewirisoverrideanswer_identifier'] = 'Μεταβλητή σωστής απάντησης';;
$string['truefalsewiris_algorithm'] = 'Αλγό�?ιθμος';
$string['truefalsewiris_correct_answer_variable'] = 'Μεταβλητή σωστής απάντησης';
$string['truefalsewiris_feedback_wrong_response'] = 'Σχόλια για τη λάθος απάντηση';
$string['truefalsewiris_feedback_right_response'] = 'Σχόλια για τη σωστή απάντηση';
$string['truefalsewiris_wiris_variables'] = 'Μεταβλητές WIRIS ';

// From Moodle 2.3.
$string['pluginname'] = 'Αληθές/Ψευδές - επιστήμη';
$string['pluginname_help'] = 'Πα�?όμοια με την τυπική ε�?ώτηση τ�?που αληθές/ψευδές, αλλά μπο�?είτε να δώσετε διαφο�?ετικό κείμενο ε�?ώτησης, εισάγοντας τυχαίους α�?ιθμο�?ς, τ�?πους ή σχεδιαγ�?άμματα. Μπο�?είτε να ο�?ίσετε δυναμικά το εάν η σωστή απάντηση θα είναι αληθές ή ψευδές. Στα σχόλια μπο�?ο�?ν επίσης να χ�?ησιμοποιο�?νται οι τυχαίες τιμές.';
$string['pluginnamesummary'] = 'Πα�?όμοια με την τυπική ε�?ώτηση τ�?που αληθές/ψευδές, αλλά μπο�?είτε να δώσετε διαφο�?ετικό κείμενο ε�?ώτησης, εισάγοντας τυχαίους α�?ιθμο�?ς, τ�?πους ή σχεδιαγ�?άμματα. Μπο�?είτε να ο�?ίσετε δυναμικά το εάν η σωστή απάντηση θα είναι αληθές ή ψευδές. Στα σχόλια μπο�?ο�?ν επίσης να χ�?ησιμοποιο�?νται οι τυχαίες τιμές.';
$string['pluginnameediting'] = 'Επεξε�?γασία ε�?ώτησης τ�?που αληθές/ψευδές για μαθηματικά και επιστήμη από τη WIRIS';
$string['pluginnameadding'] = 'Π�?οσθήκη ε�?ώτησης τ�?που αληθές/ψευδές για μαθηματικά και επιστήμη από τη WIRIS';
