<?php
// This file is part of Moodle - https://moodle.org/
//
// Moodle is free software: you can redistribute it and/or modify
// it under the terms of the GNU General Public License as published by
// the Free Software Foundation, either version 3 of the License, or
// (at your option) any later version.
//
// Moodle is distributed in the hope that it will be useful,
// but WITHOUT ANY WARRANTY; without even the implied warranty of
// MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
// GNU General Public License for more details.
//
// You should have received a copy of the GNU General Public License
// along with Moodle.  If not, see <https://www.gnu.org/licenses/>.

/**
 * Strings for component 'survey', language 'ru', version '4.4'.
 *
 * @package     survey
 * @category    string
 * @copyright   1999 Martin Dougiamas and contributors
 * @license     https://www.gnu.org/copyleft/gpl.html GNU GPL v3 or later
 */

defined('MOODLE_INTERNAL') || die();

$string['actual'] = 'Фактический';
$string['actualclass'] = 'Фактический класс';
$string['actualstudent'] = '{$a} фактический';
$string['allquestionrequireanswer'] = 'Все вопросы обязательные и на них должны быть ответы';
$string['allscales'] = 'Все шкалы, все студенты';
$string['alreadysubmitted'] = 'Ваш ответ на анкету уже существует';
$string['analysisof'] = 'Анализы {$a}';
$string['answers'] = 'Ответы';
$string['attls1'] = 'При оценивании высказывания я фокусируюсь на качестве аргументов, а не на личности человека.';
$string['attls10'] = 'Для меня очень важным является остаться как можно более объективным, когда я что-то анализирую';
$string['attls10short'] = 'Оставаться объективным';
$string['attls11'] = 'Я стараюсь учитывать мнение человека, вместо того, чтобы опровергать его.';
$string['attls11short'] = 'Доказать мнение человека';
$string['attls12'] = 'Я использую определенные критерии при оценке аргументов';
$string['attls12short'] = 'Использовать критерии';
$string['attls13'] = 'Я скорее попытаюсь понять мнение человека, чем попытаюсь его оценить';
$string['attls13short'] = 'Попытаться понять человека';
$string['attls14'] = 'Я пытаюсь показать людям слабые места в их размышлениях, чтобы  помочь им уточнить аргументы';
$string['attls14short'] = 'Показывать слабые места аргументов';
$string['attls15'] = 'При обсуждении спорных вопросов я склонен ставить себя на место других людей, чтобы понять, почему они думают именно так.';
$string['attls15short'] = 'Представить себя на месте оппонента';
$string['attls16'] = 'При анализе я тщательно учитываю даже незначительные детали';
$string['attls16short'] = 'Тщательный анализ';
$string['attls17'] = 'Обсуждая проблему, я ценю логику выше моих предрассудков';
$string['attls17short'] = 'Я больше ценю логику';
$string['attls18'] = 'Я могу из-за сочувствия принять мнения, которые отличаются от моих.';
$string['attls18short'] = 'Понимать через сочувствие';
$string['attls19'] = 'Когда я встречаю человека, чье мнение кажется мне чуждым, я делаю сознательное усилие «расширить» себя до этой личности, пытаясь понять, почему он имеет такое мнение.';
$string['attls19short'] = 'Делаю усилие для расширения кругозора';
$string['attls1short'] = 'Фокусироваться на качестве аргументов';
$string['attls2'] = 'Мне нравится изображать «Адвоката дьявола» – отстаивать противоположную точку зрения';
$string['attls20'] = 'Я провожу время в попытках понять, что не так. Например, при недостатках аргументов я буду искать примеры в литературе.';
$string['attls20short'] = 'Узнавать, что не правильно';
$string['attls2short'] = 'Играть в ‘Адвоката дьявола’';
$string['attls3'] = 'Я стараюсь понять, откуда этот человек, какой приобретенный опыт заставляет его так думать';
$string['attls3short'] = 'понять, откуда человек';
$string['attls4'] = 'Наиболее важной частью моего образования было научиться понимать людей, которые в значительной степени отличаются от меня';
$string['attls4short'] = 'Понять людей';
$string['attls5'] = 'Я думаю, что лучший способ составить свою точку зрения – общаться с большим количеством разных людей';
$string['attls5short'] = 'общаться с разными людьми';
$string['attls6'] = 'Мне нравится слышать мнения людей, которые пришли из другой среды - это помогает мне понять, как можно по-разному взглянуть на одну и ту же вещь';
$string['attls6short'] = 'Нравится слышать мнения';
$string['attls7'] = 'Я считаю, что могу усилить свою позицию через споры с людьми, не согласными со мной';
$string['attls7short'] = 'Усиливаю позицию в спорах';
$string['attls8'] = 'Мне всегда интересно знать, почему люди говорят о том, что делают и верят в это.';
$string['attls8short'] = 'Узнать почему';
$string['attls9'] = 'Я часто замечаю за собой, что спорю с авторами книг, которые читаю, пытаясь логически понять, где они ошибаются.';
$string['attls9short'] = 'Спорить с авторами';
$string['attlsintro'] = 'Цель этой анкеты – помочь нам оценить Ваше отношение к обучению.<br />В анкете нет верных и не верных ответов, нас интересует только Ваше мнение. Полученные результаты будут обработаны с полной конфиденциальностью, и их содержание никак не отразится на Ваших оценках';
$string['attlsm1'] = 'Отношение к стилю мышления и обучения';
$string['attlsm2'] = 'Связанное обучение';
$string['attlsm3'] = 'Раздельное обучение';
$string['attlsmintro'] = 'При обсуждении…';
$string['attlsname'] = 'ATTLS (20 вопросная версия)';
$string['cannotfindanswer'] = 'Еще нет ответов на эту анкету.';
$string['cannotfindquestion'] = 'Вопрос не существует';
$string['cannotfindsurveytmpt'] = 'Шаблоны анкет не найдены!';
$string['ciq1'] = 'В какой момент Вы были больше всего заняты изучением?';
$string['ciq1short'] = 'Наибольший интерес к изучению';
$string['ciq2'] = 'В какой момент Вы были больше всего отдалены от изучения?';
$string['ciq2short'] = 'Наибольшее отдаление от изучения';
$string['ciq3'] = 'Какое действие от кого-нибудь в форумах Вы находите наиболее полезным?';
$string['ciq3short'] = 'Наиболее полезный момент';
$string['ciq4'] = 'Какое действие от кого-нибудь в форумах Вы находите наиболее запутывающим и конфузящим?';
$string['ciq4short'] = 'Самый запутанный момент';
$string['ciq5'] = 'Какие события произвели на вас наибольшее впечатление';
$string['ciq5short'] = 'Наиболее впечатляющий момент';
$string['ciqintro'] = 'Вспоминая о недавних событиях в классе, ответьте на следующие вопросы.';
$string['ciqname'] = 'Критические инциденты';
$string['clicktocontinuecheck'] = 'Проверить и продолжить…';
$string['colles1'] = 'Мое обучение фокусируется на темах, которые меня интересуют';
$string['colles10'] = 'Я прошу других студентов объяснить свои мысли';
$string['colles10short'] = 'Прошу объяснить';
$string['colles11'] = 'Другие студенты просят меня объяснить мои мысли';
$string['colles11short'] = 'Меня просят объяснить';
$string['colles12'] = 'Другие студенты разделяют мои взгляды';
$string['colles12short'] = 'Студенты поддерживают меня';
$string['colles13'] = 'Преподаватели стимулируют мое мышление';
$string['colles13short'] = 'Преподаватели стимулируют мышление';
$string['colles14'] = 'Преподаватели вдохновляют меня практически применить знания';
$string['colles14short'] = 'Преподаватели вдохновляют меня';
$string['colles15'] = 'Преподаватель моделирует хорошие темы для обсуждений';
$string['colles15short'] = 'Моделирует хорошие обсуждения';
$string['colles16'] = 'Преподаватель моделирует критическое само-отражение.';
$string['colles16short'] = 'Преподаватель моделирует само-отражение.';
$string['colles17'] = 'Другие студенты вдохновляют меня на участие';
$string['colles17short'] = 'Студенты вдохновляют меня';
$string['colles18'] = 'Другие студенты высоко ценят мой вклад';
$string['colles18short'] = 'Студенты меня высоко ценят';
$string['colles19'] = 'Другие студенты ценят мой вклад';
$string['colles19short'] = 'Студенты ценят меня';
$string['colles1short'] = 'Фокусироваться на интересных темах';
$string['colles2'] = 'Я изучаю то, что мне пригодится в профессиональной практике';
$string['colles20'] = 'Другие студенты с пониманием относятся к моей борьбе за знания';
$string['colles20short'] = 'Студенты понимают меня';
$string['colles21'] = 'Я считаю сообщения других студентов - наделенными здравым смыслом.';
$string['colles21short'] = 'Я понимаю других студентов';
$string['colles22'] = 'Другие студенты считают мои сообщения - наделенными здравым смыслом.';
$string['colles22short'] = 'Студенты понимают меня';
$string['colles23'] = 'Я считаю сообщения преподавателей - наделенными здравым смыслом.';
$string['colles23short'] = 'Я понимаю преподавателей';
$string['colles24'] = 'Преподаватели считают мои сообщения - наделенными здравым смыслом.';
$string['colles24short'] = 'Преподаватели понимают меня';
$string['colles2short'] = 'Необходимость для практики';
$string['colles3'] = 'Я изучаю то, что может усовершенствовать мои профессиональные навыки';
$string['colles3short'] = 'Усовершенствование навыков';
$string['colles4'] = 'То, что я изучаю тесно связано с моей профессиональной практикой';
$string['colles4short'] = 'Связано с практикой';
$string['colles5'] = 'Я с критикой отношусь к процессу своего обучения';
$string['colles5short'] = 'Критический подход к обучению';
$string['colles6'] = 'Я с критикой отношусь к своим собственным взглядам';
$string['colles6short'] = 'Критический подход к своим взглядам';
$string['colles7'] = 'Я отношусь критически к взглядам других студентов';
$string['colles7short'] = 'Критический подход к чужим взглядам';
$string['colles8'] = 'Я с критикой отношусь к прочитанным мыслям';
$string['colles8short'] = 'Читать с критикой';
$string['colles9'] = 'Я объясняю свои идеи другим студентам';
$string['colles9short'] = 'Объяснять свои идеи';
$string['collesaintro'] = 'Цель этого анкетирования состоит в том, чтобы помочь нам понять, как хорошо дистанционное обучение дало возможность Вам учиться. Каждая  из 24 инструкций ниже спрашивает о вашем личном опыте. Здесь нет  \'правильных\' или \'неправильных\' ответов: мы интересуемся только Вашим мнением. Будьте уверены, что ваши ответы будет обработан с высокой степенью конфиденциальности, и никак не отразятся на Ваших оценках. Ваши ответы помогут нам улучшить качество дистанционного обучения в будущем. Заранее благодарим.';
$string['collesaname'] = 'COLLES (Фактически)';
$string['collesapintro'] = 'Цель этого анкетирования состоит в том, чтобы помочь нам понять, насколько хорошо дистанционное обучение позволило Вам учиться.

Каждое из этих 24 утверждений предполагает, что Вы сравните свои <b>предпочтения</b> (идеал) и <b>фактическое впечатление</b> по этому вопросу.

Здесь нет «верных», или «неверных» ответов: мы интересуемся только Вашим мнением. Будьте уверены, что Ваши ответы будет рассматриваться с высокой степенью конфиденциальности, и не будут затрагивать Вашу оценку.

Ваши ответы помогут нам улучшить качество дистанционного обучения в будущем.

Заранее благодарим.';
$string['collesapname'] = 'COLLES (Предпочтения и Фактически)';
$string['collesm1'] = 'Релевантность';
$string['collesm1short'] = 'Релевантность';
$string['collesm2'] = 'Рефлективное мышление';
$string['collesm2short'] = 'Рефлективное мышление';
$string['collesm3'] = 'Интерактивность';
$string['collesm3short'] = 'Интерактивность';
$string['collesm4'] = 'Поддержка преподавателя';
$string['collesm4short'] = 'Поддержка преподавателя';
$string['collesm5'] = 'Поддержка сокурсников';
$string['collesm5short'] = 'Поддержка сокурсников';
$string['collesm6'] = 'Интерпретация';
$string['collesm6short'] = 'Интерпретация';
$string['collesmintro'] = 'В этом разделе...';
$string['collespintro'] = 'Цель этого анкетирования состоит в том, чтобы помочь нам понять, насколько хорошо дистанционное обучение позволило Вам учиться.

Каждое из этих 24 утверждений предполагает, что Вы сравните свои <b>предпочтения</b> (идеал) и <b>фактическое впечатление</b> по этому вопросу.

Здесь нет «верных», или «неверных» ответов: мы интересуемся только Вашим мнением. Будьте уверены, что Ваши ответы будет рассматриваться с высокой степенью конфиденциальности, и не будут затрагивать Вашу оценку.

Ваши ответы помогут нам улучшить качество дистанционного обучения в будущем.

Заранее благодарим.';
$string['collespname'] = 'COLLES (Предпочтения)';
$string['completiondetail:submit'] = 'Отправлять ответы';
$string['completionsubmit'] = 'Отправлен ответ';
$string['customintro'] = 'Описание';
$string['deleteallanswers'] = 'Удалить все ответы на опрос';
$string['deleteanalysis'] = 'Удалить анализ ответов';
$string['done'] = 'Завершено';
$string['download'] = 'Скачать';
$string['downloadexcel'] = 'Скачать результаты в формате Excel';
$string['downloadinfo'] = 'Вы можете скачать данные анкетирования в удобной для анализа форме: Excel, SPSS и т.д.';
$string['downloadresults'] = 'Скачать результаты';
$string['downloadtext'] = 'Скачать результаты в текстовом формате';
$string['editingasurvey'] = 'Редактирование анкеты';
$string['errorunabletosavenotes'] = 'При сохранении заметок произошла ошибка.';
$string['eventreportdownloaded'] = 'Скачан отчет по анкете';
$string['eventreportviewed'] = 'Показан отчет по анкете';
$string['eventresponsesubmitted'] = 'Ответ на анкету отправлен';
$string['guestsnotallowed'] = 'Только записанные в курс пользователи могут отвечать на анкету';
$string['howlong'] = 'Как долго Вы заполняли анкету?';
$string['howlongoptions'] = 'менее 1 мин, 1-2 мин, 2-3 мин, 3-4 мин, 4-5- мин, 5-10 мин, более 10 мин';
$string['ifoundthat'] = 'На самом деле';
$string['indicator:cognitivedepth'] = 'Анкета: познавательный аспект';
$string['indicator:cognitivedepth_help'] = 'Этот показатель основан на глубине познания, достигнутой студентом при работе с элементом курса «Анкета».';
$string['indicator:cognitivedepthdef'] = 'Анкета: познавательный аспект';
$string['indicator:cognitivedepthdef_help'] = 'Участник достиг этого процента познавательного взаимодействия, предлагаемого элементом курса «Анкета» в течение этого интервала анализа (Уровни = Нет просмотра, Просмотр, Отправка)';
$string['indicator:cognitivedepthdef_link'] = 'Learning_analytics_indicators#Cognitive_depth';
$string['indicator:socialbreadth'] = 'Анкета: социальный аспект';
$string['indicator:socialbreadth_help'] = 'Этот показатель основан на широте общения, которая может быть достигнута студентом при работе с элементом Анкета.';
$string['indicator:socialbreadthdef'] = 'Анкета: социальный аспект';
$string['indicator:socialbreadthdef_help'] = 'Участник достиг этого процента социальной активности, предлагаемой элементами Анкета в течение этого интервала анализа (Уровни = нет участия, единственный участник)';
$string['indicator:socialbreadthdef_link'] = 'Learning_analytics_indicators#Social_breadth';
$string['introtext'] = 'Вступительный текст';
$string['invalidsurveyid'] = 'ID анкеты некорректен';
$string['invalidtmptid'] = 'Неверный ID шаблона';
$string['ipreferthat'] = 'Мои ожидания';
$string['modulename'] = 'Анкета';
$string['modulename_help'] = 'Модуль Анкета обеспечивает три типа анкет для оценивания и стимулирования обучения в дистанционных курсах. Преподаватель может использовать их для сбора данных, которые помогут ему лучше узнать своих студентов и поразмышлять об эффективности обучения.

Отметим, что эти анкеты содержат предварительно заданные вопросы, которые не редактируются. Преподаватели, которые хотят создать свои анкеты, могут использовать элемент курса «Обратная связь».';
$string['modulename_link'] = 'mod/survey/view';
$string['modulenameplural'] = 'Анкеты';
$string['name'] = 'Имя';
$string['newsurveyresponses'] = 'Новые заполненные анкеты';
$string['nobodyyet'] = 'Никто не заполнил эту анкету';
$string['notdone'] = 'Пока не заполнена';
$string['notes'] = 'Ваши анализы и заметки';
$string['notyetanswered'] = 'Пока нет ответа';
$string['othercomments'] = 'Есть ли у Вас еще комментарии?';
$string['page-mod-survey-x'] = 'Страница любого модуля «Анкета»';
$string['peoplecompleted'] = '{$a} уже заполнил эту анкету';
$string['pluginadministration'] = 'Управление анкетой';
$string['pluginname'] = 'Анкета';
$string['preferred'] = 'Более предпочтителен';
$string['preferredclass'] = 'Класс предпочел';
$string['preferredstudent'] = '{$a} более предпочтителен';
$string['privacy:metadata:analysis'] = 'Запись об анализе ответов на опрос.';
$string['privacy:metadata:analysis:notes'] = 'Заметки сохраняются рядом с ответами пользователя.';
$string['privacy:metadata:analysis:userid'] = 'ID пользователя, отвечающего на анкету.';
$string['privacy:metadata:answers'] = 'Сборник ответов на опросы.';
$string['privacy:metadata:answers:answer1'] = 'Поле для хранения ответа на вопрос.';
$string['privacy:metadata:answers:answer2'] = 'Дополнительное поле для хранения ответа на вопрос.';
$string['privacy:metadata:answers:question'] = 'Вопрос.';
$string['privacy:metadata:answers:time'] = 'Время, когда был опубликован ответ.';
$string['privacy:metadata:answers:userid'] = 'ID пользователя, отправившего свой ответ.';
$string['question'] = 'Вопрос';
$string['questions'] = 'Вопросы';
$string['questionsnotanswered'] = 'На некоторые вопросы, не было получено ответов';
$string['report'] = 'Отчет по анкете';
$string['responsereports'] = 'Отчеты об ответах';
$string['responses'] = 'Ответы';
$string['savednotes'] = 'Ваши заметки сохранены';
$string['scaleagree5'] = 'Абсолютно нет, Немного не согласен, Не знаю, В чем-то согласен, Абсолютно согласен';
$string['scales'] = 'Шкалы';
$string['scaletimes5'] = 'Почти никогда, Редко, Иногда, Часто, Почти всегда';
$string['search:activity'] = 'Анкета — информация об элементе курса';
$string['seemoredetail'] = 'Детали…';
$string['selectedquestions'] = 'Выбранные вопросы в масштабе, Все студенты';
$string['summary'] = 'Вывод';
$string['survey:addinstance'] = 'Добавлять новую анкету';
$string['survey:download'] = 'Скачивать результаты';
$string['survey:participate'] = 'Отвечать на анкету';
$string['survey:readresponses'] = 'Просматривать ответы';
$string['surveycompleted'] = 'Вы заполнили эту анкету. График показывает Ваши результаты по отношению к усредненным данным других';
$string['surveycompletednograph'] = 'Вы уже ответили на эту анкету.';
$string['surveygraph'] = 'График анкеты';
$string['surveyname'] = 'Название';
$string['surveysaved'] = 'Сохранено';
$string['surveytype'] = 'Тип';
$string['surveytype_help'] = 'Доступны 3 типа анкет:

* ATTLS (Attitudes to Thinking and Learning Survey - Отношение к мышлению и обучению). Для определения степени, до которой человек является «коммуникабельным» (зачастую учатся с удовольствием, способны к более тесному сотрудничеству и более охотно принимают и развивают идеи других) или «обособленным» (склонны занимать более критическую и спорную позицию в обучении),
* Критические инциденты
* COLLES (Constructivist On-line Learning Environment Survey - Конструктивистская интерактивная среда обучения) Для определения степени, до которой интерактивные способности Интернет могут применяться для вовлечения студентов в динамичные методы обучения.';
$string['surveytype_link'] = 'mod/survey/mod';
$string['thanksforanswers'] = 'Спасибо, что заполнили анкету, {$a}';
$string['time'] = 'Время';
