<?php
// This file is part of Moodle - https://moodle.org/
//
// Moodle is free software: you can redistribute it and/or modify
// it under the terms of the GNU General Public License as published by
// the Free Software Foundation, either version 3 of the License, or
// (at your option) any later version.
//
// Moodle is distributed in the hope that it will be useful,
// but WITHOUT ANY WARRANTY; without even the implied warranty of
// MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
// GNU General Public License for more details.
//
// You should have received a copy of the GNU General Public License
// along with Moodle.  If not, see <https://www.gnu.org/licenses/>.

/**
 * Strings for component 'activequiz', language 'el', version '4.5'.
 *
 * @package     activequiz
 * @category    string
 * @copyright   1999 Martin Dougiamas and contributors
 * @license     https://www.gnu.org/copyleft/gpl.html GNU GPL v3 or later
 */

defined('MOODLE_INTERNAL') || die();

$string['activequiz:addinstance'] = 'Προσθήκη ενός στιγμιοτύπου ενεργού κουίζ (activequiz)';
$string['activequiz:attempt'] = 'Προσπάθεια για ένα ενεργό κουίζ';
$string['activequiz:control'] = 'Έλεγχος ενός ενεργού κουίζ. (Συνήθως μόνο για εκπαιδευτές)';
$string['activequiz:editquestions'] = 'Επεξεργασία ερωτήσεων για ένα ενεργό κουίζ.';
$string['activequiz:seeresponses'] = 'Δείτε άλλες αποκρίσεις μαθητών για να τις βαθμολογήσετε';
$string['activequiz:viewownattempts'] = 'Επιτρέπει στους μαθητές να δουν τις δικές τους προσπάθειες σε ένα κουίζ';
$string['activequizintro'] = 'Εισαγωγή';
$string['activequizsettings'] = 'Γενικές ρυθμίσεις ενεργού κουίζ';
$string['activitygrades'] = 'Βαθμολογίες δραστηριοτήτων:';
$string['addquestion'] = 'Προσθήκη ερώτησης';
$string['addtoquiz'] = 'Προσθήκη';
$string['anonymousresponses'] = 'Ανωνυμοποίηση αποκρίσεων μαθητών';
$string['anonymousresponses_help'] = 'Ανωνυμοποίηση αποκρίσεων μαθητών για την εμφάνιση στον εκπαιδευτή, έτσι ώστε όταν προβάλλεται η οθόνη του, τα ονόματα των μαθητών ή των ομάδων να μην εμφανίζονται';
$string['anonymoususer'] = 'Ανώνυμος χρήστης';
$string['assessed'] = 'Αξιολογήθηκε';
$string['assessed_help'] = 'Τσεκάρετε το κουτί αυτό για να δηλώσετε το κουίζ σας ως αξιολογημένο';
$string['attempt_grade'] = 'Βαθμός προσπάθειας';
$string['attemptno'] = 'Αριθμός προσπάθειας';
$string['attempts'] = 'Προσπάθειες';
$string['attemptstarted'] = 'Έχει ήδη ξεκινήσει μια προσπάθεια από εσάς, παρακαλούμε κάντε κλικ παρακάτω για να συνεχίσετε με την ανοικτή σας προσπάθεια';
$string['attemptstartedalready'] = 'Έχει ήδη ξεκινήσει μια προσπάθεια από ένα από τα μέλη της ομάδας σας';
$string['attemptview'] = 'Εμφάνιση προσπάθειας';
$string['cantaddquestiontwice'] = 'Δεν μπορείτε να προσθέσετε την ίδια ερώτηση πάνω από μία φορά σε ένα κουίζ';
$string['cantinitattempts'] = 'Δεν είναι δυνατή η προετοιμασία προσπαθειών για εσάς';
$string['closesession'] = 'Κλείσιμο συνόδου';
$string['closingsession'] = 'Κλείσιμο συνόδου...';
$string['countdatasetlabel'] = 'Αριθμός απαντήσεων';
$string['defaultquestiontime'] = 'Προεπιλεγμένος χρόνος ερώτησης';
$string['defaultquestiontime_help'] = 'Ο προεπιλεγμένος χρόνος για την εμφάνιση κάθε ερώτησης.<br>
Αυτό μπορεί να παρακαμφθεί από συγκεκριμένες ερωτήσεις.';
$string['edit'] = 'Επεξεργασία κουίζ';
$string['editpage_opensession_error'] = 'Δεν μπορείτε να τροποποιήσετε μια ερώτηση ή διάταξη κουίζ ενόσω μια σύνοδος είναι ανοιχτή.';
$string['enabledquestiontypes'] = 'Ενεργοποίηση τύπων ερωτήσεων';
$string['enabledquestiontypes_info'] = 'Τύποι ερώτησης που έχουν ενεργοποιηθεί για χρήση μέσα σε στιγμιότυπα της δραστηριότητας ενεργού κουίζ.';
$string['endquestion'] = 'Ερώτηση τέλους';
$string['errorregrade'] = 'Λυπούμαστε, παρουσιάστηκε ένα σφάλμα κατά την προσπάθεια επαναβαθμολόγησης όλων των κουίζ';
$string['eventattemptstarted'] = 'Η προσπάθεια ξεκίνησε';
$string['eventattemptviewed'] = 'Η προσπάθεια προβλήθηκε';
$string['eventquestionanswered'] = 'Η ερώτηση απαντήθηκε για την προσπάθεια';
$string['eventquestionmanuallygraded'] = 'Η ερώτηση βαθμολογήθηκε χειροκίνητα';
$string['feedbackintro'] = 'Ανατροφοδότηση για την ερώτησή σας. Παρακαλούμε περιμένετε τον εκπαιδευτή να ξεκινήσει την επόμενη ερώτηση';
$string['firstsession'] = 'Πρώτη σύνοδος';
$string['fullanonymize'] = 'Πλήρης ανωνυμοποίηση αποκρίσεων μαθητών';
$string['fullanonymize_help'] = 'Πλήρης ανωνυμοποίηση αποκρίσεων μαθητών. Σημειώστε ότι αν επιλέξετε αυτήν την επιλογή, οι αποκρίσεις της συνόδου αυτής δεν θα βαθμολογηθούν και δεν θα εφαρμοστούν στους μαθητές.';
$string['gatheringresults'] = 'Συγκέντρωση αποτελεσμάτων...';
$string['gotosession'] = 'Μετάβαση στη σύνοδο σε εξέλιξη';
$string['grademethod'] = 'Μέθοδος βαθμολόγησης συνόδου';
$string['grademethod_help'] = 'Αυτή είναι η μέθοδος που χρησιμοποιείται κατά την βαθμολόγηση. Αυτή η μέθοδος είναι για τον υπολογισμό των βαθμολογιών σε πολλαπλές συνόδους στο ίδιο ενεργό κουίζ';
$string['gradesettings'] = 'Ρυθμίσεις βαθμού';
$string['groupattendance'] = 'Να επιτρέπεται η δήλωση παρουσιών ομάδας';
$string['groupattendance_help'] = 'Αν είναι ενεργοποιημένο αυτό το κουτάκι ελέγχου, ο μαθητής που προσπαθεί το κουίζ μπορεί να επιλέξει ποιοί μαθητές στην ομάδα του, είναι παρόντες.';
$string['grouping'] = 'Ομαδοποίηση';
$string['grouping_help'] = 'Επιλέξτε την ομαδοποίηση που θα θέλατε να χρησιμοποιήσετε για να ομαδοποιήσετε τους μαθητές';
$string['groupmembership'] = 'Μέλη της ομάδας';
$string['groupworksettings'] = 'Ρυθμίσεις της ομάδας';
$string['hide_correct_answer'] = 'Απόκρυψη σωστής απάντησης';
$string['hidenotresponded'] = 'Απόκρυψη όσων δεν απάντησαν';
$string['hidestudentresponses'] = 'Απόκρυψη αποκρίσεων';
$string['highestsessiongrade'] = 'Υψηλότερος βαθμός συνόδου';
$string['indvquestiontime'] = 'Χρόνος ερώτησης';
$string['indvquestiontime_help'] = 'Χρόνος ερώτησης σε δευτερόλεπτα';
$string['instructorquizinst'] = '<p>Παρακαλούμε περιμένετε σε αυτή τη σελίδα μέχρι να συνδεθούν οι μαθητές. Μόλις πατηθεί το <b>Έναρξη κουίζ</b>, το κουίζ θα ξεκινήσει την πρώτη ερώτηση.</p>
    <p>
<p>Πλήκτρα χειρισμού:</p>
    <ul>
        <li>
            Θέστε ξανά την ερώτηση
            <ul>
                <li>
                    Επιτρέπει στον εκπαιδευτή να θέσει ξανά την τρέχουσα ή την προηγούμενη ερώτηση (διατίθεται κατά την εξέταση μιας ερώτησης).</li></ul>
                </li>
            </ul>
        </li>
        <li>
            Επόμενη ερώτηση
            <ul>
                <li>
                    Συνέχεια στην επόμενη ερώτηση (διατίθεται κατά την εξέταση μιας ερώτησης).</li></ul>
                </li>
            </ul>
        </li>
        <li>
            Τελική ερώτηση
            <ul>
                <li>
                    Τερματίστε την τρέχουσα ερώτηση. Επιτρέπει επίσης στον εκπαιδευτή να τερματίσει μια χρονομετρούμενη ερώτηση (διατίθεται ενώ εκτελείται μια ερώτηση). <i>Αν η ερώτηση δεν έχει όριο χρόνου, ο εκπαιδευτής θα χρειαστεί να κάνει κλικ στο πλήκτρο<b>Τερματισμός ερώτησης</b></i>.
                </li>
            </ul>
        </li>
        <li>
            Μετάβαση στην ερώτηση
            <ul>
                <li>
                    Ανοίξτε ένα παράθυρο διαλόγου για να κατευθύνετε όλους τους χρήστες σε μια συγκεκριμένη ερώτηση στο κουίζ (διατίθεται κατά την εξέταση μιας ερώτησης).
                </li>
            </ul>
        </li>
        <li>
            Κλείσιμο συνόδου
            <ul>
                <li>
                    Κλείνει την τρέχουσα σύνοδο, καθώς και όλες τις προσπάθειες των μαθητών. Αυτό θα βαθμολογεί αυτόματα όλες τις προσπάθειες (διαθέσιμο ανά πάσα στιγμή).
                </li>
            </ul>
        </li>
        <li>
            Επαναφόρτωση αποτελεσμάτων
            <ul>
                <li>
                    Επαναφόρτωση των αποκρίσεων των μαθητών στο πλαίσιο πληροφοριών. Επιτρέπει στον εκπαιδευτή να δει πόσοι μαθητές ή ομάδες αποκρίθηκαν ήδη και πόσοι μένουν ακόμη (διατίθεται κατά την εξέταση μιας ερώτησης).
                </li>
            </ul>
        </li>
        <li>
            Απόκρυψη/Εμφάνιση αριθμού μαθητών που δεν αποκρίθηκαν
            <ul>
                <li>
                    Απόκρυψη ή εμφάνιση του πλαισίου πληροφοριών που εμφανίζει τον αριθμό των μαθητών ή ομάδων που έχουν ήδη αποκριθεί και πόσοι μαθητές ή ομάδες δεν έχουν ακόμη αποκριθεί (διατίθεται όταν για την ερώτηση αναμένονται αποκρίσεις).
                </li>
            </ul>
        </li>
        <li>
            Εμφάνιση σωστής απάντησης
            <ul>
                <li>
                    Εμφανίζει στον εκπαιδευτή την ερώτηση με την σωστή απόκριση επιλεγμένη (διατίθεται κατά την εξέταση μιας ερώτησης). Αυτό δεν θα δείξει τη σωστή απόκριση για τύπους ερωτήσεων που βαθμολογούνται χειροκίνητα, όπως εκθέσεις  ή ερωτήσεις σχεδίασης.
                </li>
            </ul>
        </li>
    </ul>
</p>';
$string['instructorsessionsgoing'] = 'Υπάρχει ήδη μια σύνοδος σε εξέλιξη. Παρακαλούμε κάντε κλικ στο παρακάτω πλήκτρο για να μεταβείτε στην σύνοδο';
$string['invalid_indvquestiontime'] = 'Ο χρόνος ερώτησης πρέπει να είναι ένας αριθμός 0 και πάνω';
$string['invalid_numberoftries'] = 'Ο αριθμός προσπαθειών πρέπει να είναι ένας ακέραιος 1 και πάνω';
$string['invalid_points'] = 'Πόντοι απαιτούνται και πρέπει να είναι ένας αριθμός μεγαλύτερος του 0';
$string['invalidattemptaccess'] = 'Δεν έχετε το δικαίωμα να δείτε αυτήν την προσπάθεια';
$string['invalidgroupid'] = 'Απαιτείται ένα έγκυρο αναγνωριστικό ομάδας για μαθητές';
$string['invalidquestionattempt'] = 'Προσπάθεια για προσθήκη μη έγκυρης ερώτησης ($a->questionname) στο κουίζ.';
$string['isanonymous'] = 'Όλες οι αποκρίσεις σε αυτό το ενεργό κουίζ είναι ανώνυμες';
$string['joinquiz'] = 'Συμμετοχή στο κουίζ';
$string['joinquizinstructions'] = 'Κάντε κλικ παρακάτω για συμμετοχή στο κουίζ';
$string['jumptoquesetioninstructions'] = 'Επιλέξτε μια ερώτηση στην οποία θα θέλατε να μεταβείτε:';
$string['jumptoquestion'] = 'Μετάβαση στην ερώτηση';
$string['lastsession'] = 'Τελευταία σύνοδος';
$string['loading'] = 'Επαναρχικοποίηση κουίζ';
$string['manualcomment'] = 'Σχόλιο με το χέρι';
$string['manualcomment_help'] = 'Το σχόλιο που μπορεί να προσθέσει ο εκπαιδευτής κατά τη βαθμολόγηση μιας προσπάθειας';
$string['marks'] = 'Βαθμοί';
$string['marks_help'] = 'Ο αριθμητικός βαθμός για κάθε ερώτηση και το σκορ της συνολικής προσπάθειας';
$string['modulename'] = 'Ενεργό κουίζ';
$string['modulename_help'] = '<p>Η δραστηριότητα ενεργού κουίζ δίνει τη δυνατότητα σε έναν εκπαιδευτή να δημιουργεί και να διαχειρίζεται κουίζ σε πραγματικό χρόνο. Όλοι οι συνηθισμένοι τύποι ερωτημάτων κουίζ μπορούν να χρησιμοποιηθούν στο ενεργό κουίζ.</p>
<p>Το ενεργό κουίζ επιτρέπει ατομικές παρουσίες ή ομαδικές. Η δήλωση παρουσιών σε ομάδες είναι δυνατή, οπότε οι πόντοι που δίνονται κατά τη διάρκεια του ενεργού κουίζ θα εφαρμόζονται μόνο στους συμμετέχοντες που παρακολούθησαν τη σύνοδο. Οι ερωτήσεις μπορούν να ρυθμιστούν ώστε να επιτρέπουν πολλαπλές προσπάθειες. Μπορεί να οριστεί όριο χρόνου για να τερματιστεί αυτόματα η ερώτηση ή ο εκπαιδευτής μπορεί να τερματίσει με χειροκίνητο τρόπο την ερώτηση και να προχωρήσει στην επόμενη. Ο εκπαιδευτής έχει επίσης τη δυνατότητα να μεταπηδήσει σε διαφορετικές ερωτήσεις κατά την εκτέλεση της συνόδου. Οι εκπαιδευτές μπορούν να παρακολουθούν την ομαδική ή ατομική συμμετοχή, τις απαντήσεις σε πραγματικό χρόνο των συμμετεχόντων και την ερώτηση που τίθεται.</p>
<p>Κάθε προσπάθεια κουίζ βαθμολογείται αυτόματα όπως ένα συνηθισμένο κουίζ (με εξαίρεση τις ερωτήσεις έκθεσης και PoodLL) και η βαθμολογία καταγράφεται στο βαθμολόγιο. Η βαθμολόγηση για την συμμετοχή στην ομάδα μπορεί να γίνει αυτόματα, με τη μεταφορά του βαθμού από το μέλος που απάντησε προς τα άλλα μέλη της ομάδας.</p><p>Ο εκπαιδευτής μπορεί να επιλέξει να δώσει υποδείξεις, να παρέχει ανατροφοδότηση και να δείξει τις σωστές απαντήσεις στους μαθητές κατά την ολοκλήρωση του κουίζ.</p>
<p>Τα ενεργά κουίζ μπορούν να χρησιμοποιηθούν ως μέσο για την υποστήριξη/υιοθέτηση Μάθησης με Βάση την Ομάδα μέσα από το Moodle.</p>';
$string['modulenameplural'] = 'Ενεργά κουίζ';
$string['nextquestion'] = 'Επόμενη ερώτηση';
$string['no_questions'] = 'Δεν υπάρχουν καθόλου ερωτήσεις σε αυτό το κουίζ.';
$string['nochangegroups'] = 'Δεν μπορείτε να αλλάξετε τις ομάδες μετά τη δημιουργία συνόδων ή δεν υπάρχουν καθόλου ομαδοποιήσεις ορισμένες για αυτό το μάθημα.';
$string['nochangegroups_label'] = '&nbsp;';
$string['nofeedback'] = 'Δεν υπάρχει καθόλου ανατροφοδότηση για αυτήν την ερώτηση';
$string['nosession'] = 'Δεν υπάρχει καμία ανοικτή σύνοδος';
$string['notime'] = 'Δεν υπάρχει χρονικό όριο';
$string['notime_help'] = 'Τσεκάρετε αυτό το κουτάκι για μην υπάρχει καθόλου χρονόμετρο για την ερώτηση αυτή.<p>Ο εκπαιδευτής θα πρέπει στη συνέχεια να κάνει κλικ στο πλήκτρο τέλους ερώτησης για να την τερματίσει.</p>';
$string['notresponded'] = 'Αριθμός μη απαντημένων στις προσπάθειες';
$string['notries'] = 'Δεν έμεινε καμία προσπάθεια για αυτή την ερώτηση';
$string['numberoftries'] = 'Αριθμός προσπαθειών';
$string['numberoftries_help'] = 'Αριθμός προσπαθειών για ένα χρήστη για μία ερώτηση. Οι μαθητές θα εξακολουθούν να δεσμεύονται από το όριο χρόνου της ερώτησης.';
$string['overallgrade'] = 'Συνολικός βαθμός: {$a->overallgrade} / {$a->scale}';
$string['percentagedatasetlabel'] = 'Ποσοστό συνολικών απαντήσεων';
$string['pluginadministration'] = 'Διαχείριση ενεργού κουίζ';
$string['pluginname'] = 'Ενεργό κουίζ';
$string['points'] = 'Πόντοι ερώτησης';
$string['points_help'] = 'Ο αριθμός των πόντων που θέλετε να δίνει αυτή η ερώτηση';
$string['qdeleteerror'] = 'Αδυναμία διαγραφής ερώτησης';
$string['qdeletesucess'] = 'Επιτυχής διαγραφή ερώτησης';
$string['qmoveerror'] = 'Αδυναμία μετακίνησης ερώτησης';
$string['qmovesuccess'] = 'Επιτυχής μετακίνηση ερώτησης';
$string['question'] = 'Ερώτηση';
$string['questiondelete'] = 'Διαγραφή ερώτησης {$a}';
$string['questionedit'] = 'Επεξεργασία ερώτησης';
$string['questionfinished'] = 'Ολοκλήρωση ερώτησης. Αναμονή για αποτελέσματα.';
$string['questionlist'] = 'Λίστα ερωτήσεων';
$string['questionmovedown'] = 'Μετακίνηση ερωτήματος {$a} προς τα κάτω';
$string['questionmoveup'] = 'Μετακίνηση ερωτήματος {$a} προς τα πάνω';
$string['quiznotrunning'] = 'Το κουίζ δεν εκτελείται αυτή τη στιγμή - περιμένετε για τον διδάσκοντά σας να το ξεκινήσει. Χρησιμοποιήστε το πλήκτρο ανανέωσης για να φορτώσετε ξανά αυτήν τη σελίδα και να ελέγξετε πάλι.';
$string['regradeallgrades'] = 'Επανυπολογισμός όλων των βαθμών';
$string['reload_results'] = 'Επαναφόρτωση αποτελεσμάτων';
$string['repollquestion'] = 'Θέστε ξανά την ερώτηση';
$string['response_attempt_controls'] = 'Επεξεργασία/εμφάνιση προσπάθειας';
$string['responses'] = 'Εμφάνιση αποκρίσεων';
$string['reviewafter'] = 'Αφού κλείσουν οι σύνοδοι';
$string['reviewoptionsettings'] = 'Επιλογές εξέτασης';
$string['savequestion'] = 'Αποθήκευση ερώτησης';
$string['scale'] = 'Μέγιστος Βαθμός';
$string['scale_help'] = 'Αυτή η τιμή (ακέραιος) θα προσαρμόσει αναλογικά όσους πόντους λαμβάνονται από το κουίζ σε αυτήν την τιμή.';
$string['select_group'] = 'Επιλέξτε την ομάδα σας';
$string['selectsession'] = 'Επιλογή συνόδου για προβολή:&nbsp;&nbsp;&nbsp;&nbsp;';
$string['sessionaverage'] = 'Μέσος όρος συνόδου';
$string['sessionclosed'] = 'Η σύνοδος έκλεισε';
$string['sessionname'] = 'Όνομα συνόδου';
$string['sessionname_required'] = 'Το όνομα συνόδου απαιτείται';
$string['sessionnametext'] = '<span style="font-weight: bold">Σύνοδος: </span>';
$string['show_correct_answer'] = 'Εμφάνιση σωστής απάντησης';
$string['showhistoryduringquiz'] = 'Εμφάνιση ιστορικού αποκρίσεων';
$string['showhistoryduringquiz_help'] = 'Εμφάνιση του ιστορικού αποκρίσεων μαθητή/ομάδας για αυτήν την ερώτηση ενώ γίνεται ανασκόπηση αποκρίσεων σε μια ερώτηση κατά τη διάρκεια ενός κουίζ.';
$string['shownotresponded'] = 'Εμφάνιση αναπάντητων';
$string['showstudentresponses'] = 'Εμφάνιση αποκρίσεων';
$string['start_session'] = 'Έναρξη συνόδου';
$string['startedon'] = 'Ξεκίνησε στις';
$string['startquiz'] = 'Έναρξη κουίζ';
$string['studentquizinst'] = '<p>Παρακαλούμε, περιμένετε για τον εκπαιδευτή για να ξεκινήσει το κουίζ. Μόλις ξεκινήσει θα δείτε ένα χρονόμετρο να μετρά αντίστροφα μέχρι την έναρξη της πρώτης ερώτησης</p>';
$string['successregrade'] = 'Το κουίζ επαναβαθμολογήθηκε με επιτυχία';
$string['teacherjoinquizinstruct'] = 'Χρησιμοποιήστε το αν θέλετε να δοκιμάσετε ένα κουίζ για τον εαυτό σας<br>(θα πρέπει επίσης να αρχίσετε το κουίζ σε ξεχωριστό παράθυρο)';
$string['teacherstartinstruct'] = 'Χρησιμοποιήστε το για να ξεκινήσετε ένα κουίζ για να το προσπαθήσουν οι μαθητές.<br /> Χρησιμοποιήστε το πλαίσιο κειμένου για να καθορίσετε ένα όνομα για αυτήν την σύνοδο(για να βοηθήσει κατά την αναζήτηση αποτελεσμάτων σε μεταγενέστερη ημερομηνία).';
$string['theattempt'] = 'Η προσπάθεια';
$string['theattempt_help'] = 'Εάν ο μαθητής μπορεί γενικά να αναθεωρήσει την προσπάθεια.';
$string['timecompleted'] = 'Χρόνος ολοκλήρωσης';
$string['timemodified'] = 'Χρόνος τροποποίησης';
$string['timertext'] = 'Η ερώτησή σας θα τελειώσει και θα γίνει αυτόματη υποβολή σε:';
$string['trycount'] = 'Έχετε ακόμη {$a->tries} προσπάθειες.';
$string['unabletocreate_session'] = 'Αδυναμία δημιουργίας συνόδου';
$string['view'] = 'Εμφάνιση κουίζ';
$string['viewstats'] = 'Εμφάνιση των στατιστικών του κουίζ';
$string['waitforquestion'] = 'Αναμονή για την ερώτηση για να σταλεί σε:';
$string['waitforquestiontime'] = 'Περιμένετε για την ώρα της ερώτησης';
$string['waitforquestiontime_help'] = 'Ο χρόνος προς αναμονή πριν/μετά από μια ερώτηση.';
$string['waitforrevewingend'] = 'Ο εκπαιδευτής εξετάζει επί του παρόντος την προηγούμενη ερώτηση. Σας παρακαλούμε να περιμένετε για να ξεκινήσει η επόμενη ερώτηση.';
$string['waitstudent'] = 'Περιμένοντας τους μαθητές να συνδεθούν';
$string['workedingroups'] = 'Εργασία σε ομάδες.';
$string['workedingroups_help'] = 'Τσεκάρετε το κουτί αυτό για να δείξετε ότι οι μαθητές θα εργαστούν σε ομάδες. Φροντίστε να επιλέξετε μια ομαδοποίηση παρακάτω';
