<?php

// This file is part of Moodle - http://moodle.org/
//
// Moodle is free software: you can redistribute it and/or modify
// it under the terms of the GNU General Public License as published by
// the Free Software Foundation, either version 3 of the License, or
// (at your option) any later version.
//
// Moodle is distributed in the hope that it will be useful,
// but WITHOUT ANY WARRANTY; without even the implied warranty of
// MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
// GNU General Public License for more details.
//
// You should have received a copy of the GNU General Public License
// along with Moodle.  If not, see <http://www.gnu.org/licenses/>.

/**
 * Strings for component 'cachestore_memcache', language 'el', branch 'MOODLE_34_STABLE'
 *
 * @package   cachestore_memcache
 * @copyright 1999 onwards Martin Dougiamas  {@link http://moodle.com}
 * @license   http://www.gnu.org/copyleft/gpl.html GNU GPL v3 or later
 */

defined('MOODLE_INTERNAL') || die();

$string['clustered'] = 'Ενεργοποίηση εξυπηρετητών σε συστάδες';
$string['clusteredheader'] = 'Χωριστοί εξυπηρετητές';
$string['clustered_help'] = 'Αυτό χρησιμοποιείται για να επιτρέψει λειτουργία ορισμού-πολλών με μόνο μία ανάγνωση. Η σκοπούμενη περίπτωση χρήσης είναι να δημιουργηθεί μια βελτιωμένη αποθήκευση για ρυθμίσεις εξισορρόπησης φορτίου. Η αποθήκευση θα βρίσκει και θα φέρνει από έναν εξυπηρετητή (συνήθως στον ίδιο τοπικό κεντρικό Η/Υ), αλλά θα ορίζει σε πολλούς (όλους τους εξυπηρετητές στον σχηματισμό ισορρόπησης). Για κρυφές μνήμες με πολύ υψηλές αναλογίες ανάγνωσης προς εγγραφές, αυτό εξοικονομεί σημαντικό ποσό δυκτιακού έξτρα φόρτου. Όταν είναι ενεργοποιημένη αυτή η επιλογή, ο παραπάνω εξυπηρετητής θα χρησιμοποιείται για να βρίσκει και να φέρνει δεδομένα.';
$string['pluginname'] = 'Memcache (κρυφή μνήμη ΒΔ στη RAM)';
$string['prefix'] = 'Βασικό πρόθεμα';
$string['prefix_help'] = 'Το πρόθεμα αυτό χρησιμοποιείται για όλα τα ονόματα κλειδιών στον εξυπηρετητή memcache (κρυφή μνήμη για βελτίωση απόκρισης ΒΔ από ιστοσελίδες).

* Αν έχετε μόνο μια εγκατάσταση Moodle που χρησιμοποιεί αυτόν τον εξυπηρετητή, τότε μπορείτε να διατηρήσετε την προεπιλεγμένη τιμή.
* Λόγω περιορισμών μήκους κλειδιών, επιτρέπονται το πολύ 5 χαρακτήρες.';
$string['prefixinvalid'] = 'Μη έγκυρο πρόθεμα. Μπορείτε να χρησιμοποιήσετε μόνο τα a-z A-Z 0-9 -_.';
$string['privacy:metadata:memcache'] = 'Το πρόσθετο αποθήκευσης κρυφής μνήμης ΒΔ Memcache cachestore αποθηκεύει στοιχεία για λίγο ως μέρος της λειτουργικότητας της κρυφής μνήμης. Αυτά τα δεδομένα αποθηκεύονται σε έναν εξυπηρετητή Memcache, όπου τα δεδομένα καταργούνται τακτικά.';
$string['privacy:metadata:memcache:data'] = 'Τα διάφορα δεδομένα που αποθηκεύονται στην κρυφή μνήμη';
$string['servers'] = 'Εξυπηρετητές';
$string['serversclusterinvalid'] = 'Όταν ενεργοποιούνται οι συστάδες απαιτείται ακριβώς ένας εξυπηρετητής.';
$string['servers_help'] = 'Εδώ ορίζονται οι εξυπηρετητές που πρέπει να χρησιμοποιηθούν από αυτόν τον προσαρμογέα memcache (κρυφή μνήμη ΒΔ στη RAM).
Οι εξυπηρετητές πρέπει να ορίζονται ένας ανά γραμμή και να αποτελούνται από μια διεύθυνση εξυπηρετητή και προαιρετικά μια θύρα και βαρύτητα.
Εάν δεν υπάρχει θύρα, τότε χρησιμοποιείται η προεπιλεγμένη θύρα (11211).

Για παράδειγμα:
<pre>
server.url.com
ipaddress:port
servername:port:weight
</pre>

Εάν η ρύθμιση *Ενεργοποίηση εξυπηρετητών σε συστοιχίες* είναι ενεργοποιημένη παρακάτω, πρέπει να υπάρχει μόνο ένας εξυπηρετητής που να εμφανίζεται εδώ. Αυτό συνήθως θα είναι ένα όνομα/διεύθυνση που πάντα επιλύεται/αναφέρεται στον τοπικό Η/Υ, όπως π.χ. το 127.0.0.1 ή το localhost.';
$string['sessionhandlerconflict'] = 'Προειδοποίηση: Ένα στιγμιότυπο memcache ({$a}) έχει ρυθμιστεί να χρησιμοποιεί τον ίδιο εξυπηρετητή memcached με τις συνόδους. Εκκαθάριση όλων των κρυφών μνημών θα οδηγήσει και σε εκκαθαρισμό των συνόδων.';
$string['setservers'] = 'Εξυπηρετητές που έχουν τεθεί/οριστεί';
$string['setservers_help'] = 'Αυτή είναι η λίστα των εξυπηρετητών που θα ενημερωθούν όταν τα δεδομένα τροποποιηθούν στην κρυφή μνήμη. Γενικά, το πλήρες όνομα κάθε εξυπηρετητή στη λίστα.
**Πρέπει** να περιλαμβάνει τον εξυπηρετητή που περιλαμβάνεται στον κατάλογο *Εξυπηρετητές* παραπάνω, ακόμα και αν έχει διαφορετικό όνομα Η/Υ (hostname).
Οι εξυπηρετητές θα πρέπει να ορίζονται ένας ανά γραμμή και να αποτελούνται από μια διεύθυνση εξυπηρετητή και προαιρετικά μια θύρα.
Εάν δεν υπάρχει θύρα, τότε χρησιμοποιείται η προεπιλεγμένη θύρα (11211).

Για παράδειγμα:
<pre>
server.url.com
ipaddress:port
</pre>';
$string['testservers'] = 'Εξυπηρετητές δοκιμών';
$string['testservers_desc'] = 'Μια ή περισσότερες συμβολοσειρές σύνδεσης για εξυπηρετητές memcache (κρυφή μνήμη ΒΔ στη RAM) για να δοκιμάσετε. Εάν έχει καθοριστεί ένας εξυπηρετητής δοκιμής, τότε η απόδοση του memcache μπορεί να δοκιμαστεί χρησιμοποιώντας τη σελίδα απόδοσης της κρυφής μνήμης στο μπλοκ διαχείρισης.
Για παράδειγμα: 127.0.0.1:11211';
