<?php
// This file is part of Moodle - https://moodle.org/
//
// Moodle is free software: you can redistribute it and/or modify
// it under the terms of the GNU General Public License as published by
// the Free Software Foundation, either version 3 of the License, or
// (at your option) any later version.
//
// Moodle is distributed in the hope that it will be useful,
// but WITHOUT ANY WARRANTY; without even the implied warranty of
// MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
// GNU General Public License for more details.
//
// You should have received a copy of the GNU General Public License
// along with Moodle.  If not, see <https://www.gnu.org/licenses/>.

/**
 * Strings for component 'resource', language 'el', version '3.8'.
 *
 * @package     resource
 * @category    string
 * @copyright   1999 Martin Dougiamas and contributors
 * @license     https://www.gnu.org/copyleft/gpl.html GNU GPL v3 or later
 */

defined('MOODLE_INTERNAL') || die();

$string['clicktodownload'] = 'Πατήστε στο σύνδεσμο {$a} για λήψη του αρχείου.';
$string['clicktoopen2'] = 'Πατήστε στο σύνδεσμο {$a} για να δείτε το αρχείο.';
$string['configdisplayoptions'] = 'Επιλέξτε όλες τις επιλογές που θα πρέπει να είναι διαθέσιμες, οι υπάρχουσες ρυθμίσεις δεν τροποποιούνται. Κρατήστε πατημένο το πλήκτρο CTRL για να επιλέξετε πολλαπλά πεδία.';
$string['configframesize'] = 'Όταν μια ιστοσελίδα ή ένα ανεβασμένο αρχείο εμφανίζεται μέσα σε πλαίσιο, τότε αυτή η τιμή είναι το ύψος (σε εικονοστοιχεία) του εξωτερικού πλαισίου (που περιέχει και τα στοιχεία πλοήγησης).';
$string['configparametersettings'] = 'Αυτό ορίζει την προεπιλεγμένη τιμή για τις ρυθμίσεις Παραμέτρων στην φόρμα όταν προστίθενται νέες πηγές. Μετά την πρώτη φορά, αυτό γίνεται προσωπική επιλογή του κάθε χρήστη.';
$string['configpopup'] = 'Όταν προσθέσετε μία νέα πηγή η οποία μπορεί να εμφανιστεί σε αναδυόμενο παράθυρο, να είναι ενεργοποιημένη από την αρχή αυτή η επιλογή;';
$string['configpopupdirectories'] = 'Να εμφανίζονται συνδέσεις φακέλων στα αναδυόμενα παράθυρα από προεπιλογή';
$string['configpopupheight'] = 'Ποιο είναι το προεπιλεγμένο ύψος των αναδυόμενων παραθύρων;';
$string['configpopuplocation'] = 'Να εμφανίζεται η γραμμή διευθύνσεων στα αναδυόμενα παράθυρα από προεπιλογή;';
$string['configpopupmenubar'] = 'Να εμφανίζεται η γραμμή μενού στα αναδυόμενα παράθυρα από προεπιλογή;';
$string['configpopupresizable'] = 'Να υπάρχει η δυνατότητα αλλαγής του μεγέθους ενός αναδυόμενου παραθύρου από προεπιλογή;';
$string['configpopupscrollbars'] = 'Να υπάρχει δυνατότητα εμφάνισης γραμμή κύλισης στα αναδυόμενα παράθυρα από προεπιλογή;';
$string['configpopupstatus'] = 'Να εμφανίζεται η γραμμή κατάστασης στα αναδυόμενα παράθυρα από προεπιλογή;';
$string['configpopuptoolbar'] = 'Να εμφανίζονται οι εργαλειοθήκες στα αναδυόμενα παράθυρα από προεπιλογή;';
$string['configpopupwidth'] = 'Ποιο είναι το προεπιλεγμένο πλάτος για τα νέα popup παράθυρα;';
$string['contentheader'] = 'Περιεχόμενο';
$string['displayoptions'] = 'Διαθέσιμες επιλογές εμφάνισης';
$string['displayselect'] = 'Εμφάνιση';
$string['displayselect_help'] = 'Η ρύθμιση αυτή, μαζί με τον τύπο αρχείου και κατά πόσον ο περιηγητής επιτρέπει την ενσωμάτωση, καθορίζει πως θα εμφανίζεται το αρχείο. Οι επιλογές περιλαμβάνουν:
* Αυτόματα - Η καλύτερη επιλογή εμφάνισης για τον τύπο αρχείου επιλέγεται αυτόματα.
* Ενσωμάτωση - Το αρχείο εμφανίζεται μέσα στη σελίδα κάτω από τη μπάρα πλοήγησης μαζί με την περιγραφή του αρχείου και οποιοδήποτε μπλοκ.
* Επιβολή λήψης αρχείου - Ζητείται από το χρήστη να κατεβάσει το αρχείο.
* Ανοιχτό - Μόνο το αρχείο εμφανίζεται στο παράθυρο του περιηγητή.
* Σε αναδυόμενο παράθυρο - Το αρχείο εμφανίζεται σε ένα νέο παράθυρο του περιηγητή χωρίς μενού ή γραμμή διευθύνσεων.
* Σε πλαίσιο - Το αρχείο εμφανίζεται μέσα σε ένα πλαίσιο κάτω από τη μπάρα πλοήγησης και την περιγραφή αρχείου.
* Νέο παράθυρο - Το αρχείο εμφανίζεται σε ένα νέο παράθυρο περιηγητή με μενού και γραμμή διευθύνσεων.';
$string['displayselect_link'] = 'άρθρωμα/αρχείο/άρθρωμα';
$string['displayselectexplain'] = 'Επιλογή τύπου εμφάνισης. Δυστυχώς δεν είναι όλοι οι τύποι κατάλληλοι για όλα τα αρχεία.';
$string['dnduploadresource'] = 'Δημιουργία πόρου αρχείου';
$string['encryptedcode'] = 'Κρυπτογραφημένος κώδικας';
$string['filenotfound'] = 'Δυστυχώς, το αρχείο δεν βρέθηκε!';
$string['filterfiles'] = 'Χρήση φίλτρων για το περιεχόμενο αρχείου';
$string['filterfilesexplain'] = 'Επιλέξτε τύπο φιλτραρίσματος για το περιεχόμενο του αρχείου. Παρακαλούμε σημειώστε ότι αυτό μπορεί να προκαλέσει προβλήματα για ορισμένες Flash και Java εφαρμογές. Παρακαλούμε βεβαιωθείτε ότι όλα τα αρχεία κειμένου είναι σε κωδικοποίηση UTF-8.';
$string['filtername'] = 'Αυτόματη σύνδεση ονομάτων πηγών';
$string['forcedownload'] = 'Επιβολή λήψης αρχείου';
$string['framesize'] = 'Ύψος πλαισίου';
$string['indicator:cognitivedepth'] = 'Βάθος κατανόησης Αρχείου';
$string['indicator:cognitivedepth_help'] = 'Αυτός ο δείκτης βασίζεται στο βάθος κατανόησης που επιτεύχθηκε από τον μαθητή σε έναν πόρο Αρχείου.';
$string['indicator:cognitivedepthdef'] = 'Βάθος κατανόησης Αρχείου';
$string['indicator:cognitivedepthdef_help'] = 'Ο συμμετέχων έχει φτάσει αυτό το ποσοστό αφοσίωσης στο βάθος κατανόησης που προσφέρεται από τις δραστηριότητες Αρχείου κατά τη διάρκεια αυτού του διαστήματος ανάλυσης (Επίπεδα = Καμία εμφάνιση, Εμφάνιση)';
$string['indicator:cognitivedepthdef_link'] = 'Δείκτες_μαθησιακής_αναλυτικής#Βάθος_κατανόησης';
$string['indicator:socialbreadth'] = 'Κοινωνικό εύρος Αρχείου';
$string['indicator:socialbreadth_help'] = 'Αυτός ο δείκτης βασίζεται στο κοινωνικό εύρος που επιτεύχθηκε από τον μαθητή σε έναν πόρο Αρχείου.';
$string['indicator:socialbreadthdef'] = 'Κοινωνικό εύρος Αρχείου';
$string['indicator:socialbreadthdef_help'] = 'Ο συμμετέχων έχει φτάσει αυτό το ποσοστό αφοσίωσης στο κοινωνικό εύρος που προσφέρεται από τις δραστηριότητες Αρχείου κατά τη διάρκεια αυτού του διαστήματος ανάλυσης (Επίπεδα = Καμία συμμετοχή, Συμμετέχων μόνος)';
$string['indicator:socialbreadthdef_link'] = 'Δείκτες_μαθησιακής_αναλυτικής#Κοινωνικό_εύρος';
$string['legacyfiles'] = 'Μετεγκατάσταση (μεταφορά/μετατροπή) παλαιού αρχείου μαθήματος';
$string['legacyfilesactive'] = 'Ενεργό';
$string['legacyfilesdone'] = 'Τελείωσαν';
$string['modifieddate'] = 'Τροποποιήθηκε {$a}';
$string['modulename'] = 'Αρχείο';
$string['modulename_help'] = 'Το άρθρωμα αρχείου επιτρέπει σε έναν διδάσκοντα να παρέχει ένα αρχείο ως πόρο του μαθήματος. Όπου είναι δυνατόν, το αρχείο θα εμφανιστεί στη διεπαφή του μαθήματος· διαφορετικά θα ζητηθεί από τους μαθητές η λήψη του. Το αρχείο μπορεί να περιλαμβάνει συνοδευτικά αρχεία. Για παράδειγμα, μια σελίδα HTML μπορεί να έχει ενσωματωμένες εικόνες.

Σημειώστε ότι οι μαθητές πρέπει να έχουν το κατάλληλο λογισμικό στους υπολογιστές τους για να ανοίξουν το αρχείο.

Ένα αρχείο μπορεί να χρησιμοποιηθεί:

* Για το διαμοιρασμό παρουσιάσεων στην τάξη.
* Για να συμπεριληφθεί ένας μίνι ιστότοπος ως πόρος του μαθήματος.
* Για την παροχή προσχεδίων αρχείων συγκεκριμένων προγραμμάτων λογισμικού (π.χ. Photoshop .psd), έτσι ώστε οι μαθητές να μπορούν να τα επεξεργαστούν και να τα υποβάλουν προς αξιολόγηση.';
$string['modulename_link'] = 'άρθρωμα/πόρος/εμφάνιση';
$string['modulenameplural'] = 'Αρχεία';
$string['notmigrated'] = 'Αυτός ο τύπος πόρου παλαιότερης έκδοσης (κλασικός) ({$a}) δεν είχε ακόμη μετεγκατασταθεί (μεταφορά/μετατροπή). Λυπούμαστε!';
$string['optionsheader'] = 'Επιλογές εμφάνισης';
$string['page-mod-resource-x'] = 'Οποιαδήποτε σελίδα του αρθρώματος αρχείου';
$string['pluginadministration'] = 'Διαχείριση αρθρώματος αρχείου';
$string['pluginname'] = 'Αρχείο';
$string['popupheight'] = 'Ύψος αναδυόμενου παραθύρου (σε εικονοστοιχεία)';
$string['popupheightexplain'] = 'Καθορίζει το προεπιλεγμένο ύψος των αναδυόμενων παραθύρων.';
$string['popupresource'] = 'Αυτός ο πόρος θα εμφανιστεί αυτόματα σε αναδυόμενο παράθυρο.';
$string['popupresourcelink'] = 'Εάν αυτό δε συμβεί, πατήστε εδώ: {$a}';
$string['popupwidth'] = 'Πλάτος αναδυόμενου παραθύρου (σε εικονοστοιχεία)';
$string['popupwidthexplain'] = 'Καθορίζει το προεπιλεγμένο πλάτος των αναδυόμενων παραθύρων.';
$string['printintro'] = 'Εμφάνιση περιγραφής πόρου';
$string['printintroexplain'] = 'Εμφάνιση περιγραφής πηγής κάτω από το περιεχόμενο. Ορισμένοι τύποι εμφάνισης μπορεί να μην εμφανίζουν την περιγραφή, ακόμα και αν έχει ενεργοποιηθεί.';
$string['privacy:metadata'] = 'Το πρόσθετο «Πόρος αρχείου» δεν αποθηκεύει κανένα προσωπικό δεδομένο.';
$string['resource:addinstance'] = 'Προσθήκη νέου πόρου';
$string['resource:exportresource'] = 'Εξαγωγή πόρου';
$string['resource:view'] = 'Εμφάνιση πόρου';
$string['resourcecontent'] = 'Αρχεία και υπο-φάκελοι';
$string['resourcedetails_sizedate'] = '{$a->size} {$a->date}';
$string['resourcedetails_sizetype'] = '{$a->size} {$a->type}';
$string['resourcedetails_sizetypedate'] = '{$a->size} {$a->type} {$a->date}';
$string['resourcedetails_typedate'] = '{$a->type} {$a->date}';
$string['search:activity'] = 'Αρχείο';
$string['selectmainfile'] = 'Παρακαλούμε επιλέξτε το βασικό αρχείο πατώντας το εικονίδιο δίπλα από το όνομα αρχείου.';
$string['showdate'] = 'Εμφάνιση ημερομηνίας ανεβάσματος/τροποποίησης';
$string['showdate_desc'] = 'Εμφάνιση ημερομηνίας ανεβάσματος/τροποποίησης στη σελίδα μαθήματος;';
$string['showdate_help'] = 'Εμφανίζει την ημερομηνία ανεβάσματος/τροποποίησης δίπλα από τους συνδέσμους στο αρχείο.
Αν υπάρχουν πολλαπλά αρχεία σε αυτό τον πόρο, θα εμφανιστεί η ημερομηνία ανεβάσματος/τροποποίησης του αρχείου εκκίνησης.';
$string['showsize'] = 'Εμφάνιση μεγέθους';
$string['showsize_desc'] = 'Εμφάνιση μεγέθους αρχείου στη σελίδα μαθήματος;';
$string['showsize_help'] = 'Εμφανίζει το μέγεθος του αρχείου, όπως «3.1 MB», δίπλα από τους συνδέσμους στο αρχείο.

Αν υπάρχουν πολλαπλά αρχεία σε αυτό τον πόρο, θα εμφανιστεί το συνολικό μέγεθος όλων των αρχείων.';
$string['showtype'] = 'Εμφάνιση τύπου';
$string['showtype_desc'] = 'Εμφάνιση τύπου αρχείου (π.χ. «αρχείο Word») στη σελίδα μαθήματος;';
$string['showtype_help'] = 'Εμφανίζει τον τύπο του αρχείου, όπως «αρχείο Word», δίπλα από τους συνδέσμους στο αρχείο.
Αν υπάρχουν πολλαπλά αρχεία σε αυτό τον πόρο, θα εμφανιστεί ο τύπος του αρχικού αρχείου.
Αν ο τύπος αρχείου δεν είναι γνωστός στο σύστημα, δεν θα εμφανιστεί.';
$string['uploadeddate'] = 'Ανέβηκε στις {$a}';
