<?php
// This file is part of Moodle - https://moodle.org/
//
// Moodle is free software: you can redistribute it and/or modify
// it under the terms of the GNU General Public License as published by
// the Free Software Foundation, either version 3 of the License, or
// (at your option) any later version.
//
// Moodle is distributed in the hope that it will be useful,
// but WITHOUT ANY WARRANTY; without even the implied warranty of
// MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
// GNU General Public License for more details.
//
// You should have received a copy of the GNU General Public License
// along with Moodle.  If not, see <https://www.gnu.org/licenses/>.

/**
 * Strings for component 'survey', language 'el', version '3.8'.
 *
 * @package     survey
 * @category    string
 * @copyright   1999 Martin Dougiamas and contributors
 * @license     https://www.gnu.org/copyleft/gpl.html GNU GPL v3 or later
 */

defined('MOODLE_INTERNAL') || die();

$string['actual'] = 'Πραγματικό';
$string['actualclass'] = 'Πραγματική τάξη';
$string['actualstudent'] = '{$a} πραγματικό';
$string['allquestionrequireanswer'] = 'Όλες οι ερωτήσεις απαιτούνται και πρέπει να απαντηθούν.';
$string['allquestions'] = 'Όλες οι ερωτήσεις στη σειρά, όλοι οι μαθητές';
$string['allscales'] = 'Όλες οι κλίμακες, όλοι οι μαθητές';
$string['alreadysubmitted'] = 'Έχετε ήδη καταχωρήσει αυτή την έρευνα';
$string['analysisof'] = 'Ανάλυση του {$a}';
$string['answers'] = 'Απαντήσεις';
$string['attls1'] = 'Στο να εκτιμήσω τι λέει κάποιος, εστιάζομαι επάνω στην ποιότητα της συζήτησης και όχι στο πρόσωπο που την παρουσιάζει.';
$string['attls10'] = 'Είναι σημαντικό για μένα να παραμένω όσο αντικειμενικός γίνεται όταν αναλύω κάτι.';
$string['attls10short'] = 'παραμένω αντικειμενικός';
$string['attls11'] = 'Προσπαθώ να σκέφτομαι με τους ανθρώπους παρά να είμαι αντίθετος με αυτούς.';
$string['attls11short'] = 'σκέψου ΜΕ τους ανθρώπους';
$string['attls12'] = 'Έχω συγκεκριμένα κριτήρια που χρησιμοποιώ στην εκτίμηση μιας συζήτησης.';
$string['attls12short'] = 'χρήση κριτηρίων στην εκτίμηση';
$string['attls13'] = 'Είναι πιο πιθανό να προσπαθήσω να κατανοήσω τη γνώμη κάποιου άλλου παρά να την αξιολογήσω.';
$string['attls13short'] = 'προσπάθησε να καταλάβεις';
$string['attls14'] = 'Προσπαθώ να επισημάνω αδυναμίες στη σκέψη των άλλων και να τους βοηθήσω να διευκρινίσουν την άποψή τους.';
$string['attls14short'] = 'επισημάνετε τις αδυναμίες';
$string['attls15'] = 'Έχω την τάση να βάζω τον εαυτό μου στη θέση των άλλων όταν συζητώ αμφιλεγόμενα θέματα, για να δω γιατί σκέφτονται κατ\' αυτόν τον τρόπο.';
$string['attls15short'] = 'βάζω τον εαυτό μου στη θέση τους';
$string['attls16'] = 'Κάποιος θα μπορούσε να χαρακτηρίσει τον τρόπο με τον οποίο αναλύω τα πράγματα ότι «τα περνάω από δίκη» γιατί είμαι προσεκτικός στο να εκτιμήσω όλα τα στοιχεία.';
$string['attls16short'] = 'περνάω από δίκη';
$string['attls17'] = 'Εκτιμώ τη χρήση της λογικής και της αιτιολόγησης των δικών μου ανησυχιών όταν επιλύω προβλήματα.';
$string['attls17short'] = 'Εκτιμώ περισσότερο τη λογική';
$string['attls18'] = 'Μπορώ να αποκτήσω ενόραση σε απόψεις που διαφέρουν από τη δική μου, μέσω της ενσυναίσθησης.';
$string['attls18short'] = 'επίγνωση μέσω ενσυναίσθησης';
$string['attls19'] = 'Όταν συναντώ άτομα των οποίων οι απόψεις μου φαίνονται παράξενες, κάνω συνειδητή προσπάθεια να «επεκτείνω» τον εαυτό μου στη θέση του, για να δω για ποιο λόγο έχει αυτές τις απόψεις.';
$string['attls19short'] = 'κάνω προσπάθεια να επεκτείνω';
$string['attls1short'] = 'ποιότητα εστίασης της συζήτησης';
$string['attls2'] = 'Μου αρέσει να κάνω το δικηγόρο του διαβόλου - υποστηρίζοντας το αντίθετο από αυτό που κάποιος λέει.';
$string['attls20'] = 'Αφιερώνω χρόνο προσπαθώντας να καταλάβω τι είναι «λάθος» σε κάτι. Για παράδειγμα, θα ψάξω για κάτι στη λογοτεχνική του ερμηνεία που δεν συζητείται αρκετά.';
$string['attls20short'] = 'τι είναι λάθος;';
$string['attls2short'] = 'παίζω το δικηγόρο του διαβόλου';
$string['attls3'] = 'Μου αρέσει να κατανοώ από που «προέρχονται» οι άλλοι άνθρωποι, ποιές εμπειρίες τους έχουν οδηγήσει στο να σκέφτονται έτσι.';
$string['attls3short'] = 'Από πού προέρχονται οι άνθρωποι';
$string['attls4'] = 'Το πιο σημαντικό μέρος της εκπαίδευσής μου ήταν να μάθω να καταλαβαίνω τους ανθρώπους οι οποίοι είναι πολύ διαφορετικοί από εμένα.';
$string['attls4short'] = 'Καταλαβαίνω τους διαφορετικούς ανθρώπους';
$string['attls5'] = 'Αισθάνομαι ότι ο καλύτερος τρόπος για μένα στο να επιτύχω τη δική μου ταυτότητα, είναι να αλληλεπιδράσω με την ποικιλία των άλλων ανθρώπων.';
$string['attls5short'] = 'αλληλεπίδραση με ποικιλία';
$string['attls6'] = 'Απολαμβάνω να ακούω τις απόψεις ανθρώπων οι οποίοι προέρχονται από διαφορετικά υπόβαθρα από το δικό μου - με βοηθάει να κατανοήσω πώς τα ίδια πράγματα μπορούν να ιδωθούν με τόσο διαφορετικούς τρόπους.';
$string['attls6short'] = 'Μου αρέσει να ακούω τις απόψεις';
$string['attls7'] = 'Μπορώ να ενισχύσω τη δική μου γνώμη μέσω της συζήτησης με κάποιον που διαφωνεί μαζί μου.';
$string['attls7short'] = 'ενίσχυση μέσω της συζήτησης';
$string['attls8'] = 'Πάντα με ενδιέφερε να μαθαίνω γιατί οι άνθρωποι λένε και πιστεύουν τα πράγματα που αυτοί κάνουν.';
$string['attls8short'] = 'να γνωρίζω γιατί οι άνθρωποι κάνουν';
$string['attls9'] = 'Συχνά πιάνω τον εαυτό μου να διαφωνεί με τους συντάκτες των βιβλίων που διαβάζω, προσπαθώντας με τη λογική να καταλάβω γιατί είναι λάθος.';
$string['attls9short'] = 'διαφωνώ με τους συντάκτες';
$string['attlsintro'] = 'Ο σκοπός αυτού του ερωτηματολογίου είναι να βοηθήσει εμάς να εκτιμήσουμε τη στάση σας απέναντι στη σκέψη και στη μάθηση. Δεν υπάρχουν «σωστές» ή «λάθος» απαντήσεις; μας ενδιαφέρει μόνο η γνώμη σας. Παρακαλούμε να είστε βέβαιοι πως ο χειρισμός των απαντήσεών σας θα γίνει εμπιστευτικά και δε θα επηρεάσει την αξιολόγησή σας.';
$string['attlsm1'] = 'Στάσεις Απέναντι στη Σκέψη και την Μάθηση';
$string['attlsm2'] = 'Συνδεδεμένη μάθηση';
$string['attlsm3'] = 'Μεμονωμένη μάθηση';
$string['attlsmintro'] = 'Υπό συζήτηση ...';
$string['attlsname'] = 'ATTLS (έκδοση 20 αντικειμένων)';
$string['cannotfindanswer'] = 'Δεν υπάρχουν απαντήσεις για αυτή την Έρευνα ακόμα.';
$string['cannotfindquestion'] = 'Η ερώτηση αυτή δεν υπάρχει';
$string['cannotfindsurveytmpt'] = 'Δεν βρέθηκαν τύποι έρευνας!';
$string['ciq1'] = 'Σε ποιά χρονική στιγμή είχατε εμπλακεί περισσότερο στο ρόλο του μαθητή;';
$string['ciq1short'] = 'Μεγαλύτερη εμπλοκή';
$string['ciq2'] = 'Σε ποιά χρονική στιγμή είχατε απομακρυνθεί περισσότερο από το ρόλο του μαθητή;';
$string['ciq2short'] = 'Μεγαλύτερη απόσταση';
$string['ciq3'] = 'Ποιά ενέργεια οποιουδήποτε στα φόρουμ θεωρείτε πως ήταν θετική ή πως βοήθησε πολύ;';
$string['ciq3short'] = 'Βοηθητική στιγμή';
$string['ciq4'] = 'Ποιά ενέργεια οποιουδήποτε στα φόρουμ θεωρείτε πως προκάλεσε σύγχυση ή προβλήματα;';
$string['ciq4short'] = 'Στιγμή σύγχυσης';
$string['ciq5'] = 'Ποιό γεγονός σας εξέπληξε περισσότερο;';
$string['ciq5short'] = 'Στιγμή έκπληξης';
$string['ciqintro'] = 'Ανασκοπώντας πρόσφατα γεγονότα στην τάξη, απαντήστε στις παρακάτω ερωτήσεις.';
$string['ciqname'] = 'Κρίσιμα περιστατικά';
$string['clicktocontinue'] = 'Κάντε κλικ εδώ για να συνεχίσετε';
$string['clicktocontinuecheck'] = 'Κάντε κλικ εδώ για έλεγχο και συνέχεια';
$string['colles1'] = 'εστιάζω τη μάθησή μου σε κεφάλαια που με ενδιαφέρουν.';
$string['colles10'] = 'Ζητώ από τους άλλους μαθητές να εξηγήσουν τις ιδέες τους.';
$string['colles10short'] = 'Ζητώ εξηγήσεις';
$string['colles11'] = 'οι άλλοι μαθητές μου ζήτησαν να εξηγήσω τις ιδέες μου.';
$string['colles11short'] = 'Μου ζητήθηκε να δώσω εξηγήσεις';
$string['colles12'] = 'οι άλλοι μαθητές αποκρίνονται στις ιδέες μου.';
$string['colles12short'] = 'Οι μαθητές αποκρίνονται σε εμένα';
$string['colles13'] = 'Ο εκπαιδευτής προκαλεί τη σκέψη μου.';
$string['colles13short'] = 'Ο εκπαιδευτής προκαλεί τη σκέψη';
$string['colles14'] = 'Ο εκπαιδευτής με ενθαρρύνει να συμμετάσχω.';
$string['colles14short'] = 'Ο εκπαιδευτής με ενθαρρύνει';
$string['colles15'] = 'ο εκπαιδευτής προβάλει την σωστή συζήτηση.';
$string['colles15short'] = 'ο εκπαιδευτής προβάλει τη συζήτηση';
$string['colles16'] = 'ο εκπαιδευτής προβάλει την κριτική θεώρηση του εαυτού μας.';
$string['colles16short'] = 'ο εκπαιδευτής προβάλει αυτο-ανασκόπηση.';
$string['colles17'] = 'οι άλλοι μαθητές ενθαρρύνουν τη συμμετοχή μου.';
$string['colles17short'] = 'οι μαθητές με ενθαρρύνουν';
$string['colles18'] = 'οι άλλοι μαθητές επαινούν την συνεισφορά μου.';
$string['colles18short'] = 'οι μαθητές με επαινούν';
$string['colles19'] = 'οι άλλοι μαθητές εκτιμούν την συνεισφορά μου.';
$string['colles19short'] = 'οι μαθητές με εκτιμούν';
$string['colles1short'] = 'εστιάζω σε ενδιαφέροντα θέματα';
$string['colles2'] = 'ό,τι μαθαίνω είναι σημαντικό για την επαγγελματική μου πρακτική.';
$string['colles20'] = 'οι άλλοι μαθητές συναισθάνονται την προσπάθειά μου για μάθηση';
$string['colles20short'] = 'οι μαθητές συναισθάνονται';
$string['colles21'] = 'Βγάζω νόημα από τα μηνύματα των άλλων μαθητών.';
$string['colles21short'] = 'Καταλαβαίνω τους άλλους μαθητές';
$string['colles22'] = 'Οι άλλοι μαθητές καταλαβαίνουν τα μηνύματά μου.';
$string['colles22short'] = 'Οι μαθητές με καταλαβαίνουν';
$string['colles23'] = 'Βγάζω νόημα από τα μηνύματα του καθηγητή.';
$string['colles23short'] = 'Καταλαβαίνω το καθηγητή';
$string['colles24'] = 'Ο καθηγητής βγάζει νόημα από τα μηνύματά μου.';
$string['colles24short'] = 'Ο καθηγητής με καταλαβαίνει';
$string['colles2short'] = 'σημαντικό για την πρακτική μου';
$string['colles3'] = 'Μαθαίνω πως να βελτιώνω την επαγγελματική μου πρακτική.';
$string['colles3short'] = 'βελτιώνω την πρακτική μου';
$string['colles4'] = 'ό,τι μαθαίνω συνδέεται καλά με την επαγγελματική μου πρακτική.';
$string['colles4short'] = 'συνδέεται με την πρακτική μου';
$string['colles5'] = 'Σκέφτομαι κριτικά για το πως μαθαίνω.';
$string['colles5short'] = 'Είμαι επικριτικός στη μάθησή μου';
$string['colles6'] = 'Σκέφτομαι κριτικά για τις δικές μου ιδέες.';
$string['colles6short'] = 'Είμαι επικριτικός στις ιδέες μου';
$string['colles7'] = 'Σκέφτομαι κριτικά για τις ιδέες άλλων μαθητών.';
$string['colles7short'] = 'Είμαι επικριτικός στις ιδέες άλλων μαθητών';
$string['colles8'] = 'Σκέφτομαι κριτικά για τις ιδέες στα αναγνώσματα.';
$string['colles8short'] = 'Είμαι επικριτικός με το υλικό που διαβάζω';
$string['colles9'] = 'Εξηγώ τις ιδέες μου στους άλλους μαθητές.';
$string['colles9short'] = 'Εξηγώ τις ιδέες μου';
$string['collesaintro'] = 'Ο σκοπός αυτής της έρευνας είναι να μας βοηθήσει να καταλάβουμε πόσο καλά η δικτυακή παράδοση αυτής της ενότητας σας καθιστά ικανό να μάθετε. Κάθε μια από τις παρακάτω 24 προτάσεις ρωτά για την εμπειρία σας σε αυτή την ενότητα. Δεν υπάρχουν «σωστές» ή «λάθος» απαντήσεις. Ενδιαφερόμαστε μόνο για τη γνώμη σας. Παρακαλούμε να είστε βέβαιοι πως ο χειρισμός των απαντήσεών σας θα γίνει εμπιστευτικά και δε θα επηρεάσει την αξιολόγησή σας. Οι προσεχτικά θεωρημένες απαντήσεις σας, θα μας βοηθήσουν να βελτιώσουμε τον τρόπο με τον οποίο αυτή η ενότητα θα παρουσιάζεται εντός σύνδεσης στο μέλλον. Σας ευχαριστούμε πολύ.';
$string['collesaname'] = 'COLLES (Πραγματικό)';
$string['collesapintro'] = 'Ο σκοπός αυτού του ερωτηματολογίου είναι να βοηθήσει εμάς να καταλάβουμε πόσο καλά η δικτυακή παράδοση αυτής της ενότητας σας καθιστά ικανό να μάθετε. Κάθε μια από τις παρακάτω 24 προτάσεις σας ζητά να συγκρίνετε την <b>προτιμώμενη</b> και την <b>πραγματική</b> εμπειρία σας σε αυτή την ενότητα. Δεν υπάρχουν «σωστές» ή «λάθος» απαντήσεις. Ενδιαφερόμαστε μόνο για τη γνώμη σας. Παρακαλούμε να είστε βέβαιοι πως ο χειρισμός των απαντήσεών σας θα γίνει εμπιστευτικά και δε θα επηρεάσει την αξιολόγησή σας. Οι προσεχτικά θεωρημένες απαντήσεις σας, θα μας βοηθήσουν να βελτιώσουμε τον τρόπο με τον οποίο αυτή η ενότητα θα παρουσιάζεται εντός σύνδεσης στο μέλλον. Σας ευχαριστούμε πολύ.';
$string['collesapname'] = 'COLLES (Προτιμώμενη και πραγματική)';
$string['collesm1'] = 'Σχετικότητα';
$string['collesm1short'] = 'Σχετικότητα';
$string['collesm2'] = 'Ανακλαστική σκέψη';
$string['collesm2short'] = 'Ανακλαστική σκέψη';
$string['collesm3'] = 'Διαδραστικότητα';
$string['collesm3short'] = 'Διαδραστικότητα';
$string['collesm4'] = 'Υποστήριξη εκπαιδευτή';
$string['collesm4short'] = 'Υποστήριξη εκπαιδευτή';
$string['collesm5'] = 'Υποστήριξη συμμαθητών';
$string['collesm5short'] = 'Υποστήριξη συμμαθητών';
$string['collesm6'] = 'Ερμηνεία';
$string['collesm6short'] = 'Ερμηνεία';
$string['collesmintro'] = 'Σε αυτή την ενότητα εντός σύνδεσης...';
$string['collespintro'] = 'Ο σκοπός αυτής της έρευνας είναι να βοηθήσει εμάς να καταλάβουμε τί εκτιμάτε εσείς σε μια δικτυακή εκπαίδευση. Κάθε μια από τις 24 παρακάτω προτάσεις σας ζητά να αναφέρετε την <b>προτιμώμενη</b> (ιδανική) εμπειρία σε αυτή την ενότητα. Δεν υπάρχουν «σωστές» ή «λάθος» απαντήσεις. Ενδιαφερόμαστε μόνο για τη γνώμη σας. Παρακαλούμε να είστε βέβαιοι πως ο χειρισμός των απαντήσεών σας θα γίνει εμπιστευτικά και δε θα επηρεάσει την αξιολόγησή σας. Οι προσεχτικά θεωρημένες απαντήσεις σας, θα μας βοηθήσουν να βελτιώσουμε τον τρόπο με τον οποίο αυτή η μονάδα θα παρουσιάζεται εντός σύνδεσης στο μέλλον. Σας ευχαριστούμε πολύ.';
$string['collespname'] = 'COLLES (Προτιμώμενη)';
$string['completionsubmit'] = 'Ο μαθητής πρέπει να υποβάλλει στη δραστηριότητα για να την ολοκληρώσει';
$string['customintro'] = 'Περιγραφή';
$string['deleteallanswers'] = 'Διαγραφή όλων των απαντήσεων';
$string['deleteanalysis'] = 'Διαγραφή της ανάλυσης απαντήσεων';
$string['done'] = 'Ολοκληρώθηκε';
$string['download'] = 'Κατέβασμα';
$string['downloadexcel'] = 'Κατέβασμα σαν φύλλο Excel';
$string['downloadinfo'] = 'Μπορείτε να κατεβάσετε ολόκληρη τη σειρά δεδομένων για αυτή την έρευνα σε έναν τύπο κατάλληλο για ανάλυση στο Excel, SPSS ή σε κάποιο άλλο πακέτο.';
$string['downloadresults'] = 'Λήψη αποτελεσμάτων';
$string['downloadtext'] = 'Κατέβασμα σαν αρχείο κειμένου';
$string['editingasurvey'] = 'Επεξεργασία Έρευνας';
$string['errorunabletosavenotes'] = 'Παρουσιάστηκε σφάλμα κατά την αποθήκευση των σημειώσεων σας.';
$string['eventreportdownloaded'] = 'Έγινε λήψη της αναφοράς της έρευνας';
$string['eventreportviewed'] = 'Η αναφορά της έρευνας προβλήθηκε';
$string['eventresponsesubmitted'] = 'Η απάντηση στην έρευνα έχει υποβληθεί';
$string['guestsnotallowed'] = 'Μόνο εγγεγραμμένοι χρήστες μπορούν να υποβάλλουν έρευνες';
$string['howlong'] = 'Πόση ώρα σας πήρε για να συμπληρώσετε αυτή την έρευνα;';
$string['howlongoptions'] = 'Κάτω από 1 λεπτό, 1-2 λεπτά, 2-3 λεπτά, 3-4 λεπτά, 4-5-λεπτά, 5-10 λεπτά, περισσότερο από 10 λεπτά';
$string['ifoundthat'] = 'Ανακάλυψα ότι';
$string['indicator:cognitivedepth'] = 'Βάθος κατανόησης Έρευνας';
$string['indicator:cognitivedepth_help'] = 'Αυτός ο δείκτης βασίζεται στο βάθος κατανόησης που επιτεύχθηκε από τον μαθητή σε μια δραστηριότητα Έρευνας.';
$string['indicator:cognitivedepthdef'] = 'Βάθος κατανόησης Έρευνας';
$string['indicator:cognitivedepthdef_help'] = 'Ο συμμετέχων έχει φτάσει αυτό το ποσοστό αφοσίωσης στο βάθος κατανόησης που προσφέρεται από τις δραστηριότητες Έρευνας κατά τη διάρκεια αυτού του διαστήματος ανάλυσης (Επίπεδα = Καμία εμφάνιση, Εμφάνιση, Υποβολή)';
$string['indicator:cognitivedepthdef_link'] = 'Δείκτες_μαθησιακής_αναλυτικής#Βάθος_κατανόησης';
$string['indicator:socialbreadth'] = 'Κοινωνικό εύρος Έρευνας';
$string['indicator:socialbreadth_help'] = 'Αυτός ο δείκτης βασίζεται στο κοινωνικό εύρος που επιτεύχθηκε από τον μαθητή σε μια δραστηριότητα Έρευνας.';
$string['indicator:socialbreadthdef'] = 'Κοινωνικό εύρος Έρευνας';
$string['indicator:socialbreadthdef_help'] = 'Ο συμμετέχων έχει φτάσει αυτό το ποσοστό αφοσίωσης στο κοινωνικό εύρος που προσφέρεται από τις δραστηριότητες Έρευνας κατά τη διάρκεια αυτού του διαστήματος ανάλυσης (Επίπεδα = Καμία συμμετοχή, Συμμετέχων μόνος)';
$string['indicator:socialbreadthdef_link'] = 'Δείκτες_μαθησιακής_αναλυτικής#Κοινωνικό_εύρος';
$string['introtext'] = 'Κείμενο εισαγωγής';
$string['invalidsurveyid'] = 'Εσφαλμένο id έρευνας';
$string['invalidtmptid'] = 'Εσφαλμένο id τύπου';
$string['ipreferthat'] = 'Προτιμώ το ότι';
$string['modulename'] = 'Έρευνα';
$string['modulename_help'] = 'Το άρθρωμα δραστηριότητας έρευνας παρέχει μια σειρά επαληθευμένων εργαλείων έρευνας που έχουν βρεθεί χρήσιμα στην αξιολόγηση και την τόνωση της μάθησης σε διαδικτυακά περιβάλλοντα. Ένας διδάσκοντας μπορεί να τα χρησιμοποιήσει για να συλλέξει δεδομένα από τους μαθητές του που θα τους βοηθήσουν να μάθουν για την τάξη τους και να αναλογιστεί τη δική του διδασκαλία. Σημειώστε ότι αυτά τα εργαλεία έρευνας είναι προσυμπληρωμένα με ερωτήσεις. Οι διδάσκοντες που επιθυμούν να δημιουργήσουν τη δική τους έρευνα θα πρέπει να χρησιμοποιήσουν το άρθρωμα δραστηριότητας ανατροφοδότησης.';
$string['modulename_link'] = 'άρθρωμα/έρευνα/εμφάνιση';
$string['modulenameplural'] = 'Έρευνες';
$string['name'] = 'Όνομα';
$string['newsurveyresponses'] = 'Νέες απαντήσεις ερευνών';
$string['nobodyyet'] = 'Κανένας δεν έχει ολοκληρώσει αυτή την έρευνα';
$string['notdone'] = 'Δεν έχει γίνει ακόμα';
$string['notes'] = 'Οι προσωπικές σας αναλύσεις και σημειώσεις';
$string['notyetanswered'] = 'Δεν έχει απαντηθεί ακόμα';
$string['othercomments'] = 'Έχετε να κάνετε άλλα σχόλια;';
$string['page-mod-survey-x'] = 'Οποιαδήποτε σελίδα αρθρώματος έρευνας';
$string['peoplecompleted'] = '{$a} άτομα έχουν ολοκληρώσει την έρευνα μέχρι τώρα';
$string['pluginadministration'] = 'Διαχείριση της έρευνας';
$string['pluginname'] = 'Έρευνα';
$string['preferred'] = 'Προτιμώμενες';
$string['preferredclass'] = 'Προτιμώμενη τάξη';
$string['preferredstudent'] = '{$a} προτιμάται';
$string['privacy:metadata:analysis'] = 'Ένα ιστορικό της ανάλυσης των απαντήσεων της έρευνας.';
$string['privacy:metadata:analysis:notes'] = 'Σημειώσεις που αποθηκεύονται σε σχέση με τις απαντήσεις ενός χρήστη.';
$string['privacy:metadata:analysis:userid'] = 'Το αναγνωριστικό του χρήστη που απαντά στην έρευνα.';
$string['privacy:metadata:answers'] = 'Μια συλλογή απαντήσεων σε έρευνες.';
$string['privacy:metadata:answers:answer1'] = 'Πεδίο για την αποθήκευση της απάντησης σε μια ερώτηση.';
$string['privacy:metadata:answers:answer2'] = 'Επιπρόσθετο πεδίο για την αποθήκευση της απάντησης σε μια ερώτηση.';
$string['privacy:metadata:answers:question'] = 'Η ερώτηση.';
$string['privacy:metadata:answers:time'] = 'Πότε αναρτήθηκε η απάντηση.';
$string['privacy:metadata:answers:userid'] = 'Το αναγνωριστικό του χρήστη που υπέβαλε την απάντησή του.';
$string['question'] = 'Ερώτηση';
$string['questions'] = 'Ερωτήσεις';
$string['questionsnotanswered'] = 'Μερικές από τις ερωτήσεις πολλαπλής επιλογής δεν έχουν απαντηθεί.';
$string['report'] = 'Αναφορά έρευνας';
$string['responsereports'] = 'Αναφορές απόκρισης';
$string['responses'] = 'Απαντήσεις';
$string['savednotes'] = 'Οι σημειώσεις σας αποθηκεύτηκαν';
$string['scaleagree5'] = 'Διαφωνώ έντονα, Διαφωνώ μερικώς, Ούτε συμφωνώ ούτε διαφωνώ, Συμφωνώ μερικώς, Συμφωνώ έντονα';
$string['scales'] = 'Κλίμακες';
$string['scaletimes5'] = 'Σχεδόν ποτέ,Σπάνια,Μερικές φορές,Συχνά,Σχεδόν πάντα';
$string['search:activity'] = 'Έρευνα - πληροφορίες δραστηριότητας';
$string['seemoredetail'] = 'Κάντε κλικ εδώ για να δείτε περισσότερες λεπτομέρειες';
$string['selectedquestions'] = 'Επιλεγμένες ερωτήσεις μιας κλίμακας, όλοι οι μαθητές';
$string['summary'] = 'Περίληψη';
$string['survey:addinstance'] = 'Προσθήκη νέας έρευνας';
$string['survey:download'] = 'Κατεβάστε τις απαντήσεις';
$string['survey:participate'] = 'Συμμετοχή στην έρευνα';
$string['survey:readresponses'] = 'Δείτε τις απαντήσεις';
$string['surveycompleted'] = 'Έχετε ολοκληρώσει αυτή την έρευνα. Το παρακάτω γράφημα δείχνει μια σύνοψη των αποτελεσμάτων σας, σε σύγκριση με τους μέσους όρους της τάξης.';
$string['surveycompletednograph'] = 'Έχετε ολοκληρώσει αυτή την έρευνα.';
$string['surveygraph'] = 'Γραφική παράσταση';
$string['surveyname'] = 'Όνομα έρευνας';
$string['surveysaved'] = 'Αποθήκευση έρευνας';
$string['surveytype'] = 'Τύπος έρευνας';
$string['surveytype_help'] = 'Υπάρχουν 3 διαθέσιμοι τύποι έρευνας:

* Έρευνα για την στάση και την μάθηση (Attitudes to Thinking and Learning Survey - ATTLS) - Για την μέτρηση του βαθμού στον οποίο ένα άτομο είναι «συνδεδεμένος γνώστης» (τείνει να βρίσκει την μάθηση πιο ευχάριστη και συχνά είναι πιο συνεργάσιμος, συμπαθής και πιο πρόθυμος να χτίσει πάνω στις ιδέες των άλλων) ή ένας «αυτόνομος γνώστης» (τείνει να έχει πιο κριτική και διαλεκτική στάση απέναντι στη μάθηση)
* Έρευνα κρίσιμων περιστατικών
* Έρευνα κονστρουκτιβιστικού διαδικτυακού μαθησιακού περιβάλλοντος (Critical incidents survey / Constructivist On-line Learning Environment Survey - COLLES) - Για την παρακολούθηση του βαθμού στον οποίο η διαδραστική ικανότητα του παγκόσμιου ιστού μπορεί να χρησιμοποιηθεί για την εμπλοκή μαθητών σε δυναμικές πρακτικές μάθησης';
$string['surveytype_link'] = 'άρθρωμα/έρευνα/άρθρωμα';
$string['thanksforanswers'] = 'Ευχαριστούμε που απαντήσατε σε αυτή την έρευνα, {$a}';
$string['time'] = 'Ώρα';
$string['viewsurveyresponses'] = 'Δείτε {$a} απαντήσεις της έρευνας';
