<?php
// This file is part of Moodle - https://moodle.org/
//
// Moodle is free software: you can redistribute it and/or modify
// it under the terms of the GNU General Public License as published by
// the Free Software Foundation, either version 3 of the License, or
// (at your option) any later version.
//
// Moodle is distributed in the hope that it will be useful,
// but WITHOUT ANY WARRANTY; without even the implied warranty of
// MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
// GNU General Public License for more details.
//
// You should have received a copy of the GNU General Public License
// along with Moodle.  If not, see <https://www.gnu.org/licenses/>.

/**
 * Strings for component 'tool_usertours', language 'el', version '4.5'.
 *
 * @package     tool_usertours
 * @category    string
 * @copyright   1999 Martin Dougiamas and contributors
 * @license     https://www.gnu.org/copyleft/gpl.html GNU GPL v3 or later
 */

defined('MOODLE_INTERNAL') || die();

$string['above'] = 'Πάνω από';
$string['actions'] = 'Ενέργειες';
$string['appliesto'] = 'Ισχύει για';
$string['backdrop'] = 'Εμφάνιση με υπόβαθρο σκηνικού';
$string['backdrop_help'] = 'Μπορείτε να χρησιμοποιήσετε ένα υπόβαθρο σκηνικού για να φωτο-επισημάνετε το τμήμα της σελίδας στο οποίο δείχνετε.

Σημείωση: Το υπόβαθρο σκηνικού δεν είναι συμβατό με ορισμένα μέρη της σελίδας, όπως η γραμμή πλοήγησης.';
$string['below'] = 'Παρακάτω';
$string['block'] = 'Μπλοκ';
$string['block_named'] = 'Μπλοκ με όνομα «{$a}»';
$string['cachedef_stepdata'] = 'Λίστα με βήματα περιηγήσεων χρήστη';
$string['cachedef_tourdata'] = 'Λίστα με πληροφορίες ενεργοποιημένων περιηγήσεων χρήστη που βρίσκει και φέρνει κάθε σελίδα';
$string['confirmstepremovalquestion'] = 'Είστε βέβαιοι ότι θέλετε να καταργήσετε αυτό το βήμα;';
$string['confirmstepremovaltitle'] = 'Επιβεβαίωση κατάργησης βήματος';
$string['confirmtourremovalquestion'] = 'Είστε σίγουροι ότι θέλετε να διαγράψετε αυτή την ξενάγηση;';
$string['confirmtourremovaltitle'] = 'Επιβεβαίωση διαγραφής ξενάγησης';
$string['content'] = 'Περιεχόμενο';
$string['content_heading'] = 'Περιεχόμενο';
$string['content_help'] = 'Περιεχόμενο που περιγράφει το βήμα μπορεί να προστεθεί ως απλό κείμενο, που περικλείεται σε πολυγλωσσικές ετικέτες (για χρήση με το φίλτρο πολυγλωσσικού περιεχομένου), εάν απαιτείται. Εναλλακτικά, ένα (αλφαριθμητικό) αναγνωριστικό γλώσσας μπορεί να εισαχθεί με μορφότυπο: αναγνωριστικό,στοιχείο (χωρίς παρενθέσεις ή κενό διάστημα μετά το κόμμα).';
$string['cssselector'] = 'Επιλογέας CSS';
$string['defaultvalue'] = 'Προεπιλογή ({$a})';
$string['delay'] = 'Καθυστέρηση πριν εμφανιστεί το βήμα';
$string['delay_help'] = 'Μπορείτε προαιρετικά να επιλέξετε να προσθέσετε μια καθυστέρηση πριν εμφανιστεί το βήμα.

Αυτή η καθυστέρηση είναι σε χιλιοστά του δευτερολέπτου.';
$string['description'] = 'Περιγραφή';
$string['displaystepnumbers'] = 'Εμφάνιση αριθμών βημάτων';
$string['displaystepnumbers_help'] = 'Εάν ο αριθμός των βημάτων που απομένουν θα εμφανίζεται στην πλοήγηση ξενάγησης';
$string['done'] = 'Ολοκληρώθηκε';
$string['duplicatetour'] = 'Δημιουργία αντιγράφου ξενάγησης';
$string['duplicatetour_name'] = '{$a} (αντίγραφο)';
$string['editstep'] = 'Επεξεργασία «{$a}»';
$string['enabled'] = 'Ενεργοποιημένο';
$string['endonesteptour'] = 'Ελήφθη!';
$string['endtour'] = 'Τέλος ξενάγησης';
$string['endtourlabel'] = 'Ταμπέλα κουμπιού λήξης ξενάγησης';
$string['endtourlabel_help'] = 'Μπορείτε προαιρετικά να ορίσετε μια προσαρμοσμένη ετικέτα για το πλήκτρο τερματισμού ξενάγησης. Η προεπιλεγμένη ετικέτα είναι «Κατάλαβα!» για ένα βήμα και «Τέλος ξενάγησης» για ξεναγήσεις πολλών βημάτων.';
$string['event_step_shown'] = 'Βήμα που εμφανίζεται';
$string['event_tour_ended'] = 'Η ξενάγηση τελείωσε';
$string['event_tour_reset'] = 'Επαναφορά ξενάγησης';
$string['event_tour_started'] = 'Η ξενάγηση ξεκίνησε';
$string['exporttour'] = 'Εξαγωγή ξενάγησης';
$string['filter_accessdate'] = 'Ημερομηνία πρόσβασης';
$string['filter_accessdate_enabled'] = 'Ενεργοποίηση του φίλτρου ημερομηνίας πρόσβασης';
$string['filter_accessdate_enabled_help'] = 'Εμφάνιση της ξενάγησης μόνο σε νέους χρήστες ή χρήστες που έχουν πρόσφατα προσπελάσει τον ιστότοπο.';
$string['filter_category'] = 'Κατηγορία';
$string['filter_category_help'] = 'Εμφάνιση της ξενάγησης σε μια σελίδα που συσχετίζεται με ένα μάθημα στην επιλεγμένη κατηγορία.';
$string['filter_course'] = 'Μαθήματα';
$string['filter_course_help'] = 'Εμφάνιση της ξενάγησης σε μια σελίδα που συσχετίζεται με το επιλεγμένο μάθημα.';
$string['filter_courseformat'] = 'Μορφότυπος μαθημάτων';
$string['filter_courseformat_help'] = 'Εμφάνιση της ξενάγησης σε μια σελίδα που συσχετίζεται με ένα μάθημα που χρησιμοποιεί τον επιλεγμένο μορφότυπο μαθήματος.';
$string['filter_cssselector'] = 'Επιλογέας CSS';
$string['filter_cssselector_help'] = 'Εμφάνιση της ξενάγησης μόνο όταν ο καθορισμένος επιλογέας CSS βρίσκεται στη σελίδα.';
$string['filter_date_account_creation'] = 'Ημερομηνία δημιουργίας λογαριασμού χρήστη εντός';
$string['filter_date_first_login'] = 'Η πρώτη ημερομηνία πρόσβασης του χρήστη εντός';
$string['filter_date_last_login'] = 'Η τελευταία ημερομηνία πρόσβασης του χρήστη εντός';
$string['filter_header'] = 'Φίλτρα ξενάγησης';
$string['filter_help'] = 'Επιλέξτε τις συνθήκες κάτω από τις οποίες η ξενάγηση θα εμφανίζεται. Για να εμφανιστεί μια ξενάγηση σε ένα χρήστη πρέπει να ικανοποιούνται όλα τα φίλτρα.';
$string['filter_role'] = 'Ρόλος';
$string['filter_role_help'] = 'Μια ξενάγηση μπορεί να περιορίζεται σε χρήστες με επιλεγμένους ρόλους στο πλαίσιο όπου εμφανίζεται η ξενάγηση. Για παράδειγμα, ο περιορισμός μιας ξενάγησης στο Ταμπλό σε χρήστες με το ρόλο του μαθητή δεν θα λειτουργήσει αν οι χρήστες έχουν το ρόλο μαθητών σε ένα μάθημα (όπως συμβαίνει γενικά). Μια ξενάγηση στο Ταμπλό μπορεί να περιοριστεί μόνο σε χρήστες με ρόλο συστήματος.';
$string['filter_theme'] = 'Αισθητικό θέμα';
$string['filter_theme_help'] = 'Εμφάνιση της ξενάγησης όταν ο χρήστης χρησιμοποιεί ένα από τα επιλεγμένα αισθητικά θέματα.';
$string['importtour'] = 'Εισαγωγή ξενάγησης';
$string['left'] = 'Αριστερά';
$string['modifyshippedtourwarning'] = 'Αυτή είναι μια ξενάγηση χρήστη που έχει περιληφθεί στο Moodle. Οποιεσδήποτε τροποποιήσεις πραγματοποιείτε μπορεί να παρακαμφθούν (χαθούν) κατά την επόμενη αναβάθμιση του ιστοτόπου σας.';
$string['movestepdown'] = 'Μετακίνηση του βήματος προς τα κάτω';
$string['movestepup'] = 'Μετακίνηση του βήματος προς τα πάνω';
$string['movetourdown'] = 'Μετακίνηση ξενάγησης προς τα κάτω';
$string['movetourup'] = 'Μετακίνηση ξενάγησης προς τα πάνω';
$string['name'] = 'Όνομα';
$string['newstep'] = 'Νέο βήμα';
$string['newtour'] = 'Δημιουργία νέας ξενάγησης';
$string['next'] = 'Επόμενο';
$string['nextstep'] = 'Επόμενο';
$string['nextstep_sequence'] = 'Επόμενο ({$a->position}/{$a->total})';
$string['options_heading'] = 'Επιλογές';
$string['orphan'] = 'Εμφάνιση εάν ο στόχος δεν βρέθηκε';
$string['orphan_help'] = 'Εμφάνιση του βήματος εάν ο στόχος δεν βρέθηκε στη σελίδα.';
$string['pathmatch'] = 'Εφαρμόστε στη διεύθυνση URL που ταιριάζει';
$string['pathmatch_help'] = 'Περιηγήσεις (οδηγοί βήμα προς βήμα) θα εμφανίζονται σε κάθε σελίδα της οποίας η URL διεύθυνση ταιριάζει με αυτήν την τιμή.

Μπορείτε να χρησιμοποιήσετε τον χαρακτήρα % ως ένα χαρακτήρα μπαλαντέρ για να εκφράσετε οτιδήποτε.

Μερικά παραδείγματα τιμών περιλαμβάνουν:

* /my/% - που εκφράζει το ταμπλό
* /course/view.php?id=2 - που εκφράζει ένα συγκεκριμένο μάθημα
* /mod/forum/view.php% - που εκφράζει την λίστα συζητήσεων ενός φόρουμ
* /user/profile.php% - που εκφράζει την σελίδα προφίλ του χρήστη

Αν θέλετε να εμφανίζεται μια ξενάγηση στην Αρχική σελίδα ιστοτόπου, μπορείτε να χρησιμοποιήσετε την τιμή: «FRONTPAGE».';
$string['pausetour'] = 'Παύση';
$string['placement'] = 'Τοποθέτηση';
$string['placement_help'] = 'Ένα βήμα μπορεί να τοποθετηθεί πάνω, κάτω, αριστερά ή δεξιά του στόχου. Πάνω ή κάτω, συνιστάται, καθώς έτσι προσαρμόζεται καλύτερα στην οθόνη κινητών τηλεφώνων. Αν το βήμα δεν ταιριάζει σε μια συγκεκριμένη σελίδα στο καθορισμένο σημείο, θα τοποθετηθεί αυτόματα αλλού.';
$string['pluginname'] = 'Περιηγήσεις χρηστών';
$string['privacy:metadata:preference:completed'] = 'Πότε ολοκλήρωσε τελευταία ένας χρήστης μια ξενάγηση χρήστη.';
$string['privacy:metadata:preference:requested'] = 'Πότε έγινε τελευταία φορά χειροκίνητα αίτημα από τον χρήστη για μια ξενάγηση χρήστη.';
$string['privacy:request:preference:completed'] = 'Η τελευταία φορά που σημειώσατε την ξενάγηση χρήστη «{$a->name}» ως ολοκληρωμένη ήταν στις {$a->time}';
$string['privacy:request:preference:requested'] = 'Η τελευταία φορά που αιτηθήκατε την ξενάγηση χρήστη «{$a->name}» ήταν στις {$a->time}';
$string['reflex'] = 'Συνεχίστε με κλικ';
$string['reflex_help'] = 'Προχωρήστε στο επόμενο βήμα όταν πατηθεί ο στόχος.';
$string['resettouronpage'] = 'Επαναφορά ξενάγησης χρήστη σε αυτή τη σελίδα';
$string['resumetour'] = 'Επανάληψη/συνέχιση';
$string['right'] = 'Δεξιά';
$string['select_block'] = 'Επιλέξτε ένα μπλοκ';
$string['selector_defaulttitle'] = 'Δώστε έναν περιγραφικό τίτλο';
$string['selectordisplayname'] = 'Ένας επιλογέας CSS που ταιριάζει με «{$a}»';
$string['selecttype'] = 'Επιλογή τύπου βήματος';
$string['sharedtourslink'] = 'Αποθετήριο περιηγήσεων';
$string['skip'] = 'Παράκαμψη';
$string['target'] = 'Στόχος';
$string['target_block'] = 'Μπλοκ';
$string['target_heading'] = 'Στόχος βήματος';
$string['target_selector'] = 'Επιλογέας';
$string['target_selector_targetvalue'] = 'Επιλογείς CSS';
$string['target_selector_targetvalue_help'] = 'Ένας επιλογέας CSS μπορεί να χρησιμοποιηθεί για να στοχεύσει σχεδόν οποιοδήποτε στοιχείο της σελίδας. Ο κατάλληλος επιλογέας μπορεί εύκολα να βρεθεί χρησιμοποιώντας τα εργαλεία προγραμματιστή για τον περιηγητή ιστού σας.';
$string['target_unattached'] = 'Εμφάνιση στη μέση της σελίδας';
$string['targettype'] = 'Τύπος στόχου';
$string['targettype_help'] = 'Κάθε βήμα σχετίζεται με ένα μέρος της σελίδας - το στόχο. Οι τύποι στόχων είναι:

* Μπλοκ - για την εμφάνιση ενός βήματος δίπλα σε ένα συγκεκριμένο μπλοκ
* Επιλογέας CSS - για τον ακριβή ορισμό της περιοχής προορισμού χρησιμοποιώντας CSS
* Εμφάνιση στο μέσον της σελίδας - για ένα βήμα που δεν χρειάζεται να συσχετιστεί με ένα συγκεκριμένο μέρος της σελίδας';
$string['title'] = 'Τίτλος';
$string['title_help'] = 'Ο τίτλος ενός βήματος μπορεί να προστεθεί ως απλό κείμενο, που περικλείεται σε πολυγλωσσικές ετικέτες (για χρήση με το φίλτρο πολυγλωσσικού περιεχομένου) εάν απαιτείται. Εναλλακτικά, ένα αναγνωριστικό συμβολοσειράς γλώσσας μπορεί να εισαχθεί με μορφότυπο: αναγνωριστικό,στοιχείο (χωρίς παρενθέσεις ή κενό διάστημα μετά το κόμμα).';
$string['tour1_content_addingblocks'] = 'Στην πραγματικότητα, σκεφτείτε προσεκτικά αν πρέπει να συμπεριλάβετε κάποιο μπλοκ στις σελίδες σας. Τα μπλοκ δεν εμφανίζονται στην εφαρμογή κινητού Moodle, επομένως, ως γενικός κανόνας, είναι πολύ καλύτερο να βεβαιωθείτε ότι ο ιστότοπός σας λειτουργεί καλά χωρίς μπλοκ.';
$string['tour1_content_blockregion'] = 'Υπάρχει ακόμη μια περιοχή μπλοκ εδώ. Συνιστούμε να καταργήσετε πλήρως τα μπλοκ Πλοήγησης και Διαχείρισης, καθώς όλες οι λειτουργίες βρίσκονται αλλού στο αισθητικό θέμα Boost.';
$string['tour1_content_customisation'] = 'Για να προσαρμόσετε την εμφάνιση του ιστοτόπου σας και της αρχικής σελίδας, χρησιμοποιήστε το μενού ρυθμίσεων στη γωνία αυτής της κεφαλίδας. Δοκιμάστε να ξεκινήσετε την επεξεργασία αμέσως τώρα.';
$string['tour1_content_end'] = 'Αυτό είναι το τέλος της ξενάγησης χρήστη σας. Δεν θα εμφανιστεί ξανά εκτός αν την επαναφέρετε χρησιμοποιώντας το σύνδεσμο στο υποσέλιδο. Ως διαχειριστής μπορείτε επίσης να δημιουργήσετε τις δικές σας περιηγήσεις όπως αυτή!';
$string['tour1_content_navigation'] = 'Η κύρια πλοήγηση γίνεται τώρα μέσω αυτού του συρταριού πλοήγησης. Τα περιεχόμενα ενημερώνονται σε σχέση με το πού βρίσκεστε στον ιστότοπο. Χρησιμοποιήστε το κουμπί στην κορυφή για απόκρυψη/εμφάνισή του.';
$string['tour1_content_welcome'] = 'Καλώς ορίσατε στο θέμα Boost. Εάν κάνατε αναβάθμιση από μια παλαιότερη έκδοση, ίσως βρείτε ότι κάποια πράγματα φαίνονται λίγο διαφορετικά με αυτό το αισθητικό θέμα.';
$string['tour1_title_addingblocks'] = 'Προσθήκη μπλοκ';
$string['tour1_title_blockregion'] = 'Περιοχή μπλοκ';
$string['tour1_title_customisation'] = 'Προσαρμογή';
$string['tour1_title_end'] = 'Τέλος ξενάγησης';
$string['tour1_title_navigation'] = 'Πλοήγηση';
$string['tour1_title_welcome'] = 'Καλώς ορίσατε';
$string['tour2_content_addblock'] = 'Αν ενεργοποιήσετε την επεξεργασία, μπορείτε να προσθέσετε μπλοκ από το συρτάρι πλοήγησης. Ωστόσο, σκεφτείτε προσεκτικά το να συμπεριλάβετε οποιοδήποτε μπλοκ στις σελίδες σας. Τα μπλοκ δεν εμφανίζονται στην εφαρμογή κινητού Moodle, οπότε για την καλύτερη εμπειρία χρήστη είναι προτιμότερο να βεβαιωθείτε ότι το μάθημά σας λειτουργεί καλά χωρίς καθόλου μπλοκ.';
$string['tour2_content_addingblocks'] = 'Μπορείτε να προσθέσετε μπλοκ σε αυτή τη σελίδα χρησιμοποιώντας αυτό το κουμπί. Ωστόσο, σκεφτείτε προσεκτικά για να συμπεριλάβετε τυχόν μπλοκ στις σελίδες σας. Τα μπλοκ δεν εμφανίζονται στην εφαρμογή Moodle, οπότε για την καλύτερη εμπειρία χρήστη είναι καλύτερο να βεβαιωθείτε ότι η πορεία σας λειτουργεί καλά χωρίς μπλοκ.';
$string['tour2_content_customisation'] = 'Για να αλλάξετε ρυθμίσεις μαθημάτων, χρησιμοποιήστε το μενού ρυθμίσεων στη γωνία αυτής της κεφαλίδας. Θα βρείτε ένα παρόμοιο μενού ρυθμίσεων στην αρχική σελίδα κάθε δραστηριότητας. Δοκιμάστε να ξεκινήσετε την επεξεργασία αμέσως τώρα.';
$string['tour2_content_end'] = 'Αυτό είναι το τέλος της ξενάγησης χρήστη σας. Δεν θα εμφανιστεί ξανά εκτός αν την επαναφέρετε χρησιμοποιώντας το σύνδεσμο στο υποσέλιδο. Ο διαχειριστής ιστοτόπου μπορεί επίσης να δημιουργήσει επιπλέον περιηγήσεις για αυτόν τον ιστότοπο αν απαιτείται!';
$string['tour2_content_navigation'] = 'Η πλοήγηση γίνεται τώρα μέσω αυτού του συρταριού πλοήγησης. Χρησιμοποιήστε το κουμπί στην κορυφή για απόκρυψη ή εμφάνισή του. Θα δείτε ότι υπάρχουν σύνδεσμοι για ενότητες του μαθήματός σας.';
$string['tour2_content_opendrawer'] = 'Δοκιμάστε να ανοίξετε τώρα το συρτάρι πλοήγησης.';
$string['tour2_content_participants'] = 'Δείτε τους συμμετέχοντες εδώ. Αυτός είναι ο χώρος όπου μπορείτε να προσθέσετε ή να αφαιρέσετε μαθητές.';
$string['tour2_content_welcome'] = 'Καλώς ορίσατε στο αισθητικό θέμα Boost. Εάν ο ιστότοπός σας έχει αναβαθμιστεί από μια παλαιότερη έκδοση, ίσως βρείτε ότι κάποια πράγματα φαίνονται λίγο διαφορετικά εδώ, στη σελίδα του μαθήματος.';
$string['tour2_title_addblock'] = 'Προσθήκη ενός μπλοκ';
$string['tour2_title_addingblocks'] = 'Προσθήκη των μπλοκ';
$string['tour2_title_customisation'] = 'Προσαρμογή';
$string['tour2_title_end'] = 'Τέλος ξενάγησης';
$string['tour2_title_navigation'] = 'Πλοήγηση';
$string['tour2_title_opendrawer'] = 'Άνοιγμα του συρταριού πλοήγησης';
$string['tour2_title_participants'] = 'Συμμετέχοντες μαθήματος';
$string['tour2_title_welcome'] = 'Καλώς ορίσατε';
$string['tour3_content_dashboard'] = 'Το νέο Ταμπλό σας, διαθέτει πολλές λειτουργίες για να βοηθήσει την πρόσβασή σας, στις πιο σημαντικές πληροφορίες για εσάς.';
$string['tour3_content_displayoptions'] = 'Τα μαθήματα μπορούν να ταξινομηθούν ως προς το όνομα του μαθήματος, ως προς το σύντομο όνομα μαθήματος ή ως προς την τελευταία ημερομηνία πρόσβασης.

Μπορείτε επίσης να επιλέξετε να εμφανίζονται τα μαθήματα σε μια λίστα, με συνοπτικές πληροφορίες ή την προεπιλεγμένη προβολή «κάρτας».';
$string['tour3_content_overview'] = 'Το μπλοκ Επισκόπηση μαθημάτων εμφανίζει όλα τα μαθήματα στα οποία είστε εγγεγραμμένοι.

Μπορείτε να επιλέξετε να εμφανίζονται μαθήματα που βρίσκονται σε εξέλιξη ή στο παρελθόν ή στο μέλλον ή τα μαθήματα τα οποία έχετε επισημάνει με αστερίσκο.';
$string['tour3_content_recentcourses'] = 'Το μπλοκ Πρόσφατα προσπελασμένα μαθήματα δείχνει τα μαθήματα που επισκεφθήκατε τελευταία, επιτρέποντάς σας να μεταπηδήσετε κατευθείαν ξανά σε αυτά.';
$string['tour3_content_starring'] = 'Μπορείτε να επιλέξετε να σημειώσετε με αστέρι ένα μάθημα για να το ξεχωρίσετε ή να αποκρύψετε ένα μάθημα που δεν είναι πλέον σημαντικό για εσάς.

Αυτές οι ενέργειες επηρεάζουν μόνο ότι προβάλλεται σε εσάς.

Μπορείτε επίσης να επιλέξετε να εμφανίζονται τα μαθήματα σε μια λίστα ή με συνοπτικές πληροφορίες ή την προεπιλεγμένη προβολή «κάρτας».';
$string['tour3_content_timeline'] = 'Το μπλοκ Χρονολόγιο εμφανίζει τα σημαντικά επερχόμενα γεγονότα σας.

Μπορείτε να επιλέξετε να προβάλλετε δραστηριότητες της επόμενης εβδομάδας, μήνα ή και πιο μελλοντικά.

Μπορείτε επίσης να εμφανίσετε στοιχεία που είναι εκπρόθεσμα.';
$string['tour3_title_dashboard'] = 'Το Ταμπλό σας';
$string['tour3_title_displayoptions'] = 'Επιλογές εμφάνισης';
$string['tour3_title_overview'] = 'Επισκόπηση μαθημάτων';
$string['tour3_title_recentcourses'] = 'Πρόσφατα προσπελασμένα μαθήματα';
$string['tour3_title_starring'] = 'Αστέρια και απόκρυψη μαθημάτων';
$string['tour3_title_timeline'] = 'Μπλοκ χρονολογίου';
$string['tour4_content_groupconvo'] = 'Εάν είστε μέλος μιας ομάδας με ενεργοποιημένα τα ομαδικά μηνύματα, θα δείτε εδώ ομαδικές συνομιλίες.

Οι ομαδικές συνομιλίες μαθημάτων σάς επιτρέπουν να αλληλεπιδράτε με τους άλλους στην ομάδα σας σε μια ιδιωτική και βολική τοποθεσία.';
$string['tour4_content_icon'] = 'Μπορείτε να έχετε πρόσβαση στα μηνύματά σας από οποιαδήποτε σελίδα χρησιμοποιώντας αυτό το εικονίδιο.

Αν έχετε μη αναγνωσμένα μηνύματα, ο αριθμός των μη αναγνωσμένων μηνυμάτων θα εμφανιστεί και εδώ.

Κάντε κλικ στο εικονίδιο για να ανοίξετε το συρτάρι ανταλλαγής μηνυμάτων και να συνεχίσετε την ξενάγηση.';
$string['tour4_content_messaging'] = 'Οι νέες λειτουργίες ανταλλαγής μηνυμάτων περιλαμβάνουν την ανταλλαγή ομαδικών μηνυμάτων μέσα σε ένα μάθημα και καλύτερο έλεγχο του ποιος μπορεί να σας στείλει μήνυμα.';
$string['tour4_content_settings'] = 'Μπορείτε να αποκτήσετε πρόσβαση στις ρυθμίσεις μηνυμάτων μέσω του εικονιδίου με το γρανάζι. Μια νέα ρύθμιση απορρήτου σας επιτρέπει να περιορίσετε ποιος μπορεί να σας στείλει μήνυμα.';
$string['tour4_content_starred'] = 'Μπορείτε να επιλέξετε να σημειώσετε με αστέρι συγκεκριμένες συνομιλίες για να διευκολύνετε την εύρεσή τους.';
$string['tour4_title_groupconvo'] = 'Ομαδικά μηνύματα';
$string['tour4_title_icon'] = 'Μηνύματα';
$string['tour4_title_messaging'] = 'Νέα διεπαφή ανταλλαγής μηνυμάτων';
$string['tour4_title_settings'] = 'Ρυθμίσεις ανταλλαγής μηνυμάτων';
$string['tour4_title_starred'] = 'Με αστερίσκο';
$string['tour_activityinfo_activity_student_content'] = 'Οι ημερομηνίες δραστηριότητας συν τι πρέπει να κάνετε για να ολοκληρώσετε τη δραστηριότητα εμφανίζονται στη σελίδα δραστηριότητας.';
$string['tour_activityinfo_activity_student_title'] = 'Νέο: Πληροφορίες δραστηριότητας';
$string['tour_activityinfo_activity_teacher_content'] = 'Οι ημερομηνίες δραστηριότητας και οι συνθήκες ολοκλήρωσης εμφανίζονται τώρα για τους μαθητές σε κάθε σελίδα δραστηριότητας (και προαιρετικά στη σελίδα του μαθήματος).

Για δραστηριότητες που απαιτούν από τους μαθητές να επισημάνουν με μη αυτόματο τρόπο μια δραστηριότητα ως ολοκληρωμένη, εμφανίζεται το πλήκτρο «Επισήμανση ως ολοκληρωμένης» στη σελίδα δραστηριότητας.';
$string['tour_activityinfo_activity_teacher_title'] = 'Νέο: Πληροφορίες δραστηριότητας';
$string['tour_activityinfo_course_student_content'] = 'Οι ημερομηνίες δραστηριότητας και/ή τι πρέπει να κάνετε για να ολοκληρώσετε τη δραστηριότητα εμφανίζονται στη σελίδα του μαθήματος.';
$string['tour_activityinfo_course_student_title'] = 'Νέο: Πληροφορίες δραστηριότητας';
$string['tour_activityinfo_course_teacher_content'] = 'Οι νέες ρυθμίσεις μαθήματος «Εμφάνιση συνθηκών ολοκλήρωσης» και «Εμφάνιση ημερομηνιών δραστηριότητας» σάς δίνουν τη δυνατότητα να επιλέξετε εάν οι συνθήκες ολοκλήρωσης δραστηριότητας (εάν έχουν οριστεί) και/ή οι ημερομηνίες εμφανίζονται για τους μαθητές στη σελίδα του μαθήματος.';
$string['tour_activityinfo_course_teacher_title'] = 'Νέο: Πληροφορίες δραστηριότητας';
$string['tour_final_step_content'] = 'Αυτό είναι το τέλος της ξενάγησης χρήστη σας. Δεν θα εμφανιστεί ξανά εκτός αν την επαναφέρετε χρησιμοποιώντας το σύνδεσμο στο υποσέλιδο.';
$string['tour_final_step_title'] = 'Τέλος ξενάγησης';
$string['tour_resetforall'] = 'Στην κατάσταση της ξενάγησης έχει γίνει επαναφορά. Θα εμφανιστεί ξανά σε όλους τους χρήστες.';
$string['tourconfig'] = 'Αρχείο ρυθμίσεων ξενάγησης προς εισαγωγή';
$string['tourisenabled'] = 'Η ξενάγηση είναι ενεργοποιημένη';
$string['tourlist_explanation'] = 'Μπορείτε να δημιουργήσετε όσες περιηγήσεις επιθυμείτε και να τις ενεργοποιήσετε για διάφορα μέρη του Moodle. Μόνο μία ξενάγηση μπορεί να δημιουργηθεί ανά σελίδα.';
$string['tours'] = 'Περιηγήσεις';
$string['usertours'] = 'Περιηγήσεις χρηστών';
$string['usertours:managetours'] = 'Δημιουργία, επεξεργασία και διαγραφή περιηγήσεων χρηστών';
$string['viewtour_edit'] = 'Μπορείτε να <a href="{$a->editlink}">επεξεργαστείτε τις προεπιλογές της ξενάγησης</a> και <a href="{$a->resetlink}">να επιβάλετε την εμφάνιση της ξενάγησης</a> ξανά σε όλους τους χρήστες.';
$string['viewtour_info'] = 'Αυτή είναι η ξενάγηση «{$a->tourname}». Ισχύει για το μονοπάτι «{$a->path}».';
